[
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Which stocks should traders buy as indices hit a nine-month high?",
    "Description Story": "Decline in crude oil prices has supported oil marketing companies move higher, said Chandan Taparia, head of technical and derivatives research at Motilal Oswal Financial Services.\n“The stock has seen meaningful long additions on Friday and has been making higher lows for the last 4 trading sessions,” he said.\nThe stock also gave a consolidation breakout after 35 long weeks. Traders can buy the contracts with support at Rs 425 for an upside target towards Rs 465 levels.\nLive Events\nThe stock rose due to short covering on Friday, said Vipin Kumar, AVP, derivatives and technical research at Globe Capital Market.\n“On charts, it is trading on the verge of a fresh breakout from a year-long congestion zone at Rs 10,130-12,396. Considering its current chart structure and derivatives data, we expect the stock to move northward in near term and test Rs 13,500- Rs 14,000 levels,” he said. Kumar suggested traders buy its July futures with a stop loss at Rs 11,400.\nIndraprastha has given a consolidation breakout on daily and weekly charts with a decisive close above Rs 214 levels, said Taparia.\n“The stock has seen support-based buying with addition in option interests, which clearly indicates that longs are being added at current juncture for next move,” he said.\nTraders can buy Indraprastha contracts with support at Rs 207 for an upside target towards Rs 228.\nSudeep Shah, head, technical and derivative research at SBI Securities, said, on daily chart, stock has registered a breakout supported by robust volume participation— signalling strong buying interest.\n“This breakout not only validates the underlying strength but also marks shift in sentiment after consolidation,” he said.\nShah recommends stock in the zone of Rs 7,320-Rs 7,280 with a stop loss of Rs 7,080, for a target of Rs 7,750.\nShah said the stock has recently given a ‘stage-2 cup pattern’ breakout on a daily scale.\n“This breakout is confirmed by robust volume. Currently, the stock is trading above its short and longterm moving averages, and these averages are edging higher, which is a bullish sign,” he said.\nHe recommends accumulating the stock in the zone of `810-`800 with a stop loss of `780, for a target of `870 in the short term.\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\nAs benchmark indices hit a nine-month high in the last week of June, traders are looking to ride the bullish wave. A look at some of the stock futures that have seen higher-than-average rollovers to the July series and poised to move up further.CMP: Rs 439 Change in Open Interest in July Series: 9% Change in Price in July Series: 4.3%CMP: Rs 12,234 Change in Open Interest in July Series: -2.81% Change in Price in July Series: +1.96%CMP: `299 Change in Open Interest in July Series: -1% Change in Price in July Series: +1.60% Technically, it is well placed on multiple time frames and has bounced back sharply from its price support of `285, said Kumar. “All the parameters are indicating higher probability of positive momentum in this stock in the near term,” he said. Hence, we suggest traders to go long till it is holding above `284 levels and expect it to test `315-`325 in near term.”CMP: Rs 213.85 Change in Open Interest in July Series: 13% Change in Price in July Series: 3%CMP: Rs 7,305 Change in Open Interest in July Series: 0.38% Change in Price in July Series: 2.71%CMP: Rs 807.35 Change in Open Interest in July Series: -6.28% Change in Price in July Series: 0.34%",
    "Date&Time": "2025-06-30T00:40:58Z",
    "By Whom": "Kairavi Lukka",
    "Bussiness Impact": "Decline in crude oil prices has supported oil marketing companies move higher, said Chandan Taparia, head of technical and derivatives research at Motilal Oswal Financial Services.\n“The stock has seen meaningful long additions on Friday and has been making higher lows for the last 4 trading session...",
    "URL reference": "https://economictimes.indiatimes.com/markets/stocks/news/which-stocks-should-traders-buy-as-indices-hit-a-nine-month-high/articleshow/122149662.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122149680,width-1200,height-630,imgsize-26662,overlay-etmarkets/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Kairavi Lukka, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Apollo Hospitals MD on Growth Outlook, Healthtech Arm Spinoff",
    "Description Story": "Apollo Hospitals Managing Director, Suneeta Reddy, says she expects to see 14% growth in company revenue in the next three years. On Bloomberg's Insight with Haslinda Amin, she also told us exclusively about prospects for their planned healthtech arm spinoff.",
    "Date&Time": "2025-07-02T06:16:34Z",
    "By Whom": "Bloomberg",
    "Bussiness Impact": "Apollo Hospitals Managing Director, Suneeta Reddy, says she expects to see 14% growth in company revenue in the next three years. On Bloomberg's Insight with Haslinda Amin, she also told us exclusively about prospects for their planned healthtech arm spinoff.",
    "URL reference": "https://finance.yahoo.com/video/apollo-hospitals-md-growth-outlook-061634656.html",
    "Image URL": "https://s.yimg.com/ny/api/res/1.2/e0VHZfhyt9gSMHZEj32WRA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/bloomberg_markets_video_2/05fed7c2f75c2cd8e712736ac84f5f5b",
    "Type Of News": "Competitor News",
    "Tags": "Bloomberg, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "The Future Of Healthcare Is Collaborative—And AI Is The Catalyst",
    "Description Story": "Sustainable innovation from AI requires consistent collaboration between institutions.",
    "Date&Time": "2025-06-11T13:56:27Z",
    "By Whom": "Ted Ladd, Contributor, \n Ted Ladd, Contributor\n https://www.forbes.com/sites/tedladd/",
    "Bussiness Impact": "Sustainable innovation from AI requires consistent collaboration between institutions.",
    "URL reference": "https://www.forbes.com/sites/tedladd/2025/06/11/the-future-of-healthcare-is-collaborative-and-ai-is-the-catalyst/",
    "Image URL": "https://imageio.forbes.com/specials-images/imageserve/683f5516ba07b942182a6681/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "Type Of News": "Competitor News",
    "Tags": "Ted Ladd, Contributor, \n Ted Ladd, Contributor\n https://www.forbes.com/sites/tedladd/, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "TriHealth acquires Clinton Memorial Hospital, continuing rural expansion",
    "Description Story": "TriHealth has acquired Clinton Memorial Hospital in Wilmington, a city located 50 miles northeast of Cincinnati, according to a release emailed by the hospital system Monday.\nPatients who currently receive care at Clinton Memorial can expect to see the same services and providers with the transition, according to Brian Eagan, a spokesperson for TriHealth, while getting increased access to TriHealth's acute and complex care.\n\"\"The plan is for patients to continue seeing the providers they know,\"\" Eagen said.\nHe declined to share how much TriHealth paid to acquire the 140-bed facility.\nTriHealth continues rural expansion\nClinton Memorial will be TriHealth's sixth acute care hospital, and its second in a rural area, after McCullough-Hyde Memorial Hospital in Oxford.\n\"\"This acquisition serves as the latest proof point and evidence of TriHealth’s commitment to strengthen access to rural healthcare,\"\" said Eagan, who also pointed to TriHealth's partnerships with other rural hospitals such as Highland District Hospital and Adams County Hospital.\nWith TriHealth's acquisition, Clinton Memorial will move from a for-profit ownership to a nonprofit model.\nThe hospital was previously owned by ScionHealth, a hospital chain owned by private equity firm Apollo Global Management.\nThe chain operates at least 85 hospitals across the country but permanently closed at least three hospitals in Chicago and Tampa earlier this year, due to high amounts of debt and financial distress.",
    "Date&Time": "2025-06-16T21:13:42Z",
    "By Whom": "Elizabeth B. Kim, Cincinnati Enquirer",
    "Bussiness Impact": "TriHealth has acquired Clinton Memorial Hospital in Wilmington, a city located 50 miles northeast of Cincinnati, according to a release emailed by the hospital system Monday.\nPatients who currently receive care at Clinton Memorial can expect to see the same services and providers with the transitio...",
    "URL reference": "https://www.cincinnati.com/story/news/2025/06/16/trihealth-acquires-clinton-memorial-second-rural-hospital-in-7-years/84233032007/",
    "Image URL": "https://s.yimg.com/ny/api/res/1.2/4fcPAU6zyjgKFTA2fKS77Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/cincinnati-com-the-enquirer/fae06cfe1c4e987b72f4f59453d1a009",
    "Type Of News": "Competitor News",
    "Tags": "Elizabeth B. Kim, Cincinnati Enquirer, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Abbott launches lab-based test to evaluate concussions",
    "Description Story": "Healthcare company Abbott has launched its laboratory-based blood test to evaluate concussions or a mild traumatic brain injury (mTBI).\n“The test offers a reliable result in 18 minutes to help clinicians quickly evaluate brain injury and triage mTBI patients. The diagnostic tool also helps eliminate the need for CT scans by up to 40 percent with a high degree of certainty eliminating wait time at the hospital and unnecessary exposure to radiation, a note from the company said. The test would be helpful in areas where access to CT systems may be limited, it added.\nThe traumatic brain injury (TBI) test runs on Abbott’s Alinity i and Architect i1000SR laboratory instruments, available in major hospitals and laboratories including Apollo, Hyderabad and Neuberg Supratech Laboratory, Abbott said. The test measures two biomarkers in the blood - ubiquitin C-terminal hydrolase L1 (UCH-L1) and glial fibrillary acidic protein (GFAP) - that, in elevated concentrations, are correlated to brain injury, the note explained.\nRavi Sinha, General Manager and Country Head (Diagnostics), Abbott India said, “Abbott’s TBI blood test improves patient evaluation and delivers reliable results in just minutes helping doctors quickly and accurately rule out the need for a CT scan. This means less time spent in emergency care and less stress for patients and families.”\nlong-term risks\nTBIs can be caused by a bump, blow or jolt to the head and can pose short- and long-term risks and nearly one million people are estimated to experience it every year, in India, the note said. Further, they are among the most common neurological disorders worldwide, affecting millions each year, it added.\n“In India, 77 percent of head injury referrals were patients with mild TBI. Many people don’t seek medical attention after a head injury, thinking their symptoms aren’t serious,” the note said, stressing screening, detection and early diagnosis.\nPublished on June 25, 2025",
    "Date&Time": "2025-06-25T12:59:13Z",
    "By Whom": "Our Bureau",
    "Bussiness Impact": "Healthcare company Abbott has launched its laboratory-based blood test to evaluate concussions or a mild traumatic brain injury (mTBI).\n“The test offers a reliable result in 18 minutes to help clinicians quickly evaluate brain injury and triage mTBI patients. The diagnostic tool also helps eliminat...",
    "URL reference": "https://www.thehindubusinessline.com/news/abbott-launches-lab-based-test-to-evaluate-concussions/article69736132.ece",
    "Image URL": "https://bl-i.thgim.com/public/incoming/5dt5jy/article69736159.ece/alternates/LANDSCAPE_1200/IMG_iStock-1221032250_2_1_8RCB92ND.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Our Bureau, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Apollo Hospitals shares in focus after board approves major restructuring; to list digital health, pharmacy arms",
    "Description Story": "It seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
    "Date&Time": "2025-07-01T03:06:36Z",
    "By Whom": "ETMarkets.com",
    "Bussiness Impact": "It seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
    "URL reference": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-hospitals-shares-in-focus-after-board-approves-major-restructuring-to-list-digital-health-pharmacy-arms/articleshow/122172042.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122172033,width-1200,height-630,imgsize-29084,overlay-etmarkets/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ETMarkets.com, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "L&T’s Buildings & Factories proposes to enter into ₹2,400 crore contract with Apollo Hospitals",
    "Description Story": "The Buildings & Factories (B&F) vertical of Larsen & Toubro (L&T) Construction, proposes to enter into contracts to construct hospital buildings across various locations in India for the Chennai-based Apollo Hospitals Enterprise (Apollo) Ltd. The contracts are cumulatively valued at around ₹2,400 crore.\nThese proposals will be placed before L&T’s shareholders during the company’s 80th Annual General Meeting to be held on June 17.\nThe duration of these contracts will range 1.5 years to 3 years depending on the specific project requirements. The monetary value of the transactions is estimated to be ₹2,400 crore, says the AGM notice of L&T.\nL&T will cater to the specialised needs of Apollo, and the execution of these projects will broaden the company’s revenue base. This, in turn, will contribute to enhanced shareholder value creation, the notice said.\nB&F undertakes Engineering, Procurement and Construction of all types of building and factory structures. In the health segment, it possesses the capability for the design and construction of hospitals including procurement, installation and commissioning of medical equipment, stated the company website.\nBoth companies declined to comment beyond the notice.\nPublished on June 11, 2025\nCompanies to follow Apollo Hospitals Enterprise Ltd",
    "Date&Time": "2025-06-11T14:56:39Z",
    "By Whom": "TE Raja Simhan",
    "Bussiness Impact": "The Buildings & Factories (B&F) vertical of Larsen & Toubro (L&T) Construction, proposes to enter into contracts to construct hospital buildings across various locations in India for the Chennai-based Apollo Hospitals Enterprise (Apollo) Ltd. The contracts are cumulatively valued at around ₹2,400 cr...",
    "URL reference": "https://www.thehindubusinessline.com/news/real-estate/lts-buildings-factories-proposes-to-enter-into-2400-crore-contract-with-apollo-hospitals/article69677688.ece",
    "Image URL": "https://bl-i.thgim.com/public/incoming/ws6nz3/article69683700.ece/alternates/LANDSCAPE_1200/Apollo_Hospitals_1.jpg",
    "Type Of News": "Competitor News",
    "Tags": "TE Raja Simhan, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Sensex edges higher as PSU Banks rally, Apollo Hospitals leads Nifty gainers",
    "Description Story": "Markets ended Tuesday’s session with marginal gains as investors adopted a cautious stance despite entering a seasonally strong month. The Sensex closed 90.83 points or 0.11 per cent higher at 83,697.29, while the Nifty 50 gained 24.75 points or 0.10 per cent to settle at 25,541.80.\nThe session was characterized by subdued trading volumes and narrow price movements, with the Nifty oscillating within a tight 100-point band throughout the day. Market participants remained hesitant following Monday’s decline, leading to a consolidation phase after last week’s sharp rally driven by easing geopolitical tensions and optimism over potential U.S. trade developments.\nApollo Hospitals emerged as the top gainer on the Nifty 50, surging 3.63 per cent to close at ₹7,505, followed by Bharat Electronics which advanced 2.70 per cent to ₹432.90. Reliance Industries gained 1.75 per cent to end at ₹1,526.80, while Asian Paints rose 1.24 per cent to ₹2,370.10 and SBI Life Insurance climbed 1.19 per cent to ₹1,860.10.\nOn the downside, Nestle India led the laggards with a decline of 2.22 per cent to ₹2,410.50, while Axis Bank fell 2.14 per cent to ₹1,173.50. Shriram Finance dropped 1.53 per cent to ₹696.05, Trent declined 1.29 per cent to ₹6,137, and Eicher Motors slipped 1.25 per cent to ₹260.85.\n“Today, the Indian stock market closed in a sideways, range bound manner with the Sensex marginally up by 90 points and the Nifty50 barely rising 24.75 points,” said Vaibhav Vidwani, Research Analyst at Bonanza Group. “The market witnessed choppy trading as investors remained cautious despite entering a seasonally strong month.”\nSectoral performance remained mixed with PSU banks leading the gainers, rallying 0.7 per cent for the second consecutive session. The Nifty Bank index gained 0.26 per cent to close at 57,459.45, supported by strength in infrastructure and metal counters. However, media stocks faced significant selling pressure, with the Nifty Media index declining 1.35 per cent. FMCG, IT, and auto sectors also witnessed profit-booking.\nMarket breadth remained nearly balanced with 2,021 stocks advancing against 1,989 declining issues on the BSE. A total of 4,164 stocks were traded, while 168 stocks hit their 52-week highs compared to 46 touching 52-week lows. Six stocks were locked in upper circuit while nine hit lower circuit limits.\nThe broader markets reflected the cautious sentiment as the Nifty Midcap 100 closed marginally higher by 0.01 per cent at 59,750.05, while the Nifty Next 50 declined 0.10 per cent to 68,930.20. The Nifty Financial Services index fell 0.18 per cent to 27,124.20.\n“Markets traded lackluster and ended almost unchanged, taking a breather after Monday’s decline,” noted Ajit Mishra, SVP Research at Religare Broking. “Following an initial uptick, the Nifty moved in a narrow range and eventually settled at 25,541.80.”\nTechnical analysts highlighted the formation of a Doji candlestick pattern on the daily charts, indicating indecisiveness among market participants. “A small candlestick formation on daily charts and non-directional intraday activity indicate indecisiveness between the bulls and the bears,” observed Shrikant Chouhan, Head Equity Research at Kotak Securities.\nThe Indian rupee strengthened during the session, gaining 0.28 per cent to close at 85.51 against the dollar. “Rupee traded positive with gains of 0.28 per cent at 85.51, supported by a weaker Dollar Index trading below 97.00 and sustained crude oil price weakness,” said Jateen Trivedi, VP Research Analyst at LKP Securities. “The softer dollar environment has helped the rupee extend its recent rally.”\nCommodity markets witnessed positive momentum with gold prices surging significantly. MCX Gold rose by ₹1,200 to settle around ₹97,300, while Comex Gold jumped $30 to $3,345. “Gold traded positive as dollar weakness continued to support prices,” Trivedi explained. “The sentiment remains buoyant this week, driven by expectations around key US economic data.”\nFrom a technical perspective, analysts identified key support and resistance levels for the near term. “For the bulls, the immediate breakout zones are 25,600/83,900,” Chouhan stated. “A successful breakout above these levels could push the market toward 25,700–25,750 / 84,200–84,400.”\nRupak De, Senior Technical Analyst at LKP Securities, emphasized the importance of key levels: “For the short term, support is seen at 25,500; a decisive fall below this level might trigger long unwinding in the market. However, if the index holds above 25,500, a recovery could emerge, potentially pushing the Nifty towards 25,600–25,800.”\nThe session’s narrow trading range of just 196 points marked the tightest intraday movement since June 9, reflecting the current phase of consolidation. “This subdued price action reflects a phase of consolidation and hesitation among market participants,” commented Sudeep Shah, Head Technical Research at SBI Securities.\nLooking ahead, market participants are closely monitoring upcoming corporate earnings with Q1 FY26 results set to begin next week. “Confidence in domestic earnings growth remains crucial for sustaining market sentiment, with Q1 FY26 results expected to provide further insight,” said Vinod Nair, Head of Research at Geojit Investments.\nInvestors are also watching key U.S. economic data releases this week, including Non-Farm Payrolls, unemployment figures, and ADP employment data, which could influence global market direction. “Market participants will closely watch key US data this week, which could influence dollar direction,” Trivedi added, with the rupee expected to trade in a range of 85.20 to 85.80.\nWith multiple supportive factors including favorable monsoon conditions, declining inflation, benign crude prices, and government efforts to boost demand, analysts remain cautiously optimistic about market prospects in the near term.\nPublished on July 1, 2025",
    "Date&Time": "2025-07-01T11:31:42Z",
    "By Whom": "Anupama Ghosh",
    "Bussiness Impact": "Markets ended Tuesday’s session with marginal gains as investors adopted a cautious stance despite entering a seasonally strong month. The Sensex closed 90.83 points or 0.11 per cent higher at 83,697.29, while the Nifty 50 gained 24.75 points or 0.10 per cent to settle at 25,541.80.\nThe session was...",
    "URL reference": "https://www.thehindubusinessline.com/markets/stock-markets/sensex-edges-higher-as-psu-banks-rally-apollo-hospitals-leads-nifty-gainers/article69759476.ece",
    "Image URL": "https://bl-i.thgim.com/public/incoming/re8wnq/article69228526.ece/alternates/LANDSCAPE_1200/IMG_Businessman_using_la_2_1_L6DBU8AR.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Anupama Ghosh, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "These 4 healthcare stocks hit 52-week high and rally up to 25% in a month",
    "Description Story": "Performance Tracker\nOn Tuesday, the benchmark Sensex rose 91 points to settle at 83,679. Amid this modest market uptrend, four stocks from the BSE Healthcare Index marked fresh 52-week highs, touching their highest levels in a year. These breakout moves are typically seen by traders and investors as bullish signals, indicating strong upward momentum and the possibility of continued price gains.",
    "Date&Time": "2025-07-01T12:55:24Z",
    "By Whom": "Ritesh+Presswala, ETMarkets.com",
    "Bussiness Impact": "Performance Tracker\nOn Tuesday, the benchmark Sensex rose 91 points to settle at 83,679. Amid this modest market uptrend, four stocks from the BSE Healthcare Index marked fresh 52-week highs, touching their highest levels in a year. These breakout moves are typically seen by traders and investors a...",
    "URL reference": "https://m.economictimes.com/markets/web-stories/these-4-healthcare-stocks-hit-52-week-high-and-rally-up-to-25-in-a-month/slideshow/122185185.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122185207,width-900,height-1200,resizemode-6.cms",
    "Type Of News": "Competitor News",
    "Tags": "Ritesh+Presswala, ETMarkets.com, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "'Buy' Apollo Hospitals Maintains HDFC Securities, Hikes Target Price - Here's Why",
    "Description Story": "HDFC Securities sees strong growth visibility across segments— Hospitals: improving occupancy, average revenue per occupied bed growth, and capacity expansion; Healthco: steady offline growth and Apollo 24/7 scale-up; Apollo Health and Lifestyle: consistent growth and margin improvement.",
    "Date&Time": "2025-07-03T06:01:37Z",
    "By Whom": "HDFC Securities Institutional Equities",
    "Bussiness Impact": "HDFC Securities sees strong growth visibility across segments— Hospitals: improving occupancy, average revenue per occupied bed growth, and capacity expansion; Healthco: steady offline growth and Apollo 24/7 scale-up; Apollo Health and Lifestyle: consistent growth and margin improvement.",
    "URL reference": "https://www.ndtvprofit.com/research-reports/buy-apollo-hospitals-maintains-hdfc-securities-hikes-target-price-heres-why",
    "Image URL": "https://media.assettype.com/bloombergquint%2F2025-07-03%2F6ho3kg5x%2FPhoto-source-Apollo-Hospital-website.jpg?rect=0%2C8%2C750%2C394&w=1200&auto=format%2Ccompress&ogImage=true",
    "Type Of News": "Competitor News",
    "Tags": "HDFC Securities Institutional Equities, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Apollo Hospitals Shares Jump to Record on Healthtech Arm Spinoff",
    "Description Story": "Linda Yaccarino resigns as CEO of Elon Musk's X after two turbulent years marked by internal conflicts and a merger with Musk’s AI company, leaving the platform’s future uncertain.\nMarket Summary Markets face mixed signals as Trump’s tariff threats unsettle equities, though tech stocks like Nvidia surge to record highs. Aviation gains on Delta's strong outlook, while cautious investors monitor inflation and trade policy uncertainties.\nLinda Yaccarino Leaves X CEO Role... Power Struggles Cited X CEO Linda Yaccarino Steps Down After Two Turbulent Years Linda Yaccarino's challenging tenure as CEO of Elon Musk's social media platform X ends amid internal power struggles and a merger with Musk's AI company. The abrupt resignation raises questions about control and the platform's future direction.\nFigure of the Day 50% - Trump’s new tariff rate imposed on Brazilian imports escalating trade tensions.\nTrump Hits Brazil With 50% Tariff... Cites Bolsonaro 'Witch Hunt' Trump Tariffs Brazil, Demands End to Bolsonaro Trial President Trump escalates trade tensions by imposing a sweeping 50% tariff on imports from Brazil, citing retaliation over the legal treatment of former President Bolsonaro. The move intensifies geopolitical risks and rattles markets.\nNvidia Becomes First $4 Trillion Company... AI Boom Booster Chipmaker Nvidia Hits Historic $4T Market Cap Record Nvidia shatters market records by becoming the first company to hit a $4 trillion valuation, driven by its dominance in AI chip technology amid surging demand. This milestone highlights the tech sector's outsized role in current market rallies.\nBullish Nvidia Becomes First $4 Trillion Public Company Amid AI Boom Nvidia hits an unprecedented $4 trillion valuation, marking a historic milestone fueled by its leadership in AI technology and investor enthusiasm. More on 247wallst.com\nDelta Air Lines Surges on Record Revenue... Demand Stabilizing Delta Sparks Airline Rally After Raising Guidance... Dividend Hike Delta Air Lines posts record revenue and revises its financial outlook higher as flight demand stabilizes amid economic uncertainties. The airline’s bullish forecast sparks gains across the aviation sector.\nFerrero Nears $3.1B Deal to Acquire WK Kellogg Co. WK Kellogg Stock Soars on Reports of $3B Ferrero Takeover Ferrero, the Italian confectionery giant behind Nutella, agrees to acquire WK Kellogg for $3.1 billion, merging iconic cereal brands like Froot Loops under its portfolio, in a deal reflecting growing consolidation in the food sector.\nBearish Conagra Stock Tumbles on Tariff-Driven Profit Guidance Cut Conagra shares fall sharply after the food giant cites tariff-related cost pressures leading to a negative profit outlook, signaling broader inflation challenges.\nCopper Prices Jump 50% Tariffs Loom... Market Jitters Mount Trump Tariffs Roil Markets... Copper and Steel Surge US tariffs announced by President Trump are fueling market volatility, with copper prices surging amid tight supply and trade policy uncertainty. These measures are weighing on earnings forecasts and global trade dynamics.\nMicrosoft AI Saves $500M... Job Cuts Continue Microsoft Stock Hits Record High on AI Earnings Boost Microsoft leverages AI savings of over $500 million internally while trimming thousands of jobs, reflecting a productivity drive fueled by automation despite headcount cuts.\nRegulatory Impact The European Union unveiled a Code of Practice on AI outlining transparency, copyright, and safety guidelines to assist businesses in complying with the EU AI Act.\nOpenAI Readies AI Browser to Take On Google Chrome OpenAI to Release AI-Powered Web Browser Shortly OpenAI prepares to launch an AI-powered web browser aiming to challenge Google Chrome’s dominance, marking a major shift in online search and browsing.\nPentagon Becomes Largest Shareholder in MP Materials... Shares Surge MP Materials Stock Soars on Defense Dept Rare Earth Deal The US Department of Defense increases its stake in rare earth magnet producer MP Materials, driving shares up 40% amid efforts to secure critical supply chains away from China.\nQuote The abrupt resignation shakes the foundation of X’s vision—control was never hers to command.\n— Industry Insider on Linda Yaccarino’s departure\nStocks Falter As Trump Tariffs Rattle Nvidia-Led Rally Market Rally Stalls... Amid Tariff Fears and Trade Uncertainty Stock markets remain cautious amid new tariff threats and geopolitical tensions. Major indices show mixed performance as investors await clarity on trade policies and economic forecasts.\nXRP Options Surge Near $100M... Crypto Bulls Rally XRP Price Tests $2.46 Barrier Following Burst Rally XRP and other cryptocurrencies attract investor interest, with XRP options reaching near $100 million amid high volatility and bullish momentum.\nTesla Promises Robotaxi Expansion With Grok AI Rollout Grok AI Arrives in Tesla Cars Next Week — Elon Musk Tesla intensifies plans for robotaxi expansion, integrating xAI's Grok AI chatbot into its vehicles next week despite recent stock volatility and leadership concerns.\nBiden's Doctor Pleads Fifth in GOP Probe Former Biden Physician Refuses to Answer Health Investigation The Biden administration faces scrutiny as former White House doctor invokes the Fifth Amendment amid GOP probes, highlighting ongoing political tensions.\nAmazon Unveils AI Servers to Power Nvidia Chips Amazon intensifies AI infrastructure with new powerful servers designed to support Nvidia chips amidst an accelerating AI boom, strengthening its cloud services.\nJane Birkin’s Original Hermès Bag Hits Paris Auction UK auctions historic Jane Birkin Hermès bag, spotlighting luxury collectibles as investment assets amid growing global demand.\nTexas Flood Death Toll Rises... Search Expands for Missing Massive Texas floods leave over 120 dead and more than 170 missing, raising questions on disaster preparedness and response as recovery efforts continue.\nFDA Pushes Transparency With Release of Drug Rejection Letters FDA begins publishing drug rejection letters in a transparency initiative aiming to shed light on regulatory decisions and improve public trust.",
    "Date&Time": "2025-07-01T08:26:37Z",
    "By Whom": "bloomberg.com",
    "Bussiness Impact": "Linda Yaccarino resigns as CEO of Elon Musk's X after two turbulent years marked by internal conflicts and a merger with Musk’s AI company, leaving the platform’s future uncertain.\nMarket Summary Markets face mixed signals as Trump’s tariff threats unsettle equities, though tech stocks like Nvidia ...",
    "URL reference": "https://biztoc.com/x/14966c2c025f373a",
    "Image URL": "https://biztoc.com/cdn/14966c2c025f373a_s.webp",
    "Type Of News": "Competitor News",
    "Tags": "bloomberg.com, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Gainers & Losers: Gabriel India, Raymond among 6 stocks that moved most on Tuesday",
    "Description Story": "Newsmakers of D-Street\nIndian headline indices managed to deliver a positive closing on Tuesday catapulted by index heavyweights Reliance Industries (RIL) and HDFC Bank who contributed most towards their rise. While Nifty gained 24.75 points or 0.10% to close at 25,541.80, the 30-stock S&P BSE Sensex finished at 83,697.29, rising by 90.83 points or 0.11%. Here are the stocks that saw action today:",
    "Date&Time": "2025-07-01T11:48:13Z",
    "By Whom": "Shivendra+Kumar, ETMarkets.com",
    "Bussiness Impact": "Newsmakers of D-Street\nIndian headline indices managed to deliver a positive closing on Tuesday catapulted by index heavyweights Reliance Industries (RIL) and HDFC Bank who contributed most towards their rise. While Nifty gained 24.75 points or 0.10% to close at 25,541.80, the 30-stock S&P BSE Sens...",
    "URL reference": "https://m.economictimes.com/markets/web-stories/gainers-amp-losers-gabriel-india-raymond-among-6-stocks-that-moved-most-on-tuesday/slideshow/122183916.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122183981,width-900,height-1200,resizemode-6.cms",
    "Type Of News": "Competitor News",
    "Tags": "Shivendra+Kumar, ETMarkets.com, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Apollo Hospitals to list its pharmacy and digital health business in 18-21 months",
    "Description Story": "Apollo Hospitals Enterprise Limited (AHEL) late on Monday announced plans to list its omnichannel pharmacy and digital health business in the next 18-21 months as part of a strategic reorganization.\nThe company’s board of directors has approved the demerger of its omnichannel pharma and digital health business, Apollo HealthCo, into a new entity—NewCo—through a composite scheme of arrangement. Following the demerger, Keimed, the wholesale pharmaceutical distributor that Apollo acquired last year, will be amalgamated with NewCo.\nAlso read | Apollo Hospitals' healthy capacity addition to drive future growth Apollo Hospitals shareholders will have direct shareholding in the combined entity. For every 100 shares of AHEL, shareholders will receive 195.2 shares of the new entity, the company said.\nIntegrated ecosystem The proposed transaction will result in the creation of the largest, integrated omnichannel healthcare ecosystem with a FY25 revenue of ₹16,300 crore ($1.9 billion) in FY25, the company said.\nThe new business, comprising Apollo 24/7, the digital health platform, the offline pharma distribution business, Keimed, and telehealth services, is expected to achieve a revenue run rate of ₹25,000 crores ($2.9 billion) by FY27.\nIn an interview with Mint last week, Shobana Kamineni, executive chairperson of Apollo HealthCo, said that the entity is expected to hit a ₹30,000 crore valuation in the next five to six years, as it grows exponentially.\nAlso read | Apollo to invest ₹ 6,000 crore to add 3,500 new beds as chronic diseases rise The listing is expected within 18 to 21 months. NewCo will become an Indian owned and controlled company (IOCC) once the scheme is put into effect. NewCo plans to consolidate the front-end pharmacy business by acquiring the remaining 74.5% stake in Apollo Medicals Pvt. Ltd (AMPL), which owns 100% of Apollo HealthCo. This will enable the NewCo to participate fully in the business economics of retail pharmacies, the company said.\nAHEL will retain 15% stake in NewCo and will have one nominee director on the Board of NewCo.",
    "Date&Time": "2025-07-01T02:32:38Z",
    "By Whom": "Jessica Jani",
    "Bussiness Impact": "Apollo Hospitals Enterprise Limited (AHEL) late on Monday announced plans to list its omnichannel pharmacy and digital health business in the next 18-21 months as part of a strategic reorganization.\nThe company’s board of directors has approved the demerger of its omnichannel pharma and digital hea...",
    "URL reference": "https://www.livemint.com/companies/news/apollo-hospitals-list-pharmacy-digital-health-business-18-21-months-ahel-strategic-reorganization-11751301044338.html",
    "Image URL": "https://www.livemint.com/lm-img/img/2025/07/01/1600x900/2-0-324083239-apollo2-0_1680435928988_1751336928240.JPG",
    "Type Of News": "Competitor News",
    "Tags": "Jessica Jani, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "India's Apollo Hospitals to spin off digital health, pharmacy unit in 18-21 months",
    "Description Story": "Linda Yaccarino resigns as CEO of Elon Musk's X after two turbulent years marked by internal conflicts and a merger with Musk’s AI company, leaving the platform’s future uncertain.\nMarket Summary Markets face mixed signals as Trump’s tariff threats unsettle equities, though tech stocks like Nvidia surge to record highs. Aviation gains on Delta's strong outlook, while cautious investors monitor inflation and trade policy uncertainties.\nLinda Yaccarino Leaves X CEO Role... Power Struggles Cited X CEO Linda Yaccarino Steps Down After Two Turbulent Years Linda Yaccarino's challenging tenure as CEO of Elon Musk's social media platform X ends amid internal power struggles and a merger with Musk's AI company. The abrupt resignation raises questions about control and the platform's future direction.\nFigure of the Day 50% - Trump’s new tariff rate imposed on Brazilian imports escalating trade tensions.\nTrump Hits Brazil With 50% Tariff... Cites Bolsonaro 'Witch Hunt' Trump Tariffs Brazil, Demands End to Bolsonaro Trial President Trump escalates trade tensions by imposing a sweeping 50% tariff on imports from Brazil, citing retaliation over the legal treatment of former President Bolsonaro. The move intensifies geopolitical risks and rattles markets.\nNvidia Becomes First $4 Trillion Company... AI Boom Booster Chipmaker Nvidia Hits Historic $4T Market Cap Record Nvidia shatters market records by becoming the first company to hit a $4 trillion valuation, driven by its dominance in AI chip technology amid surging demand. This milestone highlights the tech sector's outsized role in current market rallies.\nBullish Nvidia Becomes First $4 Trillion Public Company Amid AI Boom Nvidia hits an unprecedented $4 trillion valuation, marking a historic milestone fueled by its leadership in AI technology and investor enthusiasm. More on 247wallst.com\nDelta Air Lines Surges on Record Revenue... Demand Stabilizing Delta Sparks Airline Rally After Raising Guidance... Dividend Hike Delta Air Lines posts record revenue and revises its financial outlook higher as flight demand stabilizes amid economic uncertainties. The airline’s bullish forecast sparks gains across the aviation sector.\nFerrero Nears $3.1B Deal to Acquire WK Kellogg Co. WK Kellogg Stock Soars on Reports of $3B Ferrero Takeover Ferrero, the Italian confectionery giant behind Nutella, agrees to acquire WK Kellogg for $3.1 billion, merging iconic cereal brands like Froot Loops under its portfolio, in a deal reflecting growing consolidation in the food sector.\nBearish Conagra Stock Tumbles on Tariff-Driven Profit Guidance Cut Conagra shares fall sharply after the food giant cites tariff-related cost pressures leading to a negative profit outlook, signaling broader inflation challenges.\nCopper Prices Jump 50% Tariffs Loom... Market Jitters Mount Trump Tariffs Roil Markets... Copper and Steel Surge US tariffs announced by President Trump are fueling market volatility, with copper prices surging amid tight supply and trade policy uncertainty. These measures are weighing on earnings forecasts and global trade dynamics.\nMicrosoft AI Saves $500M... Job Cuts Continue Microsoft Stock Hits Record High on AI Earnings Boost Microsoft leverages AI savings of over $500 million internally while trimming thousands of jobs, reflecting a productivity drive fueled by automation despite headcount cuts.\nRegulatory Impact The European Union unveiled a Code of Practice on AI outlining transparency, copyright, and safety guidelines to assist businesses in complying with the EU AI Act.\nOpenAI Readies AI Browser to Take On Google Chrome OpenAI to Release AI-Powered Web Browser Shortly OpenAI prepares to launch an AI-powered web browser aiming to challenge Google Chrome’s dominance, marking a major shift in online search and browsing.\nPentagon Becomes Largest Shareholder in MP Materials... Shares Surge MP Materials Stock Soars on Defense Dept Rare Earth Deal The US Department of Defense increases its stake in rare earth magnet producer MP Materials, driving shares up 40% amid efforts to secure critical supply chains away from China.\nQuote The abrupt resignation shakes the foundation of X’s vision—control was never hers to command.\n— Industry Insider on Linda Yaccarino’s departure\nStocks Falter As Trump Tariffs Rattle Nvidia-Led Rally Market Rally Stalls... Amid Tariff Fears and Trade Uncertainty Stock markets remain cautious amid new tariff threats and geopolitical tensions. Major indices show mixed performance as investors await clarity on trade policies and economic forecasts.\nXRP Options Surge Near $100M... Crypto Bulls Rally XRP Price Tests $2.46 Barrier Following Burst Rally XRP and other cryptocurrencies attract investor interest, with XRP options reaching near $100 million amid high volatility and bullish momentum.\nTesla Promises Robotaxi Expansion With Grok AI Rollout Grok AI Arrives in Tesla Cars Next Week — Elon Musk Tesla intensifies plans for robotaxi expansion, integrating xAI's Grok AI chatbot into its vehicles next week despite recent stock volatility and leadership concerns.\nBiden's Doctor Pleads Fifth in GOP Probe Former Biden Physician Refuses to Answer Health Investigation The Biden administration faces scrutiny as former White House doctor invokes the Fifth Amendment amid GOP probes, highlighting ongoing political tensions.\nAmazon Unveils AI Servers to Power Nvidia Chips Amazon intensifies AI infrastructure with new powerful servers designed to support Nvidia chips amidst an accelerating AI boom, strengthening its cloud services.\nJane Birkin’s Original Hermès Bag Hits Paris Auction UK auctions historic Jane Birkin Hermès bag, spotlighting luxury collectibles as investment assets amid growing global demand.\nTexas Flood Death Toll Rises... Search Expands for Missing Massive Texas floods leave over 120 dead and more than 170 missing, raising questions on disaster preparedness and response as recovery efforts continue.\nFDA Pushes Transparency With Release of Drug Rejection Letters FDA begins publishing drug rejection letters in a transparency initiative aiming to shed light on regulatory decisions and improve public trust.",
    "Date&Time": "2025-06-30T14:38:39Z",
    "By Whom": "reuters.com",
    "Bussiness Impact": "Linda Yaccarino resigns as CEO of Elon Musk's X after two turbulent years marked by internal conflicts and a merger with Musk’s AI company, leaving the platform’s future uncertain.\nMarket Summary Markets face mixed signals as Trump’s tariff threats unsettle equities, though tech stocks like Nvidia ...",
    "URL reference": "https://biztoc.com/x/28892f2c8dbf35dd",
    "Image URL": "https://biztoc.com/cdn/28892f2c8dbf35dd_s.webp",
    "Type Of News": "Competitor News",
    "Tags": "reuters.com, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Apollo Hospitals, AU SFB among 7 Nifty500 large & midcap stocks that hit fresh 52-week highs on Tuesday",
    "Description Story": "Indian equity benchmark indices were flat on Tuesday, as heavyweight financials eased after a four-month rally, while investors awaited progress in trade talks with the United States ahead of a looming July 9 tariff deadline. Meanwhile, seven large- and mid-cap stocks from the Nifty500 index scaled fresh 52-week highs. Here’s a quick snapshot:",
    "Date&Time": "2025-07-01T07:29:15Z",
    "By Whom": "Getty Images",
    "Bussiness Impact": "Indian equity benchmark indices were flat on Tuesday, as heavyweight financials eased after a four-month rally, while investors awaited progress in trade talks with the United States ahead of a looming July 9 tariff deadline. Meanwhile, seven large- and mid-cap stocks from the Nifty500 index scaled ...",
    "URL reference": "https://m.economictimes.com/markets/stocks/news/apollo-hospitals-au-sfb-among-7-nifty500-large-midcap-stocks-that-hit-fresh-52-week-highs-on-tuesday/fresh-peaks/slideshow/122177321.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122177321,width-1070,height-580,overlay-etmarkets/slideshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Getty Images, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Stocks to buy today: Titan, Marico among 7 trading ideas for 1 July 2025",
    "Description Story": "Live Events\nWe have collated stocks from various experts for traders with a short-term trading horizon:\nExpert: Ajit Mishra – SVP, Research, Religare Broking Ltd (told ET Bureau)\nExpert: Sharan Lillaney, Independent SEBI Research Analyst\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\nThe Indian market is likely to trade higher on Tuesday, tracking positive global cues.The Nifty futures closed lower with losses of 0.53% at 25,615 on Monday. India VIX rose more than 3% to close at 12.78 in the previous session.On the options front, the maximum Call open interest (OI) is placed at the 25,600 and then the 26,000 strikes, while the maximum Put OI is placed at the 25,500 and then the 25,000 strikes.Call writing is seen at the 25,600 and 25,800 strikes, while Put writing is observed at the 25,200 and 24,900 strikes.“Options data suggests a broader trading range between 25,000 and 26,000 zones, while the immediate range lies between 25,300 and 25,700 levels,” said Chandan Taparia, Analyst–Derivatives at Motilal Oswal Financial Services Limited “Nifty50 formed a bearish candle similar to a Bearish Engulfing pattern on the daily frame on Monday and gave up its gains from the previous session,” he said.“Now, if it manages to hold above 25,500, an up move could be seen towards the 25,650 and 25,750 zones, while supports can be seen at 25,400 and then 25,250,” Taparia recommended.Buy | Target Rs 7,650 | Stop Loss Rs 7,030Buy | Target Rs 7,180 | Stop Loss Rs 6,600Buy | Target Rs 678 | Stop Loss Rs 625Buy | Target Rs 3,980 | Stop Loss Rs 3,550Buy | Target Rs 5,760 | Stop Loss Rs 5,555Buy | Target Rs 1,670 | Stop Loss Rs 1,590Buy | Target Rs 738 | Stop Loss Rs 707",
    "Date&Time": "2025-07-01T03:26:36Z",
    "By Whom": "Kshitij Anand",
    "Bussiness Impact": "Live Events\nWe have collated stocks from various experts for traders with a short-term trading horizon:\nExpert: Ajit Mishra – SVP, Research, Religare Broking Ltd (told ET Bureau)\nExpert: Sharan Lillaney, Independent SEBI Research Analyst\n(You can now subscribe to our\n(You can now subs...",
    "URL reference": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-titan-marico-among-7-trading-ideas-for-1-july-2025/articleshow/122172285.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122172278,width-1200,height-630,imgsize-54240,overlay-etmarkets/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Kshitij Anand, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Market Wrap: Sensex climbs 90 pts, Nifty tops 25,500 as investors eye U.S. trade talks",
    "Description Story": "Live Events\nExpert Views\nGlobal Markets\nCrude Impact\nRupee vs Dollar\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\nIndian benchmark indices, Sensex and Nifty, ended slightly higher on Tuesday, mirroring a rally in Asian peers, as investors looked ahead to developments in trade negotiations with the U.S. before the upcoming July 9 tariff deadline.The BSE Sensex advanced 90.83 points, or 0.11%, to close at 83,697.29, while the NSE Nifty gained 24.75 points, or 0.1%, to settle at 25,541.80.Among the 30 Sensex constituents, Bharat Electronics Kotak Mahindra Bank , and HDFC Bank were the top gainers, rising between 0.6% and 2.5%.Heavyweight Reliance Industries offset broader sectoral losses, ending 1.8% higher after Nuvama raised its target price to a Street-high of Rs 1,801, citing improved growth prospects in its new energy business. Reliance is the third-largest weighted stock on the Nifty.Investor sentiment remained cautious ahead of the July 9 deadline set by former U.S. President Donald Trump for potential tariff action. A Reuters report said India could finalise a deal with the U.S. as early as this week, with Indian officials extending their visit to resolve pending trade issues and strike an early agreement.Financial stocks slipped 0.2%, easing for a second consecutive session after hitting record highs on Friday. However, state-run lenders advanced, with the Nifty PSU Bank index gaining 0.7%.Among individual stocks, Apollo Hospitals surged 3.5% after announcing plans to spin off and list its digital health and pharmacy business within 18 to 21 months.Meanwhile, shares of Sigachi Industries tumbled another 5.6%, deepening Monday’s 12% loss following a deadly fire at its Telangana plant that killed at least 39 people.The broader market was mixed. The Nifty Smallcap 100 ended 0.1% lower, while the Nifty Midcap 100 closed flat.Commenting on Tuesday’s tepid session, Shrikant Chouhan, Head of Equity Research at Kotak Securities, said the benchmark indices showed \"\"lackluster activity.\"\" Buying interest was seen in PSU banks and defence stocks, while media stocks underperformed.Technically, Chouhan noted the market traded in a narrow range throughout the day, reflecting indecisiveness. \"\"A small candlestick formation on daily charts and non-directional intraday activity indicate indecisiveness between the bulls and the bears,\"\" he said. A breakout above 25,600/83,900 could push the Nifty toward 25,700–25,750 and the Sensex toward 84,200–84,400, while a breach below 25,470/83,500 might trigger selling pressure.Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities, observed that despite facing resistance near the previous downside gap area around 25,650, the Nifty managed to close higher. “Bullish chart pattern like higher tops and bottoms is in store on the daily chart,” he said, suggesting that the current consolidation could be a healthy pause before the next leg up.Shetti added, “Further consolidation/weakness from here could find strong support around 25,400–25,300 levels, where one may expect sharp bounce from the lows. However, a decisive move above the high of 25,700 could open the next upside targets of around 26,000–26,200 levels in the near term.”Asian stocks edged higher on Tuesday as investors awaited a crucial U.S. Senate vote on President Donald Trump's tax and spending bill, a proposal estimated to add $3.3 trillion to U.S. debt and facing heated debate in Congress.While global markets had rallied to record highs a day earlier on trade optimism, the prolonged wrangling over the legislation weighed on sentiment. The bill, which Trump hopes to pass before the July 4 holiday, has faced pushback from both Republicans and Democrats over its sweeping scope.Japan’s Nikkei fell as much as 1.3%, pressured by a stronger yen that hurt exporters. Meanwhile, MSCI’s broadest index of Asia-Pacific shares outside Japan rose 0.4%, led by South Korea’s Kospi, which gained 1.1%.In China, the blue-chip CSI300 added 0.1%, while the Shanghai Composite inched up 0.2%. Investors also remained cautious ahead of key U.S. labour market data due Thursday, as global trade negotiators race to resolve tariff issues before looming deadlines.Oil prices held steady on Tuesday as investors weighed expectations of an OPEC+ output hike in August alongside ongoing trade negotiations.At 0901 GMT, Brent crude edged up 5 cents to $66.79 a barrel, while U.S. West Texas Intermediate rose 4 cents to $65.15.The Indian rupee firmed up on Tuesday, closing 0.3% higher at 85.52 against the U.S. dollar, tracking gains across most Asian currencies. Weakness in the greenback was driven by concerns over President Donald Trump's fiscal plans and lingering uncertainty around global trade agreements.The dollar index, which measures the currency against a basket of six major peers, slipped 0.46% to 96.43.",
    "Date&Time": "2025-07-01T10:14:15Z",
    "By Whom": "ETMarkets.com",
    "Bussiness Impact": "Live Events\nExpert Views\nGlobal Markets\nCrude Impact\nRupee vs Dollar\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\nIndian benchmark indices, Sensex and Nifty, ended slightly higher on Tuesday, mirroring a rally in Asian peers, as investors look...",
    "URL reference": "https://economictimes.indiatimes.com/markets/commodities/news/market-wrap-sensex-climbs-90-pts-nifty-tops-25500-as-investors-eye-u-s-trade-talks/articleshow/122180878.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122180810,width-1200,height-630,imgsize-83026,overlay-etmarkets/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ETMarkets.com, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Neeraj Dewan bullish on NBFCs and PSU banks, sees continued momentum ahead",
    "Description Story": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\n\"\"There is a possibility that you can get some improvement in the valuation, in the way the stock has been performing and next one to two years you stay invested in Apollo , you should get a decent return from these levels and of course, this value unlocking will also help, which has been long pending and people have been expecting this,\"\" says Neeraj Dewan , Market Expert.Actually, I have been positive on this hospital and healthcare segment and Apollo Hospitals has not given that kind of return which other hospital chain like a Fortis has given over the last few years. So, there is a possibility that you can get some improvement in the valuation, in the way the stock has been performing and next one to two years you stay invested in Apollo, you should get a decent return from these levels and of course, this value unlocking will also help, which has been long pending and people have been expecting this.It will take some more time definitely to get the whole thing into place, this goes through a process so that will take some time, but for long-term investor definitely this should be a good bet to stay invested in.With the recent measures by RBI for project financing and with the liquidity infusion that RB has done and interest rate cut, over the next two to three quarters you will get the impact of all this coming into power financers, companies like IREDA, they should benefit and there should be increase in credit flow which should happen, so credit demand should also pick up because of this. So, I am positive on this space. Next two to three quarters you should see the impact and the stock prices should also reflect that in the next one year.Yes, actually still it is a wait and watch as far as IT is concerned. One should see how things pan out as far as US is concerned. So, once you get little more clarity what is happening because still there is a fear of some slowdown happening, tariff situation still not that clear, you are reaching a stage where again the tariff talks started. So, if there is a slowdown which is happening because of that in US later, it is still not so clear. So, still wait and watch for it. Let us see what the IT majors have to say, what they have to say post results and then we will take a call from there.I think this quarter should again be muted because there is not too much expectation from this quarter, June quarter, because first quarter is normally that great a quarter, normally a lot of the booking and everything is done in the last quarter or the last couple of quarters.So, first and second quarter normally a little muted. But let us see if we are able to beat this expectation which is low right now.I am positive on PSU banks and NBFCs, some specific housing finance companies. These are the ones where you have seen some momentum also picking up. NBFCs should continue doing well, this quarter should also be decent for them. Even specific housing finance companies should do well.And then I am positive on infrastructure. I am positive on autos, but specifically something like two wheelers or companies which are into tractor and farm equipment, there some improvement should be visible. And beside that, FMCG is one space where because inflation is low, expectation of good monsoon would have also created some improvement in demand there.So, it is early to say whether the demand improvement has happened or not, but we will get some view post the results from the companies also. Capital good is one space where you have seen improvement happening. You see that order flow improvement, some execution pickup has also happened in project. So, capital good is another sector I will be watching for in this result.Yes, definitely government expenditure had come to a standstill earlier in the year, but during March there was a view that they had picked up and order flows have also improved, execution is improving because liquidity improving. So, I think that there should be some visible improvement which we could see in these results though the full impact would not have come but you will get some improvement, plus post result conference calls will also give a better view of what is there ahead of us. There should be improvement that should be there.See, it is more again stock specific. I am not looking at only largecaps. It is more of a mid and smallcap which should also do well. So, I feel that if you look at companies like, for example, company like a Bajaj Auto , it is a largecap company, it is trading at below what long-term average valuation because of obvious reason the management commentary and the results have not been that great.But some visible pickup happening there can have a good impact on the share price of Bajaj Auto if you see some improvement happening there. And other stock that I am looking in the largecap basket would be something like Divi’s which I have been positive on. They are showing improvement and now the stock price is also reflecting that.So, for a long-term investor Divi’s Lab would still be a good pick as far as pharma is concerned. And beside that like I mentioned capital good space is one space where I am looking at the largecap names in capital good that should do well and then I mentioned PSU banks, there also I am positive on, though initially there is a NIM which may contract because of the interest rate cut, but then overall credit demand should pick up. So, next two-three quarters we can see that improvement happening in the credit demand.",
    "Date&Time": "2025-07-01T07:33:25Z",
    "By Whom": "ET Now",
    "Bussiness Impact": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\n\"\"There is a possibility that you can get some improvement in the valuation, in the way the stock has been performing and next one to two years you stay invested in Apollo , you should get a dece...",
    "URL reference": "https://economictimes.indiatimes.com/markets/expert-view/neeraj-dewan-bullish-on-nbfcs-and-psu-banks-sees-continued-momentum-ahead/articleshow/122177160.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122177192,width-1200,height-630,imgsize-28404,overlay-etmarkets/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ET Now, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Nifty Top Gainers, Losers On July 3: Dr. Reddy's, Apollo Hospitals To SBI Life, Kotak Mahindra",
    "Description Story": "Dr. Reddy's saw the highest gains among the lot, closing 1.90% higher at Rs 1,295 apiece. Apollo Hospitals and Hero MotoCorp both closed up 1.75% at Rs 7,572.50 and Rs 4,318 per share, respectively.\nONGC closed with 1.24% gains at Rs 244.05 apiece on the NSE. Maruti Suzuki India Ltd. gained 1.03%, closing at Rs 12,752.\nSBI Life Insurance marked the most losses among the lot, ending 2.87% lower at Rs 1,803.60. Kotak Mahindra Bank and Bajaj Finserv also closed 1.96% and 1.40% lower at Rs 2,126.60 and Rs 1,979.80, respectively. JSW Steel closed 1.26% down at Rs 1,046.50 apiece on the NSE. Grasim stock closed in the red, declining 1.24% at Rs 2,814.40 per share.\nIndian benchmark equity indices closed lower on Thursday. The NSE Nifty 50 ended 48.10 points or 0.19% lower at 25,405.40, while the BSE Sensex closed 170.22 points or 0.20% down at 83,239.47. During the day, Nifty fell 0.27% to trade at 25,384.35 and Sensex declined 0.27% to 83,186.74.",
    "Date&Time": "2025-07-03T10:35:29Z",
    "By Whom": "Divya Prata",
    "Bussiness Impact": "Dr. Reddy's saw the highest gains among the lot, closing 1.90% higher at Rs 1,295 apiece. Apollo Hospitals and Hero MotoCorp both closed up 1.75% at Rs 7,572.50 and Rs 4,318 per share, respectively.\nONGC closed with 1.24% gains at Rs 244.05 apiece on the NSE. Maruti Suzuki India Ltd. gained 1.03%, ...",
    "URL reference": "https://www.ndtvprofit.com/markets/nifty-top-gainers-losers-on-july-3-dr-reddys-apollo-hospitals-to-sbi-life-kotak-mahindra",
    "Image URL": "https://media.assettype.com/bloombergquint%2F2025-07-01%2Filjnxh8g%2Fguy-working-with-computer-2024-10-18-22-11-08-utc.jpg?rect=0%2C524%2C7360%2C3864&w=1200&auto=format%2Ccompress&ogImage=true",
    "Type Of News": "Competitor News",
    "Tags": "Divya Prata, NewsAPI.org"
  },
  {
    "Company": "Apollo Hospitals",
    "Headline Title": "Apollo Hospitals to hive off pharmacy, digital biz",
    "Description Story": "Chennai: Apollo Hospitals Enterprise, controlled by the Prathap Reddy family, has announced a significant reorganisation where its pharmacy distribution and digital health operations will be carved out into a separate entity.This new entity, Apollo Healthtech, will seek listing on stock exchanges over the next 18 to 21 months, with current Apollo Hospitals shareholders receiving proportionate shares in the new company. The deal will create a leading omni-channel pharmacy distribution and digital health platform in India with revenues of Rs 16,300 crore ($1.9 billion), Apollo Hospitals said in a statement.Currently, Apollo Healthco (AHL) manages the wholesale pharmaceutical trading and Apollo 24/7 digital platform, while Keimed oversees wholesale distribution of pharmaceuticals and wellness products. Apollo Hospitals holds about 79% ownership in AHL, and Keimed operates as a related party to Apollo Hospitals.The share allocation structure stipulates that for every 100 shares held in Apollo Hospitals, shareholders will receive 195.2 shares in the new company. AHL shareholders will get 89.5 shares for every 100 shares owned, while Keimed shareholders will receive 3045.2 shares for every 100 shares held. Following the completion of this demerger, both AHL and Keimed will cease to exist.Under the agreement terms, Apollo Hospitals shall restrict its pharmaceutical operations exclusively to hospital-based pharmacies, refraining from any involvement in e-commerce, retail or wholesale pharmacy ventures. Veda Corporate Advisors was the exclusive financial advisor to the transaction.The new company, Apollo Healthtech, will subsequently acquire 74.5% stake in Apollo Medicals, consolidating the front-end pharmacy business. Apollo Hospitals will own a 15% stake in Apollo Healthtech and will have one nominee director on the board, the Chennai-based company said.Apollo Hospitals chairman Prathap C Reddy, said: \"\"Today's developments mark the beginning of the next chapter of Apollo Hospitals. The omnichannel pharmacy business and integrated digital healthcare ecosystem will be a unique model to enable access to high-quality healthcare for millions of Indians.\"\"",
    "Date&Time": "2025-06-30T19:37:45Z",
    "By Whom": "Yogesh Kabirdoss",
    "Bussiness Impact": "Chennai: Apollo Hospitals Enterprise, controlled by the Prathap Reddy family, has announced a significant reorganisation where its pharmacy distribution and digital health operations will be carved out into a separate entity.This new entity, Apollo Healthtech, will seek listing on stock exchanges ov...",
    "URL reference": "https://timesofindia.indiatimes.com/city/chennai/apollo-hospitals-to-hive-off-pharmacy-digital-biz/articleshow/122168098.cms",
    "Image URL": "https://static.toiimg.com/thumb/msid-117517387,width-1070,height-580,imgsize-233070,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Yogesh Kabirdoss, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Breakout Stocks: How to trade MCX, Hyundai Motor and Fortis Healthcare that hit fresh 52-week high?",
    "Description Story": "Recently, this stock gave a breakout from a small bullish pattern above 8,000. Today, it has approached a crucial technical resistance at 8,680.\nIf it manages to sustain above this level, it can move 5–10% higher. Support now stands around 8,100. The RSI is in the super bullish zone.",
    "Date&Time": "2025-06-25T12:29:16Z",
    "By Whom": "ET Spotlight Special",
    "Bussiness Impact": "Recently, this stock gave a breakout from a small bullish pattern above 8,000. Today, it has approached a crucial technical resistance at 8,680.\nIf it manages to sustain above this level, it can move 5–10% higher. Support now stands around 8,100. The RSI is in the super bullish zone.",
    "URL reference": "https://m.economictimes.com/markets/stocks/news/breakout-stocks-how-to-trade-mcx-hyundai-motor-and-fortis-healthcare-that-hit-fresh-52-week-high/market-summary/slideshow/122071599.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122071599,width-1070,height-580,overlay-etmarkets/slideshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ET Spotlight Special, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Analysts betting on these four pharma, hospital stocks due to Indian healthcare sector’s strong growth prospects",
    "Description Story": "Pharma segment outlook\nHospital segment outlook\nSun Pharmaceuticals\nGained market share in the domestic formulations segment in Q4 FY25, with 14% year-on-year revenue growth driven by higher volumes and new product launches.\nMissed Reuters-Refinitiv estimates, with revenue falling short by 3.3% and net profit by 13.3%, primarily due to weaker sales in the US and Rest of the World (RoW) markets.\nDomestic growth outlook supported by upcoming launches in anti-diabetes and weight management therapies; US growth to come from existing product sales.\nPlans to invest $100 million in specialty portfolio (dermatology and oncology) for product launches, promotions, and field force expansion.\nMotilal Oswal remains bullish, citing Sun’s push for differentiated offerings in regulated markets to drive future earnings.\nReported in-line revenue growth in Q4 FY25, while net profit beat Reuters-Refinitiv estimates by 19.1%, aided by higher other income and lower finance costs.\nIndia business drove revenue growth and is expected to remain strong, supported by its innovative portfolio and therapies like respiratory and urology.\nRecent US approvals for cancer drugs (Abraxane, Nilotinib) and upcoming respiratory launches over the next 12–18 months are expected to stabilise US performance.\nManagement is focused on boosting manufacturing capacity, investing in R&D for differentiated products, and exploring inorganic growth opportunities.\nAccording to Antique Stock Broking, Cipla is entering a structural growth phase in the US generics market, driven by continued investment in complex generics, respiratory, and peptide segments.\nApollo Hospitals Enterprise\nAn integrated healthcare services provider, the company reported in-line revenue and a 5% net profit beat versus Reuters-Refinitiv estimates in Q4 FY25, supported by higher other income and a lower tax rate; the hospital segment delivered a mixed performance..\nARPOB rose 5% y-o-y driven by higher patient realisation; expected to improve further with better payer mix and rising surgical volumes.\nPlans to add 3,577 beds over 3-4 years; margin impact from new additions to be offset by cost optimisation.\nPharmacy business outlook supported by growing GMV, new store openings, and efficiency measures.\nDiagnostics segment expected to revive, led by growth in primary and secondary clinics.\nMotilal Oswal sees positives in bed additions, better productivity at existing facilities, reduced pharmacy losses, and a likely turnaround in diagnostics profitability.\nFortis Healthcare\nPosted in-line revenue and an 11.3% net profit beat in Q4 FY25, driven by higher ARPOB and better occupancy.\nHospital revenue grew 14% y-o-y; diagnostics rose 3%.\nManagement expects 14-15% hospital growth in 2025-26 and 24-25% diagnostics margins over 2–3 years.\nExpansion underway via greenfield projects and acquisitions (Manesar, Jalandhar).\nElara Capital raised 2026-27 earnings estimates on strong growth guidance.\nThe healthcare sector—including pharmaceuticals and hospitals— delivered a strong performance in the March 2025 quarter. The pharmaceutical segment benefited from increased demand in chronic therapies within the domestic formulations market, along with steady growth in the US generics business. Meanwhile, the hospitals segment was bolstered by expanded bed capacity and robust growth in average revenue per occupied bed (ARPOB).According to Reuters-Refinitiv data, 129 pharmaceutical companies—including those in biotechnology and life sciences— reported an aggregate revenue growth of 11.5% year-on-year (y-o-y) in the March 2025 quarter. Meanwhile, 26 healthcare providers, including diagnostic firms , recorded a 15.1% year-on-year revenue growth.The analysis includes only companies with a market capitalisation above `100 crore. In comparison, Nifty 500 companies posted a lower aggregate revenue growth of 6% y-o-y.The healthcare sector performed well in 2024 amid global economic uncertainty driven by geopolitical tensions, trade disruptions, and interest rate volatility. The Nifty Healthcare Index emerged as the second-best performer among the 16 sectoral indices on the National Stock Exchange (NSE) over the past year.However, the sector’s performance—particularly pharmaceuticals—has moderated in recent months due to concerns over the loss of exclusivity for generic Revlimid (gRevlimid), a cancer drug, which is expected to intensify competition and pressure prices and margins. Additionally, nearterm growth challenges in the domestic formulations segment have weighed on the sector outlook.Moreover, the recent announcement by US President Donald Trump regarding potential tariffs on pharmaceutical imports has dampened investor sentiment. Indian pharmaceutical companies, which earn a significant share of their revenue from US exports, are expected to feel the impact. As a result, the Nifty Pharma Index has become the fourth worst-performing sectoral index on the NSE in 2025 so far, based on data as of 23 June 2025.The long-term prospects of the pharmaceuticals sector remain intact. A recent Axis Securities report lists strong product pipeline in biosimilars, GLP-1 (class of drugs used to treat diabetes), and peptides (chain of amino acids used to treat diseases), stable margins, and higher contribution from chronic therapies as key growth catalysts for Indian pharmaceutical companies. Moreover, stability in price erosion, differentiated portfolio, and exposure to complex generics is expected to support the US generics segment.While concerns remain over the loss of exclusivity for gRevlimid, Indian pharmaceutical companies stand to gain from strong opportunities in the US generics market. The expiry of exclusivity is expected to accelerate generic launches, benefiting manufacturers— particularly Indian players.According to a recent report by Antique Stock Broking, a combination of greater loss-of-exclusivity opportunities, rationalised global competition, and improved regulatory compliance is expected to drive revenue growth for Indian pharmaceutical companies through new product launches and volume gains in existing businesses.Analysts also see potential in the CDMO (contract development and manufacturing organisation) space. A BNP Paribas report highlights investor feedback suggesting that India stands to benefit as global innovators diversify supply chains away from China. However, concerns persist over high valuations in the segment and limited near-term earnings visibility.In the hospital segment, factors such as the rise in lifestyle diseases, improving affordability and accessibility driven by higher disposable incomes, a significant demand-supply gap, growing medical tourism, a shift in payer mix due to increased insurance penetration, and bed capacity expansion by private players are expected to drive growth.Furthermore, low healthcare spending in India compared to the world average, rising median age, and a pickup in highgrowth therapies such as cardiac and cancer care—which boost ARPOB and occupancy— are the additional growth catalysts. An IBEF report estimates the Indian hospital market to grow by 8% CAGR between 2022-23 and 2031-32 to reach $193.6 billion. Here are the four stocks (two each from the pharmaceuticals and hospitals segments) with strong analyst coverage.Estimated TAM growth (%)",
    "Date&Time": "2025-06-30T01:00:00Z",
    "By Whom": "Sameer Bhardwaj",
    "Bussiness Impact": "Pharma segment outlook\nHospital segment outlook\nSun Pharmaceuticals\nGained market share in the domestic formulations segment in Q4 FY25, with 14% year-on-year revenue growth driven by higher volumes and new product launches.\nMissed Reuters-Refinitiv estimates, with revenue falling short by 3.3...",
    "URL reference": "https://economictimes.indiatimes.com/wealth/invest/analysts-betting-on-these-four-pharma-hospital-stocks-due-to-indian-healthcare-sectors-strong-growth-prospects/articleshow/122123712.cms",
    "Image URL": "https://img.etimg.com/thumb/width-1200,height-900,imgsize-111700,resizemode-75,msid-122123712/wealth/invest/analysts-betting-on-these-four-pharma-hospital-stocks-due-to-indian-healthcare-sectors-strong-growth-prospects.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Sameer Bhardwaj, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Hospital business, improving diagnostics segment to drive growth for Fortis Healthcare",
    "Description Story": "Agencies\nLive Events\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\nShares of Fortis Healthcare has risen 11% in three months, outperforming the 2.3% gain in the ET Pharma index. The company registered decent earnings in the March 2025 quarter. It plans to add around 900 beds next year. It expects revenue to grow by 14-15% for FY26 along with 150-200 basis point margin expansion, driven by better occupancy. Analysts have maintained an ‘Outperform’ rating on the stock.The company had 4,750 operational beds, including operations and management (O&M) contracts, as of March 2025. It aims for 20% additional capacity, which is 900-1,000 beds by FY26 and another 1,000 by FY27.In February 2025, Fortis Healthcare’s wholly owned subsidiary, Fortis Hospotel , acquired Shrimann Superspecialty Hospital in Jalandhar, which had 220 beds. The company has received an occupancy certificate (OC) for 150 beds in Noida, which will be operational soon. A 200-bed facility will be opened in Manesar, a 220-bed expansion in Fortis Memorial Research Institute and another 140-bed facility in BG Road, for which OC is expected.In the March 2025 quarter, revenue grew 12.4% year-on-year to Rs2,007.2 crore, driven by strong momentum in the hospital business, which constituted 85% of the revenue. The hospital segment recorded 14% YoY revenue growth, supported by a 5.5% increase in occupancy rates and an 8.4% rise in the average revenue per occupied bed (ARPOB) while the performance of the diagnostics division remained subdued amid a rebranding exercise.Consolidated EBITDA margin improved by 40 basis points year-on-year to 21.7%. However, the net profit fell by 26.1% to Rs 188 crore due to a one-off impairment charge of Rs 53.6 crore.The diagnostics segment, which was rebranded to Agilus from SRL two years ago, remains a work in progress with just 3% year-on-year increase in revenue in the March quarter. Fortis expects a stronger performance from FY26, given that the exercise of brand transitioning and costs related to it are now behind. It expects double-digit revenue growth for the division with a 23-25% margin in a couple of years. BNP Paribas has maintained ‘Outperform’ on Fortis, raising the hospital segment’s EBITDA estimate by 3% for FY26-28. JM Financial expects Fortis to show the strongest ARPOB growth , driven by brownfield expansions and increased metro presence. “With the on-going efforts to improve the profitability of underperforming units, combined with significant brownfield expansion, the company is poised to achieve over 15% topline growth over the next three years, along with 200-300 bps margin (improvement)”, JM Financial said in a report.",
    "Date&Time": "2025-06-30T14:44:31Z",
    "By Whom": "Snehal Mergu",
    "Bussiness Impact": "Agencies\nLive Events\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\nShares of Fortis Healthcare has risen 11% in three months, outperforming the 2.3% gain in the ET Pharma index. The company registered decent earnings in the March 2025 quarter. It plan...",
    "URL reference": "https://economictimes.indiatimes.com/markets/stocks/news/hospital-business-improving-diagnostics-segment-to-drive-growth-for-fortis-healthcare/articleshow/122163511.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122163502,width-1200,height-630,imgsize-14444,overlay-etmarkets/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Snehal Mergu, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Mayuresh Joshi on 3 sectors where earnings & valuation support can take stock prices higher",
    "Description Story": "Live Events\nYou Might Also Like: How should you place your bets as Nifty makes a U-turn from 25,000? Vinay Rajani answers\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\n, Head Equity,says healthcare, particularly hospitals adopting asset-light models, shows earning stability with improved occupancy and revenue per bed. Select NBFCs with strong financials are poised for growth amid falling interest rates. Consumption-driven stocks like Vishal Mega Mart and V-Mart Retail could benefit from rebounding rural spending, exhibiting potential for volume and price gains.The markets are reacting in terms of the geopolitics, specifically what’s happening in West Asia. But there is some hope that if any news comes through in terms of de-escalation over the next few days, something which probably is assuming that the worst in terms of the conflict might be behind us, we will definitely come out of the range-bound trade that we are in.Obviously, within largecaps, the construct still remains positive in terms of select leadership BFSI stocks because the space generally looks geared up in terms of better earnings growth. Obviously, OMCs in the oil and gas space, become more of a tactical trade as we speak. But generally for largecaps, the mood has been pretty sanguine so far. It is the midcaps where the entire action might be over the next few quarters as earnings start coming back. So, midcaps and select leadership stocks might fare well where earnings are expected to hold up at least in a domestic context for the next few quarters.Healthcare as a space is where we believe stocks can do well selectively. Within healthcare, hospitals as a space has delivered a very decent set of numbers as far as Q4 is concerned and our take is that the asset light model that a lot of hospital stocks are embarking upon over the last few quarters has started yielding results both in terms of the average revenue per operating bed as occupancy rates are inching higher.We are probably seeing the average length of stay coming down as hospitals mature. And therefore, hospitals within healthcare as a space is where the earning stability might continue and a lot of hospitals are showing that earning strength specifically in their price strength as well as we see it in Marketsmith India. So, the ratings, rankings, institutional holding – all the elements that we follow, are getting exhibited in this space.Certain hospital stocks like Kims, Fortis Healthcare Narayana Hrudayalaya are where earning stability might continue over the next few quarters. The other space is obviously within BFSI where we have seen some strength in NBFC stocks. Our view is that select NBFC stocks might continue doing well. Therefore, in a falling interest rate scenario with the RBI frontloading 50 bps of rate cuts, the expectations is that in terms of stronger franchises with a better diversified borrowing mix, a better advanced mix, better capital adequacy and therefore a better take in terms of the overall balance sheet growth leading to better RoEs and ROAs, they can continue doing well. So, stocks like Shriram Finance are something we continue holding in our domestic and global portfolios.Last but not the least, a few of the consumption-driven stocks. With better monsoons, rural, semi-urban consumption which has started coming back should come back even more strongly in the second half and therefore for a few apparel makers Vishal Mega Mart, which just concluded a big block deal, V-Mart Retail, the same-store sales growth (SSG) has been pretty decent for these companies. It is a good mix for apparel, FMCG, and non-FMCG, the price points are appropriately placed and in tier II, tier III cities where the expectation is that if growth rebounds very strongly in terms of discretionary spending, these guys might benefit quite significantly on all parameters that we probably put through and therefore rating and rankings look superb.So, Vishal Mega Mart, V-Mart might be a couple of ideas on the semi-urban/rural discretionary spend which can exhibit better volume and price moves as far as balance sheets are concerned.",
    "Date&Time": "2025-06-20T04:39:38Z",
    "By Whom": "ET Now",
    "Bussiness Impact": "Live Events\nYou Might Also Like: How should you place your bets as Nifty makes a U-turn from 25,000? Vinay Rajani answers\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\n, Head Equity,says healthcare, particularly hospitals adopting asset-light models, ...",
    "URL reference": "https://economictimes.indiatimes.com/markets/expert-view/mayuresh-joshi-on-3-sectors-where-earnings-valuation-support-can-take-stock-prices-higher/articleshow/121966498.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-121966554,width-1200,height-630,imgsize-18298,overlay-etmarkets/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ET Now, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Manipal, Fortis in talks to raise Rs 5,000 cr for Sahyadri Hospitals bid",
    "Description Story": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nWith the bidding deadline for Sahyadri Hospitals approaching on June 22, interested bidders including Manipal Health Enterprises and Fortis Healthcare are engaging with foreign lenders to raise financing of up to Rs 5,000 crore, people familiar with the matter said. The funds will be used to back their respective bids for the multispecialty hospital chain.The two hospital operators are in discussions with banks including DBS Group Holdings , Deutsche Bank AG, Mizuho Bank, HSBC Holdings and Barclays, the people said, asking not to be named. Aster DM Healthcare , another potential bidder, is yet to firm up financing discussions, the people said.\"\"Fortis and Manipal are in talks with global banks to raise anywhere between Rs 3,000 crore and Rs 5,000 crore to fund the acquisition of Sahyadri Hospitals,\"\" one of the people quoted above said.Spokespersons of Manipal, Fortis, DBS, HSBC, Barclays, DB and Mizuho did not immediately respond to requests for comment.Ontario Teachers' Pension Plan (OTPP), which owns a 98.9% stake in Sahyadri Hospitals, is selling the asset less than three years after acquiring control. Sahyadri was Ontario Teachers' first control private equity buyout in India. The Canadian pension fund, which has more than $3 billion invested in India, hired Jefferies earlier this year to run the sale process.ET had reported on December 6, 2024 that OTPP will launch a process to sell Sahyadri Hospitals. OTPP had acquired the company from Everstone Capital at a Rs 2,500 crore valuation, which had earlier bought the chain from founder Dr Charudutt Apte in 2019 for Rs 1,000 crore. OTPP is a global investor with net assets of $266.3 billion as on December 31, 2024.Sahyadri operates 11 hospitals with 1,300 operational beds across Pune, Nashik and Karad in Maharashtra. Its facilities cover specialties, including cardiology, transplants, neurology and critical care. It has over 2,500 clinicians and 3,500 supporting staff. The company is empanelled under several government health schemes, including Ayushman Bharat and CGHS. It was founded in 1996 by Dr Apte, a neurosurgeon.The bidding for Sahyadri comes amid consolidation in India's hospital sector. Late last year, Blackstone and TPG-backed Quality Care India announced a merger with listed Aster DM to form India's third-largest hospital chain with over 10,000 beds.\"\"Post the Covid pandemic, the Indian hospital segment has been in investors' limelight due to a surge in primary market transactions with six hospitals concluding their IPOs, rising interest from new investors, predominantly private equity, for ownership, record FDI inflow into hospitals in FY24 at $1.53 billion, which is 50% of the overall investment in healthcare vs the 27% cumulative share since FY12 and aggressive bed expansion plans of listed hospitals,\"\" Tausif Shaikh, India analyst-pharma and healthcare at BNP Paribas India, said in a report released last year.",
    "Date&Time": "2025-06-15T19:04:31Z",
    "By Whom": "Shilpy Sinha",
    "Bussiness Impact": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nWith the bidding deadline for Sahyadri Hospitals approaching on June 22, interested bidders including Manipal Health Enterprises and Fortis Healthcare are engaging with foreign lenders to r...",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/manipal-fortis-in-talks-to-raise-rs-5000-cr-for-sahyadri-hospitals-bid/articleshow/121868272.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-121868280,width-1200,height-630,imgsize-121490,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Shilpy Sinha, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Aster DM Healthcare sets sights on smaller cities to expand play, grab top spot",
    "Description Story": "It seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
    "Date&Time": "2025-07-07T18:58:28Z",
    "By Whom": "Rica Bhattacharyya and Vikas Dandekar",
    "Bussiness Impact": "It seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/aster-dm-healthcare-sets-sights-on-smaller-cities-to-expand-play-grab-top-spot/articleshow/122305163.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122305225,width-1200,height-630,imgsize-39578,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Rica Bhattacharyya and Vikas Dandekar, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Breakout Stocks: How to trade Glenmark Pharma, Fortis Healthcare & LT Finance that hit 52 week high on Monday?",
    "Description Story": "The stock is currently facing resistance from an important trendline and the 206–210 price zone, forming a channel pattern on the daily timeframe. If the stock breaks this zone and trendline and closes above 212, it could see a good upside move; otherwise, it may test its support trendline.\nSince the stock is yet to give a breakout, the potential targets are ₹238 and ₹255 as T1 and T2 in the coming days.\nA strong support level and stop loss should be placed at ₹199, but only if the stock manages to close above the Rs 212 level.\nThe stock has delivered a good performance, with a return of 11.60% over the past 1 year and 49% in the last 6 months.\nIt is currently experiencing good buying pressure and has crossed its 50-day moving average on the volume bar in the daily timeframe.",
    "Date&Time": "2025-07-07T11:51:04Z",
    "By Whom": "ETMarkets.com",
    "Bussiness Impact": "The stock is currently facing resistance from an important trendline and the 206–210 price zone, forming a channel pattern on the daily timeframe. If the stock breaks this zone and trendline and closes above 212, it could see a good upside move; otherwise, it may test its support trendline.\nSince...",
    "URL reference": "https://m.economictimes.com/markets/stocks/news/breakout-stocks-howtotrade-glenmark-pharmafortis-healthcareamplt-financethathit-52-week-highonmonday/market-summary/slideshow/122298851.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122298851,width-1070,height-580,overlay-etmarkets/slideshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ETMarkets.com, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Hospital Services Market Size to Lead USD 24,173 Bn by 2034 Rising Chronic Illness and Aging Population Fuel the Market Demand",
    "Description Story": "Ottawa, July 08, 2025 (GLOBE NEWSWIRE) -- According to Statifacts, the global hospital services market size reached USD 13,303 billion in 2024 and is estimated to attain USD 24,173 billion by 2034, growing at a CAGR of 6.15% during the forecast period from 2025 to 2034. Rising digital transformation, advanced technologies, the increasing demand for data-driven decision-making, and the need for continuous market tracking are driving the growth of the hospital services market.\nThis Report is Readily Available for Immediate Delivery, Visit Here to Explore the Report Sample and In-depth Databook Now@ https://www.statifacts.com/stats/databook-download/8200\nHospital Services Market Overview\nThe hospital services market refers to the arrangement and distribution, of a list of hospital services are collective activities of all departments and all personnel of a hospital, which end up in satisfactory patient care. Hospital services include everything from basic healthcare to emergency services in hospital, training and research for a major medical school center, and also services created by a network of industry-owned institutions like health maintenance organizations. In a hospital, types of services include home care, mental health services, rehabilitation, surgery, treatment, medical diagnosis, preventive care, and other services are among them.\nThe hospital services market growth is driven by increasing global spending on research and development, increased mergers and acquisitions activity, and technological advancements in the healthcare sector. The benefits of hospital services include reduced medical complications, reduced hospitalizations, quality of care, improved productivity, improved communication & collaboration, mental health assistance, happier patients, financial security, cost savings, extreme data security, expedited access to care, and improved patient care.\nHospital Services Market Highlights\nNorth America dominated the hospital services market in 2024.\nEurope is expected to show the fastest growth in the forecasted period of 2025-2034.\nBy hospital, the public/ community hospital segment contributed the highest market share of 36% in 2024.\nBy hospital, the private hospital segment is expected to grow at the fastest rate in the market during the forecast period of 2025 to 2034.\nBy service type, the inpatient services segment captured the biggest market share of 58% in 2024.\nBy service type, the outpatient services segment is projected to experience the highest growth rate in the market between 2025 and 2034\nBy service areas, the cardiovascular segment generated the major market share of 21% in 2024.\nBy service areas, the neurorehabilitation & psychiatry services segment is set to experience the fastest market growth from 2025 to 2034.\nMajor Trends in the Hospital Services Market\nWhich Principal Factors Shape the Hospital Service Industry?\nRising global spending on research and development: Rising global spending on research and development can lead to breakthroughs that can drive profits and well-being for consumers. Research and development can lead to innovations in business. These may be in terms of new products and services, enhanced processes, and new ways to interact with customers. Advancements are also a useful way to grow a business. research and development is an essential driver of economic growth as it spurs progress, innovation, and invention. R&D spending can lead to innovations can drive profits and well-being for consumers.\nRising global spending on research and development can lead to breakthroughs that can drive profits and well-being for consumers. Research and development can lead to innovations in business. These may be in terms of new products and services, enhanced processes, and new ways to interact with customers. Advancements are also a useful way to grow a business. research and development is an essential driver of economic growth as it spurs progress, innovation, and invention. R&D spending can lead to innovations can drive profits and well-being for consumers. Technological advancements in the healthcare sector: The benefits of technological advancements in the healthcare sector include robotics for surgical procedures, robotics, lower healthcare costs, Internet of Medical Things (IoMT), improved public health, improved efficiency, improved communication, hospital communication systems, empowered patients, ease of workflow, better diagnostics, remote monitoring devices, greater patient care, improved patient care, AI in healthcare, wearables, healthcare access, electronic medical records, HER integrations, and telemedicine.\nGrowth Factors in the Hospital Services Market\nDigital transformation of traditional industries: The digital transformation of traditional industries shows many positive results, like increased productivity, fewer errors, time and resource saving, and more, transforming traditional industries into new high-end technologies driven technologies. Key components of digital transformation for healthcare services include blockchain, artificial intelligence (AI), software development, custom mobile app development, big data, internet of things (IoT), and cloud computing . Digital transformation like the integration of automation, AI, and IoT have significantly improved their efficiency and operational development.\nThe digital transformation of traditional industries shows many positive results, like increased productivity, fewer errors, time and resource saving, and more, transforming traditional industries into new high-end technologies driven technologies. Key components of digital transformation for healthcare services include blockchain, (AI), software development, custom mobile app development, big data, (IoT), and . Digital transformation like the integration of automation, AI, and IoT have significantly improved their efficiency and operational development. Regulatory support: Regulatory support benefits include driving business growth, improving reputation & trust, preventing security breaches, enhancing internal processes & procedures, and avoiding fines & penalties. Regulatory affairs help pharma companies and hospital services to understand and meet different rules across countries, ensuring smooth global market entry. It makes sure all medicines are safe, effective, and meet strict health authority guidelines before and after launch.\nReady to Dive Deeper? Visit Here to Buy Databook & In-depth Report Now@ https://www.statifacts.com/order-databook/8200\nRole of Artificial Intelligence (AI) in the Hospital Services Market\nArtificial intelligence (AI) in healthcare services may be used to increase efficiency in healthcare diagnoses. According to Harvard’s School of Public Health, although it’s early days for this use, using AI to make diagnoses may reduce treatment costs by up to 50% and improve health outcomes by 40%. In clinical settings, AI assists in diagnosing diseases, predicting patient outcomes, and personalizing treatment plans. In hospital management, AI improves operational efficiency, enhance patient flow & scheduling, and streamlines administrative tasks.\nThe integration of artificial intelligence into healthcare promises heightened diagnostic accuracy, improved treatment planning, and informed decision making. Artificial intelligence tools can enhance accuracy, reduce costs, and save time compared to traditional diagnostic methods. AI-based chatbots can provide answers to common patient concerns. The use of this new technology is bringing about a massive transformation of the healthcare sector by improving medical research, care delivery, and efficiency, leading to enhanced patient outcomes and personalized treatments.\nWhat Are the Significant Achievements of the Leading Industrial Firms?\nIn June 2025, a landmark $50 million philanthropic gift from Gilchrist and Amy Berg of Ponte Vedra, Florida was announced by Mayo Clinic. This transformative contribution will accelerate global healthcare innovation through Mayo Clinic’s Innovative Exchange, which will be renamed the Mayo Clinic Berg Innovation Exchange in their honor.\nSource: News Network. Mayo Clinic\nIn June 2025, the HCA Healthcare Foundation, through its Healthier Tomorrow Fund, will enhance its Healthier Tomorrow Fund, will enhance its work with Educate Texas, an initiative of Communities Foundation of Texas, through a new $1 million grant was announced by HCA Healthcare, Inc., one of the nation’s leading healthcare providers. This donation builds upon the collaboration resulting from the Foundation’s $1.35 million grant to the organization in 2022 and will continue to focus on increasing student access to program that allow healthcare careers, including high schools in Texas that offers pathways in Technology Early College High School (P-TECH) healthcare career tracks.\nSource: HCA Healthcare\nHow Does IoMT Act as an Opportunity for the Hospital Services Market?\nInternet of Medical Things (IoMT) in healthcare services allows real time altering, tracking, and monitoring, which permits better accuracy, hands-on treatments, apt intervention by doctors and enhances complete patient care delivery results. IoT in healthcare services benefits include integration of multiple devices & protocols, data security & privacy, research, remote medical assistance, tracking and alerts, data assortment & analysis, end-to-end connectivity & affordability, and simultaneous reporting and monitoring.\nThe main role of IoT I healthcare is to ease the patient’s life by giving them a monitor over their medical condition. The use of IoT in medical devices needs a focus on the end-user. Medical devices like glucose meters are designed to record the data of the patient and their vital signs. Higher demand for home care services is conducive to the use of Internet of Medical Things devices so healthcare providers can keep up with a patient’s condition in real-time.\nWhat Are the Potential Concerns Related to the Hospital Services Market?\nSupply chain disruptions: Manufacturers may responsible for disruptions at the supply chain level, delays, and unmet delivery problems can trigger customer’s frustration and dissatisfaction. And also affecting current sales, supply chain issues can damage both customer relationship and brand loyalty. Supply chain challenges in hospital services include logistic & transportation challenges, data visibility & integration across systems, supply reliability & relationship management, demand forecasting & inventory management, cost containment & budget constraints, regulatory compliance & changing standards, and uncertainty.\nManufacturers may responsible for disruptions at the supply chain level, delays, and unmet delivery problems can trigger customer’s frustration and dissatisfaction. And also affecting current sales, supply chain issues can damage both customer relationship and brand loyalty. Supply chain challenges in hospital services include logistic & transportation challenges, data visibility & integration across systems, supply reliability & relationship management, demand forecasting & inventory management, cost containment & budget constraints, regulatory compliance & changing standards, and uncertainty. High initial investment costs: Compounding concerns of growing healthcare administration costs is the evidence that administrative complexity has an adverse impact on quality of care. The disadvantages of high initial investment include higher upfront costs, potential for reduced flexibility, and increased risk if the investment does not pay off. In addition, some businesses may struggle to secure funding for such large investments, which can limit their growth potential. High initial investment provides the potential for higher returns but come with a greater profitability of losses or more severe potential losses.\nWhat Is Going on Around the Globe in the Hospital Services Market?\nNorth America dominated the global hospital services market in 2025. Rising global spending on research and development, increased mergers & acquisitions activity, and technological advancements in the healthcare sector are driving the growth of the market in the North American region.\nU.S. Hospital Services Market Size 2024 to 2034 (USD Billion)\nThe U.S. hospital services market size is calculated at USD 2,480 billion in 2024 and is predicted to reach around USD 4,021 billion by 2034, expanding at a CAGR of 4.95% from 2025 to 2034.\nHow Do Hospital Services Act as a Key to the Healthcare Sector in the United States?\nThe US is the only developed country without a system of universal healthcare, and a significant proportion of its population lacks health insurance. The U.S. healthcare system is unique among advanced industrialized countries. The U.S. does not have a uniform health system, has no universal health coverage, and only recently enacted legislation mandating healthcare coverage for almost everyone. The United States has one of the highest costs of healthcare in the world. In 2022, U.S. healthcare spending reached $4.5 trillion, which averages to $13,493 per person. By comparison, the average cost of healthcare person in other wealthy countries is less than half as much.\nSource: Wikipedia, DPE Aflcio, and Peter G. Peterson Foundation\nWhat To Expect From Asia Pacific’s Hospital Services Market?\nAsia Pacific is projected to host the fastest-growing market during the forecast period. Expanding infrastructure, strong government policies and fundings, growing demand for eco-friendly & efficient solutions, and increased adoption of advanced technologies contributing to the growth of the hospital services market in the Asia Pacific region.\nHow Do Hospital Services Act as a Key to the Hospital Services Market in India?\nThe public hospital system is essentially free for all Indian residents except for small, often symbolic co-payments for some services. One of the significant benefits of the Indian Government’s healthcare sector is the increased accessibility to healthcare services. The government has established primary health centers in remote and rural areas, ensuring that even the underprivileged sections of society have access to basic healthcare facilities. The primary benefit of government hospitals is their affordability.\nSource: Wikipedia and Swaasa\nHospital Services Market Scope\nReport Attribute Key Statistics Market Size in 2025 USD 14,323 Billion Market Size in 2024 USD 13,303 Billion Market Size by 2034 USD 24,173 Billion Growth Rate from 2025 to 2034 CAGR of 6.15% Largest Market North America Base Year 2024 Forecast Period 2025 to 2034 Segments Covered By Hospital Type, By Service Type, By Service Areas, and By Region Regions Covered North America, Europe, Asia-Pacific, Latin America, and Middle East & Africa\nHospital Services Market Segmentation\nHospital Type Insights\nHospital Services Market Size by Hospital Type 2024 to 2034 (USD Billion)\nSegments 2024 2025 2034 State-owned Hospitals 4,561.6 4,905.3 8,184.0 Private Hospitals 3,873.3 4,194.0 7,435.7 Public/Community Hospitals 4,868.0 5,224.0 8,552.8\nWhat Made Public/Community Hospitals the Dominant Segment in the Hospital Services Market?\nPublic/community hospitals segment held a dominant presence in the hospital services market in 2024. In hospital services, functions of community health centers include making provisions for safe drinking water and basic sanitation, prevention and control of endemic diseases, collection of vital statistics of the area, health and nutrition, education and training of many health personnel working under the community health centers. One of the primary benefits of partnerships between hospitals and public health systems is the potential for more efficient resource use. Public hospital systems make healthcare more accessible and affordable for a broader population. Public hospitals may offer a wide range of medical services at a high standard, and many are equipped with specialized departments and advanced medical technology.\nSource: Dmeo Gov. and Obermair\nPrivate hospitals segment is expected to grow at the fastest rate in the market during the forecast period of 2025 to 2034. Private hospital benefits include we may get extra services like private room, we may able to choose when to book elective surgery, waiting times for elective surgery are generally shorter, and we can choose our doctor. Private hospitals complement the public system by providing advanced medical care and specialized services. They can cater to those who can afford higher costs and prefer quicker, more personalized care.\nSource: Karetrip and Health Direct\nService Type Insights\nHospital Services Market Size by Service Type 2024 to 2034 (USD Billion)\nSegments 2024 2025 2034 Outpatient Services 5,575.3 6,055.5 11,016.5 Inpatient Services 7,727.5 8,267.8 13,156.0\nHow the Inpatient Service Segment Dominated the Hospital Services Market?\nInpatient services segment accounted for a considerable share of the hospital services market in 2024. The inpatient care benefits include the availability of emergency services in case a patient codes, or loses spontaneous circulation and heartbeat. Inpatient care benefits cover any kind of diagnostic or therapeutic procedure, and also hospital charges for individuals who may need confinement in a hospital.\nOutpatient services segment is projected to experience the highest growth rate in the market between 2025 and 2034. Outpatient services benefits include ensures patient satisfaction, results in better healthcare efficiency, convenient, allows better treatment outcomes, results in swift treatment, allow wider access to healthcare facilities, pocket friendly, and saves time. Outpatient services means our health insurance offers coverage for the costs of doctor consultations, minor treatments, diagnostic costs, and even prescribed medicines when we are not required to admit to the hospital.\nService Areas Insights\nHospital Services Market Size by Service Areas 2024 to 2034 (USD Billion)\nSegments 2024 2025 2034 Cardiovascular 2,857.5 3,055.6 4,837.7 Acute Care 567.1 611.4 1,044.0 Cancer Care 1,922.3 2,075.0 3,581.6 Diagnostics and Imaging 2,112.9 2,277.7 3,885.1 Neurorehabilitation & Psychiatry Services 1,656.2 1,790.9 3,138.4 Gynecology 727.7 781.6 1,290.0 Others 3,459.2 3,731.1 6,395.8\nHow Cardiovascular Services Segment Dominated the Hospital Services Market?\nCardio-vascular services segment led the hospital services market. Regular cardio-vascular health checkup benefits include prevention is better than cure, convenient location & expert care, tailored heart health packages, non-invasive and painless testing, women-specific health checks, stress testing for accurate diagnosis, affordable heart health management, personalized lifestyle & dietary advice, comprehensive testing for better insights, and early detection of heart disease.\nAcute care services segment is set to experience the fastest rate of market growth from 2025 to 2034. Acute care is essential for addressing urgent healthcare needs, and providing immediate medical care for severe health problems that needs immediate attention. It plays a critical role in managing acute health problems effectively, preventing further deterioration, and saving lives.\nBrowse More Research Reports:\nThe North America hospital services market size surpassed USD 5,012 billion in 2024 and is predicted to reach around USD 8,757 billion by 2034, registering a CAGR of 5.74% from 2025 to 2034.\nsurpassed USD 5,012 billion in 2024 and is predicted to reach around USD 8,757 billion by 2034, registering a CAGR of 5.74% from 2025 to 2034. The Asia-Pacific hospital services market size was estimated at USD 3,871.13 billion in 2024 and is projected to be worth around USD 7,525.71 billion by 2034, growing at a CAGR of 6.87% from 2025 to 2034.\nwas estimated at USD 3,871.13 billion in 2024 and is projected to be worth around USD 7,525.71 billion by 2034, growing at a CAGR of 6.87% from 2025 to 2034. The Europe hospital services market size was evaluated at USD 2,895 billion in 2024 and is expected to grow around USD 4,857 billion by 2034, registering a CAGR of 5.31% from 2025 to 2034.\nwas evaluated at USD 2,895 billion in 2024 and is expected to grow around USD 4,857 billion by 2034, registering a CAGR of 5.31% from 2025 to 2034. The China hospital services market size was calculated at USD 1,123 billion in 2024 and is predicted to attain around USD 2,288 billion by 2034, expanding at a CAGR of 7.37% from 2025 to 2034.\nwas calculated at USD 1,123 billion in 2024 and is predicted to attain around USD 2,288 billion by 2034, expanding at a CAGR of 7.37% from 2025 to 2034. The Germany hospital services market size surpassed USD 858 billion in 2024 and is predicted to reach around USD 1,331 billion by 2034, registering a CAGR of 4.48% from 2025 to 2034.\nReady to Dive Deeper? Visit Here to Buy Databook & In-depth Report Now@ https://www.statifacts.com/order-databook/8200\nCompetitive Landscape in the Hospital Services Market\nMayo Clinic: This is a private American academic medical center focused on integrated healthcare, education, and research.\nThis is a private American academic medical center focused on integrated healthcare, education, and research. HCA Healthcare: This is an American for-profit operator of healthcare facilities.\nThis is an American for-profit operator of healthcare facilities. Cleveland clinic: This is a non-profit, multi-specialty academic medical center that integrates clinical and hospital care.\nThis is a non-profit, multi-specialty academic medical center that integrates clinical and hospital care. Spire Healthcare Group plc: This is a leading provider of private healthcare, running 38 private hospitals and over 50 clinics, consulting rooms and medical centers in UK.\nThis is a leading provider of private healthcare, running 38 private hospitals and over 50 clinics, consulting rooms and medical centers in UK. Ramsay Health Care: Ramsay Health Care Limited is an Australian multinational healthcare provider and hospital network.\nRamsay Health Care Limited is an Australian multinational healthcare provider and hospital network. Ascension Health: Ascension Health is a large private Catholic healthcare system in the United States.\nAscension Health is a large private Catholic healthcare system in the United States. Community Health Systems, Inc.: One of the nation’s leading healthcare providers. Developing and operating healthcare delivery systems across 14 states.\nOne of the nation’s leading healthcare providers. Developing and operating healthcare delivery systems across 14 states. Tenet Healthcare: Tenet Healthcare Corporation is an American for-profit multinational healthcare services company based in Dallas, Texas.\nTenet Healthcare Corporation is an American for-profit multinational healthcare services company based in Dallas, Texas. Fortis Healthcare: Fortis is India’s leading healthcare service provider with 28 hospitals, 2.5K+ doctors, and 4K+ operational beds touching 2 million+ lives annually.\nWhat is Going Around the Globe?\nIn July 2025, the new era government’s 10 Year Health Plan to bring the Neighborhood Health Services (NHS) closer to home was launched by Prime Minister. Neighborhood Health Services (NHS) to be rolled out across the country, bringing diagnostics, mental health, post-op, rehab, and nursing to people’s doorstep.\nSource: Gov.UK\nIn June 2025, “Sneha Sparsha” an innovative homecare initiative dedicated to supporting cancer patients at their doorstep was launched by SH Binayak Multi-Specialty Hospital, in association with the Institute of Breast Disease, Kolkata and the Asian Medical Foundation.\nSource: The Times of India\nSegments Covered in the Report\nBy Hospital Type\nState-owned Hospital\nPrivate Hospital\nPublic/ Community Hospital\nBy Service Type\nOutpatient Services\nInpatient Service\nBy Service Areas\nCardiovascular\nAcute Care\nCancer Care\nDiagnostics, and Imaging\nNeurorehabilitation & Psychiatry Services\nGynecology\nOthers\nBy Geography\nNorth America U.S. Canada\nEurope Germany France United Kingdom Rest of Europe\nAsia Pacific China Japan India Southeast Asia Rest of Asia Pacific\nLatin America Brazil Rest of Latin America\nMiddle East & Africa (MEA) GCC North Africa South Africa Rest of Middle East & Africa\nYou can place an order or ask any questions, please feel free to contact us at sales@statifacts.com\nStatifacts offers subscription services for data and analytics insights. This page provides options to explore and purchase a subscription tailored to your needs, granting access to valuable statistical resources and tools. Access here - https://www.statifacts.com/get-a-subscription\nContact US\nBallindamm 22, 20095 Hamburg, Germany\nWeb: https://www.statifacts.com/\nEurope: +44 7383 092 044\nAbout US\nStatifacts is a leading provider of comprehensive market research and analytics services, offering over 1,000,000 market and custoer data sets across various industries. Their platform enables businesses to make informed strategic decisions by providing full access to statistics, downloadable in formats such as XLS, PDF, and PNG.\nOur Trusted Data Partners:\nPrecedence Research | Towards Healthcare | Towards Packaging | Towards Automotive | Towards Food and Beverages | Towards Chemical and Materials | Towards Dental | Towards EV Solutions | Nova One Advisor",
    "Date&Time": "2025-07-08T14:50:00Z",
    "By Whom": "Precedence Research",
    "Bussiness Impact": "Ottawa, July 08, 2025 (GLOBE NEWSWIRE) -- According to Statifacts, the global hospital services market size reached USD 13,303 billion in 2024 and is estimated to attain USD 24,173 billion by 2034, growing at a CAGR of 6.15% during the forecast period from 2025 to 2034. Rising digital transformation...",
    "URL reference": "https://www.globenewswire.com/news-release/2025/07/08/3111962/0/en/Hospital-Services-Market-Size-to-Lead-USD-24-173-Bn-by-2034-Rising-Chronic-Illness-and-Aging-Population-Fuel-the-Market-Demand.html",
    "Image URL": "https://ml.globenewswire.com/Resource/Download/01eb1f79-0c67-420b-b423-376619f975cd",
    "Type Of News": "Competitor News",
    "Tags": "Precedence Research, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Wall Street Zen Upgrades Danaher (NYSE:DHR) to Buy",
    "Description Story": "Danaher (NYSE:DHR – Get Free Report) was upgraded by analysts at Wall Street Zen from a “hold” rating to a “buy” rating in a research note issued on Friday.\nSeveral other brokerages have also issued reports on DHR. Royal Bank Of Canada reiterated an “outperform” rating and issued a $250.00 target price on shares of Danaher in a research report on Wednesday, April 23rd. Bank of America dropped their target price on shares of Danaher from $265.00 to $230.00 in a research report on Monday, April 14th. Barclays reiterated an “overweight” rating and issued a $225.00 target price (up previously from $215.00) on shares of Danaher in a research report on Tuesday, June 24th. Deutsche Bank Aktiengesellschaft lowered their price target on shares of Danaher from $240.00 to $235.00 in a research report on Thursday, June 5th. Finally, HSBC lowered their price target on shares of Danaher from $270.00 to $240.00 in a research report on Friday, April 25th. Four investment analysts have rated the stock with a hold rating and seventeen have given a buy rating to the company’s stock. According to data from MarketBeat.com, the company currently has an average rating of “Moderate Buy” and a consensus price target of $248.61.\nGet Danaher alerts:\nCheck Out Our Latest Report on Danaher\nDanaher Stock Down 1.6%\nDHR opened at $198.20 on Friday. Danaher has a fifty-two week low of $171.00 and a fifty-two week high of $281.70. The company has a debt-to-equity ratio of 0.31, a quick ratio of 1.05 and a current ratio of 1.43. The company has a fifty day moving average of $194.84 and a two-hundred day moving average of $208.33. The stock has a market capitalization of $141.84 billion, a price-to-earnings ratio of 38.48, a PEG ratio of 2.79 and a beta of 0.77.\nDanaher (NYSE:DHR – Get Free Report) last released its quarterly earnings data on Tuesday, April 22nd. The conglomerate reported $1.88 earnings per share for the quarter, beating analysts’ consensus estimates of $1.62 by $0.26. Danaher had a net margin of 15.81% and a return on equity of 10.80%. The company had revenue of $5.74 billion during the quarter, compared to analysts’ expectations of $5.58 billion. On average, research analysts expect that Danaher will post 7.63 earnings per share for the current year.\nInsider Activity\nIn other news, Chairman Steven M. Rales sold 1,250,000 shares of the business’s stock in a transaction that occurred on Monday, May 12th. The shares were sold at an average price of $196.74, for a total value of $245,925,000.00. Following the sale, the chairman now directly owns 3,105,808 shares of the company’s stock, valued at approximately $611,036,665.92. The trade was a 28.70% decrease in their position. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available at this hyperlink. Also, EVP Christopher Paul Riley sold 15,805 shares of the business’s stock in a transaction that occurred on Wednesday, April 30th. The shares were sold at an average price of $198.00, for a total transaction of $3,129,390.00. Following the completion of the sale, the executive vice president now directly owns 15,179 shares in the company, valued at $3,005,442. This trade represents a 51.01% decrease in their ownership of the stock. The disclosure for this sale can be found here. Insiders own 11.10% of the company’s stock.\nInstitutional Investors Weigh In On Danaher\nSeveral large investors have recently added to or reduced their stakes in the business. Fortis Capital Advisors LLC increased its stake in Danaher by 1.3% during the 4th quarter. Fortis Capital Advisors LLC now owns 3,983 shares of the conglomerate’s stock worth $914,000 after buying an additional 50 shares during the period. Fayez Sarofim & Co increased its stake in Danaher by 0.6% during the 4th quarter. Fayez Sarofim & Co now owns 8,287 shares of the conglomerate’s stock worth $1,902,000 after buying an additional 50 shares during the period. Coastal Bridge Advisors LLC increased its stake in Danaher by 4.8% during the 4th quarter. Coastal Bridge Advisors LLC now owns 1,099 shares of the conglomerate’s stock worth $252,000 after buying an additional 50 shares during the period. Perennial Investment Advisors LLC increased its stake in Danaher by 2.2% during the 4th quarter. Perennial Investment Advisors LLC now owns 2,343 shares of the conglomerate’s stock worth $538,000 after buying an additional 51 shares during the period. Finally, Sound View Wealth Advisors Group LLC increased its stake in Danaher by 3.1% during the 4th quarter. Sound View Wealth Advisors Group LLC now owns 1,739 shares of the conglomerate’s stock worth $399,000 after buying an additional 52 shares during the period. 79.05% of the stock is owned by hedge funds and other institutional investors.\nAbout Danaher\n(Get Free Report)\nDanaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions.\nFeatured Stories\nReceive News & Ratings for Danaher Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Danaher and related companies with MarketBeat.com's FREE daily email newsletter.",
    "Date&Time": "2025-06-29T06:26:46Z",
    "By Whom": "MarketBeat News",
    "Bussiness Impact": "Danaher (NYSE:DHR – Get Free Report) was upgraded by analysts at Wall Street Zen from a “hold” rating to a “buy” rating in a research note issued on Friday.\nSeveral other brokerages have also issued reports on DHR. Royal Bank Of Canada reiterated an “outperform” rating and issued a $250.00 target p...",
    "URL reference": "https://www.etfdailynews.com/2025/06/29/wall-street-zen-upgrades-danaher-nysedhr-to-buy-2/",
    "Image URL": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/danaher-co-logo-1200x675.png?v=20210524093152&w=240&h=240&zc=2",
    "Type Of News": "Competitor News",
    "Tags": "MarketBeat News, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Danaher (NYSE:DHR) Lowered to “Hold” Rating by Wall Street Zen",
    "Description Story": "Wall Street Zen downgraded shares of Danaher (NYSE:DHR – Free Report) from a buy rating to a hold rating in a report issued on Monday morning.\nDHR has been the topic of a number of other research reports. UBS Group cut their price objective on shares of Danaher from $275.00 to $240.00 and set a “buy” rating on the stock in a research report on Wednesday, April 23rd. Citigroup restated a “buy” rating on shares of Danaher in a research note on Monday, April 7th. Jefferies Financial Group reduced their price target on Danaher from $260.00 to $230.00 and set a “buy” rating on the stock in a research report on Tuesday, April 22nd. Stifel Nicolaus upgraded Danaher from a “hold” rating to a “buy” rating and set a $260.00 price objective for the company in a report on Friday, March 14th. Finally, HSBC dropped their target price on Danaher from $270.00 to $240.00 in a research note on Friday, April 25th. Five equities research analysts have rated the stock with a hold rating and sixteen have assigned a buy rating to the company’s stock. According to data from MarketBeat, the stock currently has a consensus rating of “Moderate Buy” and a consensus target price of $248.17.\nGet Danaher alerts:\nView Our Latest Stock Analysis on Danaher\nDanaher Stock Performance\nShares of NYSE:DHR opened at $199.26 on Monday. The firm has a 50 day moving average of $191.22 and a 200 day moving average of $211.78. The company has a quick ratio of 1.05, a current ratio of 1.40 and a debt-to-equity ratio of 0.31. The company has a market capitalization of $142.60 billion, a price-to-earnings ratio of 37.74, a price-to-earnings-growth ratio of 2.66 and a beta of 0.77. Danaher has a 52 week low of $171.00 and a 52 week high of $281.70.\nDanaher (NYSE:DHR – Get Free Report) last announced its quarterly earnings results on Tuesday, April 22nd. The conglomerate reported $1.88 earnings per share (EPS) for the quarter, beating analysts’ consensus estimates of $1.62 by $0.26. The business had revenue of $5.74 billion for the quarter, compared to the consensus estimate of $5.58 billion. Danaher had a return on equity of 10.82% and a net margin of 16.33%. On average, sell-side analysts predict that Danaher will post 7.63 earnings per share for the current fiscal year.\nDanaher Dividend Announcement\nThe company also recently announced a quarterly dividend, which will be paid on Friday, July 25th. Stockholders of record on Friday, June 27th will be issued a dividend of $0.32 per share. This represents a $1.28 annualized dividend and a dividend yield of 0.64%. Danaher’s dividend payout ratio (DPR) is 24.85%.\nInsider Buying and Selling\nIn other Danaher news, Chairman Steven M. Rales sold 1,250,000 shares of the stock in a transaction dated Monday, May 12th. The shares were sold at an average price of $196.74, for a total value of $245,925,000.00. Following the completion of the sale, the chairman now owns 3,105,808 shares in the company, valued at approximately $611,036,665.92. This represents a 28.70% decrease in their position. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through the SEC website. Also, EVP Christopher Paul Riley sold 15,805 shares of the company’s stock in a transaction that occurred on Wednesday, April 30th. The shares were sold at an average price of $198.00, for a total value of $3,129,390.00. Following the completion of the sale, the executive vice president now owns 15,179 shares of the company’s stock, valued at $3,005,442. This trade represents a 51.01% decrease in their ownership of the stock. The disclosure for this sale can be found here. 11.10% of the stock is currently owned by insiders.\nInstitutional Trading of Danaher\nA number of hedge funds and other institutional investors have recently modified their holdings of DHR. Spinnaker Trust raised its position in shares of Danaher by 1.2% during the 4th quarter. Spinnaker Trust now owns 4,304 shares of the conglomerate’s stock valued at $988,000 after buying an additional 50 shares during the period. Fortis Capital Advisors LLC boosted its stake in shares of Danaher by 1.3% in the fourth quarter. Fortis Capital Advisors LLC now owns 3,983 shares of the conglomerate’s stock valued at $914,000 after purchasing an additional 50 shares during the period. Fayez Sarofim & Co raised its stake in shares of Danaher by 0.6% in the fourth quarter. Fayez Sarofim & Co now owns 8,287 shares of the conglomerate’s stock valued at $1,902,000 after acquiring an additional 50 shares in the last quarter. Coastal Bridge Advisors LLC grew its stake in Danaher by 4.8% during the 4th quarter. Coastal Bridge Advisors LLC now owns 1,099 shares of the conglomerate’s stock worth $252,000 after purchasing an additional 50 shares in the last quarter. Finally, Perennial Investment Advisors LLC grew its position in shares of Danaher by 2.2% during the fourth quarter. Perennial Investment Advisors LLC now owns 2,343 shares of the conglomerate’s stock worth $538,000 after buying an additional 51 shares in the last quarter. 79.05% of the stock is owned by institutional investors and hedge funds.\nDanaher Company Profile\n(Get Free Report)\nDanaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions.\nFurther Reading\nReceive News & Ratings for Danaher Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Danaher and related companies with MarketBeat.com's FREE daily email newsletter.",
    "Date&Time": "2025-06-10T05:56:45Z",
    "By Whom": "MarketBeat News",
    "Bussiness Impact": "Wall Street Zen downgraded shares of Danaher (NYSE:DHR – Free Report) from a buy rating to a hold rating in a report issued on Monday morning.\nDHR has been the topic of a number of other research reports. UBS Group cut their price objective on shares of Danaher from $275.00 to $240.00 and set a “bu...",
    "URL reference": "https://www.etfdailynews.com/2025/06/10/danaher-nysedhr-lowered-to-hold-rating-by-wall-street-zen/",
    "Image URL": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/danaher-co-logo.png?v=20210524093152&w=240&h=240&zc=2",
    "Type Of News": "Competitor News",
    "Tags": "MarketBeat News, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Surgical Robotics Market Set to Surge to $45.9 Billion by 2034 | Innovation and AI Lead the Charge",
    "Description Story": "Ottawa, July 03, 2025 (GLOBE NEWSWIRE) -- According to Precedence Research, the global surgical robotics market size was valued at USD 10.76 billion in 2024 and is forecasted to hit around USD 45.93 billion by 2034, growing at a CAGR of 15.62% from 2025 to 2034. The U.S. surgical robotics market size accounted for USD 3.84 billion in 2024.\nNote: This report is readily available for immediate delivery. We can review it with you in a meeting to ensure data reliability and quality for decision-making.\nThe Complete Study is Now Available for Immediate Access | Download the Sample Pages of this Report@ https://www.precedenceresearch.com/sample/1729\nGlobal Surgical Robotics Market Highlights:\nNorth America led the global market in 2024, accounting for a dominant 51% market share , driven by advanced healthcare infrastructure and high adoption of robotic-assisted surgeries.\nled the global market in 2024, accounting for a , driven by advanced healthcare infrastructure and high adoption of robotic-assisted surgeries. Asia Pacific is expected to register the fastest CAGR during the forecast period, fueled by rising healthcare investments, a growing aging population, and increasing demand for minimally invasive procedures.\nis expected to register the during the forecast period, fueled by rising healthcare investments, a growing aging population, and increasing demand for minimally invasive procedures. Accessories emerged as the leading component segment in 2024, owing to their high usage frequency and recurring demand across surgical applications.\nin 2024, owing to their high usage frequency and recurring demand across surgical applications. Hospitals represented the largest end-user segment, capturing the biggest share of the market in 2024 due to the high volume of complex surgeries and growing integration of robotic systems in clinical settings.\nSurgical Robotics Market Overview\nWhat are Surgical Robotics and the Potential of Surgical Robotics Market?\nSurgical robotics are an assistive device that performs various complex procedures with control, precision, and flexibility. The system has surgical instruments, a camera arm, and robotic arms to perform various surgical procedures. The surgical robotics perform surgery through a small incision and offer benefits like faster recovery, less pain, and minimized blood loss.\nThe system consists of a high-definition 3D and magnified view of the surgical site. surgical robotics provide benefits like performing complex& delicate procedures, improving visualization, and greater control over manipulating instruments. Surgical robotics are widely used in various surgeries, like gynecology, cardiothoracic, neurosurgery, urology, and general surgery.\nAlso Read: How AI is Revolutionizing the Minimally Invasive Surgical Instruments Market\nWhy is Surgical Robotics Market Growing?\nThe growing preference for minimally invasive procedures for minimizing patient trauma, smaller incisions, and less tissue damage increases demand for surgical robotics. The growing age-related conditions and chronic diseases increase the adoption of surgical robotics.\nFactors like growing demand for orthopedic surgery, technological advancements in surgical robotics, growing investment in healthcare infrastructure, automation in healthcare, and rising demand for neurosurgery contribute to the surgical robotics market growth.\nExamine the Full Market Scope@ https://www.precedenceresearch.com/surgical-robotics-market\nTop 5 Most Prominent Surgical Robotics - 2025\nSurgical Robotics Name Uses Benefits Perlove Medical Robot Tumor Surgery Spinal Deformity Surgery Thoracolumbar Spine Surgery Fusion Surgery Sacroiliac Joint Fixation Surgery Saves operation time\nImproves efficiency of screw placement Da Vinci Surgical Robot Gynecology Surgery Urology Surgery General Surgery Head & Neck Surgery Cardiothoracic Surgery Colorectal Surgery Smaller scars\nLower pain\nFaster recovery\nROSA Robotics Knee Surgery Hip Surgery Brain Surgery Provides real-time insights\nCustomized surgical plans CorPath GRX Precision Vascular Robotic Peripheral Vascular Intervention Percutaneous Coronary Intervention Reduces variability among operators\nLower radiation exposure Remebot (Medical Neurosurgical Robot) Minimally Invasive Brain Surgery Remote Surgery Neurosurgery Lower risk of infection\nShorter hospital stays\nAdvanced image processing\nWhat is the Opportunity for the Surgical Robotics Market?\nGrowing Technological Advancements\nThe growing technological advancements in surgical robotics, like haptic feedback, Artificial Intelligence (AI) integration, Machine learning, enhanced imaging, and robotic microsurgery, enhance surgical outcomes and minimize invasiveness. The growing integration with 3D magnification, images from ultrasound, CT, MRI scans, and high-definition cameras provides comprehensive views of surgical sites. Haptic feedback offers a sense of touch to surgeons during robotic procedures and enhances precision.\nThe growing development of microsurgical techniques enhances outcomes in complex surgeries like nerve repairs & vascular repairs. The growing integration with Artificial Intelligence provides various applications like image recognition, motion control, and decision support. Innovations like remote surgeries help patients in underserved areas and remote areas. The adoption of machine learning enhances precision and efficiency. Innovations like autonomous robotic surgery automate some surgical tasks. The growing technological advancement is a major opportunity for the growth of the surgical robotics market.\nAlso Read: Top Growth Drivers in the Fundus Cameras Market: A Deep Dive\nSurgical Robotics Market Challenges and Limitations\nWhat are the Challenges for the Surgical Robotics Market?\nHigh Operational Cost\nDespite several benefits of robotic surgery, high operational cost restricts the growth of the market. The factors like high cost of maintenance & repairs, cost of disposable instruments, initial cost of robotic system, and requirement of specialized training are responsible for high operational cost. The need for high investment in surgical robotics increases the operational cost. The need for maintenance, including hardware repair and software updates, is fueling the operational cost.\nThe growing need for training operating room staff and surgeons increases the operational cost. The increasing demand for disposable and specialized instruments in robotic surgery leads to higher costs. The cost of the installation of robotics in hospitals and healthcare infrastructure is high. The high operational cost of surgical robotics hampers the growth of the market.\nAlso Read: Technological Innovations Shaping the Microsurgical Robotic Systems Market Landscape\nSurgical Robotics Market Report Coverage\nMarket Attributes Key Statistics CAGR 2025-2034 15.62% Market Size in 2024 USD 10.76 Billion Market Size in 2025 USD 12.49 Billion Market Size in 2030 USD 26.68 Billion Market Size in 2032 USD 36.37 Billion Market Size by 2034 USD 45.93 Billion Base Year 2024 Forecast Years 2025 to 2034 Historic Years 2020 to 2023 Dominant Region North America (51% Market Share in 2024) Fastest Growing Region Asia Pacific Segments Covered Component, Surgery Type, End User, and Regions Regions Covered North America, Europe, Asia-Pacific, Latin America and Middle East & Africa Countries Covered U.S., Canada, Germany, UK, France, Italy, Spain, Sweden, Denmark, Norway, China, Japan, India, South Korea, Thailand, Brazil, Mexico, Argentina, South Africa, UAE, Saudi Arabia, Kuwait\nSet up a meeting at your convenience to get more insights instantly! https://www.precedenceresearch.com/schedule-meeting\nWhich Region Dominated the Surgical Robotics Market in 2024?\nNorth America dominated the surgical robotics market in 2024. The advanced healthcare infrastructure, including medical centers and hospitals, increases demand for advanced technologies like surgical robotics. The growing adoption of surgical robotics to enhance surgical precision & improve patient outcomes helps the growth of the market. The growing private & public sector investment in research & development of surgical robotics increases the adoption of surgical robotics.\nThe growing focus on minimally invasive surgeries leads to higher demand for surgical robotics. The growing prevalence of chronic diseases increases demand for surgeries, fueling demand for surgical robotics. The presence of key players like Medtronic and Intuitive Surgical drives the overall growth of the market.\nAlso Read: Technological Innovations Enhance Precision in Minimally Invasive Neurosurgeries\nU.S. Surgical Robotics Market Size, Growth and Trends 2025 to 2034\nAccording to Precedence Research, the U.S. surgical robotics market size is valued at USD 4.46 billion in 2025 and is expected to exceed USD 16.68 billion by 2034, with a double-digit CAGR of 15.82% from 2025 to 2034.\nNote: This report is readily available for immediate delivery. We can review it with you in a meeting to ensure data reliability and quality for decision-making.\nExplore the Complete Report – Sample Pages Available for Immediate Download @ https://www.precedenceresearch.com/sample/1729\nU.S. Surgical Robotics Market Trends:\nAdoption is strongest in orthopedics , the largest application segment, while neurology is emerging as the fastest-growing specialty\n, the largest application segment, while is emerging as the fastest-growing specialty Major systems like Intuitive Surgical’s da Vinci 5 are driving momentum, installations rose from 1,370 in 2023 to 1,526 in 2024 , and U.S. procedures grew nearly 19% , spurring a similar jump in accessory sales.\nare driving momentum, installations rose from , and U.S. procedures grew nearly , spurring a similar jump in accessory sales. Hospitals are expanding capacity too—NYU Langone surpassed 1,500 robotic surgeries post-merger, while Dell Children’s deployed the Velys spine robot for pediatric procedures.\nRising Rate of Adoption of Surgical Robotics Across the Globe: Data & Insights\nIn the UK’s NHS, robot-assisted operations jumped from 35,000 in 2022 to 70,000 procedures in 2024 , and targets hitting 500,000 annually by 2035.\n, and targets hitting North America installed 1,370 da Vinci systems in 2022–2023 and 75% of tertiary care hospitals now routinely use robotic surgery.\nin 2022–2023 and now routinely use robotic surgery. China saw a 64% rise in installations, Japan had 70% utilization in oncology/urology, and India saw 53% procedure growth.\nWhat are the Growth Factors for the Surgical Robotics Market in Asia Pacific?\nAsia Pacific is experiencing the fastest growth in the market during the forecast period. The growing demand for minimally invasive surgical procedures and the increasing prevalence of chronic diseases like cardiovascular disease & cancer increases demand for surgical robotics. The extensive investment in healthcare infrastructure and a strong focus on improving existing robotic systems help in the market growth.\nThe growing rate of various surgeries, like general, gynecology, and urology surgeries, increases the adoption of surgical robotics. The growing demand for healthcare services and government investment in healthcare infrastructure are leading to the development of surgical robotics. The presence of advanced healthcare technologies in countries like India, Japan, and China supports the overall growth of the market.\nAlso Read: North America Leads Cardiovascular Devices Market, Holding 47% Share in 2024\nSurgical Robotics Market Segmentation Analysis\nSurgery Type Analysis\nWhy did the Orthopedic Surgery Segment Dominate the Surgical Robotics Market?\nThe orthopedic surgery segment dominated the surgical robotics market in 2024. The growing orthopedic conditions, like degenerative bone diseases, osteoarthritis, and osteoporosis, increase demand for surgical robotics. The growing demand for joint replacement helps in the market growth. The growing preference for minimally invasive procedures and increasing knee replacement and hip replacement are fueling the adoption of surgical robotics. The growing development of orthopedic surgical robotics in companies like Smith & Nephew and Stryker drives the market growth.\nThe neurosurgery segment is the fastest-growing in the market during the forecast period. The increased prevalence of neurological disorders like Parkinson’s, brain tumors, and epilepsy increases demand for neurosurgical robotics. The growing neurological disorder in the older population, like spine issues & Alzheimer’s, helps in the market growth. The increasing preference for minimally invasive surgical techniques in neurosurgery increases the adoption of surgical robotics. The growing traumatic brain injury conditions support the overall growth of the market.\nAlso Read: How Robotic Surgery is Transforming the Future of Spinal Care\nComponent Analysis\nHow the Accessories Segment Held the Largest Share of the Surgical Robotics Market?\nThe accessories segment held the largest revenue share of the surgical robotics market in 2024. The increasing tasks like tissue manipulation, cutting, and suturing in surgeries increase the demand for accessories. The growing demand for regular replacement of accessories due to limited lifespan & single-use helps in the market growth. The ongoing development of accessories increases adoption to improve surgical outcomes, precision, and efficiency. The growing demand for a wide range of accessories in various medical fields like gynecology, urology, general, orthopedic, and many other surgeries drives the overall growth of the market.\nThe service segment is experiencing the fastest growth in the market during the forecast period. The growing expansion of robotic surgeries in orthopedics, cardiac procedures, general surgery, and neurosurgery increases demand for specialized services. The growing demand for services to upkeep and maintain operations helps in the market growth. The increasing need for specialized training for surgeons and the integration of machine learning & artificial intelligence increases demand for training services. The growing demand to minimize downtime and ensure optimal performance of surgical robotics increases demand for services, supporting the overall growth of the market.\nAlso Read: How Single-Use Technologies Are Revolutionizing Biopharmaceutical Manufacturing\nEnd User Analysis\nHow did Ambulatory Surgical Centers Segment Dominate the Surgical Robotics Market?\nThe ambulatory surgical centers segment dominated the surgical robotics market in 2024. The growing preference for outpatient care increases demand for ambulatory surgical centers. The growing demand from healthcare systems, patients, and payers helps in the market growth. Ambulatory surgical centers provide quicker patient throughput and increase patient satisfaction. They are cost-effective and prioritize efficient patient care. The growing preference for minimally invasive surgeries drives the growth of the market.\nThe hospitals segment is the fastest-growing in the market during the forecast period. The growing prevalence of chronic diseases like urologic disorders and cancer increases demand for hospitals to perform robotic surgeries. The growing hospital investments in surgical robotics help in the market growth. The growing technological advancements in surgical robotics, like control panels, improved camera systems, and robotic arms increase demand for hospitals. The growing government support for hospitals supports the overall growth of the market.\nRelated Topics You May Find Useful:\nThe global next generation surgical robotics market size is expected to be valued at USD 4.54 billion in 2024 and is anticipated to reach around USD 90.00 billion by 2034, expanding at a CAGR of 34.81% over the forecast period from 2024 to 2034.\nis expected to be valued at USD 4.54 billion in 2024 and is anticipated to reach around USD 90.00 billion by 2034, expanding at a CAGR of 34.81% over the forecast period from 2024 to 2034. The global surgical sutures market size estimated at USD 4.90 billion in 2024 and is predicted to increase from USD 5.12 billion in 2025 to approximately USD 7.68 billion by 2034, expanding at a CAGR of 4.60% from 2025 to 2034.\nestimated at USD 4.90 billion in 2024 and is predicted to increase from USD 5.12 billion in 2025 to approximately USD 7.68 billion by 2034, expanding at a CAGR of 4.60% from 2025 to 2034. The global surgical staplers market size was accounted for USD 5.75 billion in 2024, and is expected to reach around USD 11.02 billion by 2034, expanding at a CAGR of 6.72% from 2025 to 2034.\nwas accounted for USD 5.75 billion in 2024, and is expected to reach around USD 11.02 billion by 2034, expanding at a CAGR of 6.72% from 2025 to 2034. The global robotics technology market size is estimated at USD 94.54 billion in 2024 and is anticipated to reach around USD 372.59 billion by 2034, expanding at a CAGR of 14.70% from 2024 to 2034.\nis estimated at USD 94.54 billion in 2024 and is anticipated to reach around USD 372.59 billion by 2034, expanding at a CAGR of 14.70% from 2024 to 2034. The global hospital surgical disinfectants market size was estimated for USD 462.80 million in 2024 and is anticipated to reach around USD 917.00 million by 2034, growing at a CAGR of 7.07% from 2025 to 2034.\nwas estimated for USD 462.80 million in 2024 and is anticipated to reach around USD 917.00 million by 2034, growing at a CAGR of 7.07% from 2025 to 2034. The global surgical laser market size is expected to be valued at USD 3.29 billion in 2024 and is anticipated to reach around USD 6.13 billion by 2034, expanding at a CAGR of 6.42% over the forecast period from 2024 to 2034.\nSurgical Robotics Market Top Companies\nMedrobotics\nRenishaw plc.\nTransEnterix Surgical, Inc.\nIntuitive Surgical\nMedtronic plc.\nTHINK Surgical Inc.\nZimmer Biomet Holdings Inc.\nSmith & Nephew Plc. (Blue Belt Technologies, Inc.)\nAuris Surgical Robotics, Inc. (Hansen Medical Inc.)\nIntuitive Surgical, Inc.\nKUKA AG\nStryker Corporation (MAKO Surgical Corp.)\nMazor Robotics\nWhat are Current Developments in Surgical Robotics?\nIn June 2025, CTS Hospital launched robotic-assisted knee replacement surgery VELYS robot in Anna Nagar. The robotic system consists of advanced software, real-time data, and smart sensors for implant placements and making highly accurate bone cuts. The robot offers faster recovery, reduces swelling, and avoids soft tissue disruptions.\n(Source:https://www.thehindu.com/brandhub/cts-hospital-launches-anna-nagars-first-robotic-assisted-knee-replacement-surgery-velys-robot/article69721997.ece)\nIn December 2024, Fortis Escorts launched a next-generation surgical robot. The robot performs cardiothoracic & vascular, GI, and urology surgery. The innovation offers minimally invasive procedures, enhances patient care, and enables faster recovery. The surgical robot offers 3D vision of the surgical site and enhances precision.\n(Source:https://www.healthcareradius.in/features/technology/fortis-escorts-launches-next-generation-surgical-robot-robot)\nIn December 2024, India’s First made-in-India surgical robot, SSI Mantra launched in Noble Hospital and Research Centre, Pune. The robot is approved by the Central Drugs Standard Control Organization and has 3D HD headset imaging & five robotic arms. The SSI Mantra performs cardiac & thoracic operations, gynecology, general surgery, urology, and complex procedures.\n(Source: https://www.gktoday.in/indias-first-surgical-robot-installed-in-pune/)\nSurgical Robotics Market Key Segments Covered in the Report\nBy Surgery Type\nOrthopedic Surgery Knee Hip Spine Others\nNeurosurgery\nUrology Surgery\nGynecology Surgery\nOther\nBy Component\nAccessories\nServices\nSystems\nBy End User\nHospitals\nAmbulatory Surgical Centers\nBy Region\nNorth America U.S. Canada\nEurope Germany UK France Italy Spain Sweden Denmark Norway\nAsia Pacific China Japan India South Korea Thailand\nLatin America Brazil Mexico Argentina\nMiddle East & Africa South Africa UAE Saudi Arabia Kuwait\nThanks for reading you can also get individual chapter-wise sections or region-wise report versions such as North America, Europe, or Asia Pacific.\nGrab This Premium Report Now – Immediate Delivery Guaranteed@ https://www.precedenceresearch.com/checkout/1729\nYou can place an order or ask any questions, please feel free to contact at sales@precedenceresearch.com | +1 804 441 9344\nStay Ahead with Precedence Research Subscriptions\nUnlock exclusive access to powerful market intelligence, real-time data, and forward-looking insights, tailored to your business. From trend tracking to competitive analysis, our subscription plans keep you informed, agile, and ahead of the curve.\nBrowse Our Subscription Plans@ https://www.precedenceresearch.com/get-a-subscription\nAbout Us\nPrecedence Research is a worldwide market research and consulting organization. We give an unmatched nature of offering to our customers present all around the globe across industry verticals. Precedence Research has expertise in giving deep-dive market insight along with market intelligence to our customers spread crosswise over various undertakings. We are obliged to serve our different client base present over the enterprises of medicinal services, healthcare, innovation, next-gen technologies, semi-conductors, chemicals, automotive, and aerospace & defense, among different ventures present globally.\nWeb: https://www.precedenceresearch.com\nOur Trusted Data Partners:\nTowards Healthcare | Towards Packaging | Towards Automotive | Towards Chem and Materials | Towards FnB | Towards Consumer Goods | Statifacts | Towards EV Solutions | Towards Dental | Nova One Advisor\nGet Recent News:\nhttps://www.precedenceresearch.com/news\nFor Latest Update Follow Us:\nLinkedIn | Facebook | Twitter",
    "Date&Time": "2025-07-03T11:47:00Z",
    "By Whom": "Precedence Research",
    "Bussiness Impact": "Ottawa, July 03, 2025 (GLOBE NEWSWIRE) -- According to Precedence Research, the global surgical robotics market size was valued at USD 10.76 billion in 2024 and is forecasted to hit around USD 45.93 billion by 2034, growing at a CAGR of 15.62% from 2025 to 2034. The U.S. surgical robotics market siz...",
    "URL reference": "https://www.globenewswire.com/news-release/2025/07/03/3109800/0/en/Surgical-Robotics-Market-Set-to-Surge-to-45-9-Billion-by-2034-Innovation-and-AI-Lead-the-Charge.html",
    "Image URL": "https://ml.globenewswire.com/Resource/Download/01eb1f79-0c67-420b-b423-376619f975cd",
    "Type Of News": "Competitor News",
    "Tags": "Precedence Research, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Eli Lilly to roll out diabetes medicine in prefilled pen",
    "Description Story": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nUS pharmaceutical major Eli Lilly on Thursday announced its plan to launch blockbuster diabetes drug Mounjaro ( tirzepatide ) in KwikPen , a prefilled pen designed for once-a-week administration for single patients in the Indian market, two days after its rival Danish drug maker Novo Nordisk launched the weight loss drug Wegovy as a weekly injection in the country, intensifying competition in the booming obesity market.Eli Lilly said it received the approval of the Indian drug regulatory authority but did not comment on the launch timeline. The expected price of the pen device was also not disclosed. Once launched, the company said each pen will deliver four fixed doses of 0.6 ml and has been approved in six dose strengths including 2.5 mg, 5 mg, 7.5 mg, 10 mg, 12.5 mg, and 15 mg.Wegovy, launched earlier this week, is expected to be in the pharmacies by the end of this month. The delivery device will contain four doses of 0.25 mg, 0.5 mg and 1 mg priced at '17,345 a month. This translates into a weekly cost of '4,366. The 1.7 mg dose will be priced at '24,280 per month, and 2.4 mg dose will be priced at '26,015.Anoop Misra, chairman of Fortis C-DOC, Centre of Excellence for diabetes, metabolic diseases and endocrinology said Mounjaro's dual mechanism may offer superior efficacy, however \"\"wider adoption\"\" will depend on the \"\"price\"\" of the device.Winselow Tucker, president and general manager of Eli Lilly India, said the approval of Mounjaro KwikPen marks a step forward in the care of people living with type 2 diabetes and obesity, offering a convenient way for patients to take their medication. Mounjaro reduces body weight and decreases fat mass by regulating appetite.\"\"With this approval, all six dosage options for Mounjaro will soon be available in India, supporting a more personalised approach to treatment and allowing healthcare professionals to tailor care based on individual patient needs and clinical goals,\"\" he said.Mounjaro is the first and only dual GIP (glucose- dependent insulinotropic polypeptide) and GLP-1 (glucagon-like peptide-1) receptor agonist, indicated as an adjunct to diet and exercise for the treatment of Type 2 diabetes and chronic weight management in adults with obesity or overweight, with one weight-related comorbidity.",
    "Date&Time": "2025-06-26T18:49:21Z",
    "By Whom": "Teena Thacker",
    "Bussiness Impact": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nUS pharmaceutical major Eli Lilly on Thursday announced its plan to launch blockbuster diabetes drug Mounjaro ( tirzepatide ) in KwikPen , a prefilled pen designed for once-a-week administr...",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/eli-lilly-to-roll-out-diabetes-medicine-in-prefilled-pen/articleshow/122097854.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122097900,width-1200,height-630,imgsize-25606,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Teena Thacker, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Big money is making a beeline for Indian hospitals",
    "Description Story": "It seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
    "Date&Time": "2025-06-30T08:34:24Z",
    "By Whom": "ET Online",
    "Bussiness Impact": "It seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/big-money-is-making-a-beeline-for-indian-hospitals/articleshow/122156400.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122156606,width-1200,height-630,imgsize-107099,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ET Online, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Manipal Health Enterprises leads race to buy Sahyadri Hospitals with Rs 6,838 crore bid",
    "Description Story": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nIPO-bound Manipal Health Enterprises is leading the race to acquire Sahyadri Hospitals with a Rs 6,838 crore ($800 million) bid, people familiar with the matter said. It is trailed closely by Blackstone , they said.While the sources did not reveal the financial terms of the global investment firm’s offer, the strong interest in the Pune-headquartered hospital chain owned by Canada’s pension fund Ontario Teachers’ Pension Plan (OTPP) is symptomatic of the high-intensity consolidation ongoing in India’s hospital space. IHH Healthcare-backed Fortis Healthcare and EQT Partners also submitted bids on June 23, which was the last day to submit binding financial bids.Their offers were termed “uncompetitive” by people ET spoke with. Manipal, Blackstone, Fortis and OTPP declined to comment. EQT did not responded to ET’s queries until press time Sunday.OTPP acquired Sahyadri from Everstone Capital in August 2022 at a valuation of around Rs 2,500 crore, outbidding Max Healthcare. Everstone had bought the hospital chain three years earlier in 2019 from its founder, neurosurgeon Charudutt Apte, for about Rs 1,000 crore. ET first reported on December 6 last year that OTPP was planning to put Sahyadri Hospitals on the block. In May, ET reported that Manipal Health, Singapore’s IHH Healthcare, Blackstone and TPG-backed platform Aster DM Quality Care Limited, KKR & Co and EQT Partners were among those that had submitted initial bids for it.Sahyadri Hospitals operates 11 facilities across Pune, Nashik, Ahilya Nagar and Karad, comprising 1,300 beds, 2,500 clinicians and 3,500 support staff, according to information available on its website. Sahyadri Hospitals is estimated to have posted Rs 210 crore in earnings before interest, tax, depreciation and amortisation on revenue of Rs 1,200 crore in FY25, said a fund manager at one of the bidding private equity funds.For Manipal Health, commonly known as Manipal Hospitals, the deal could provide a muchneeded strategic foothold in western India, where it currently lacks a significant presence. In June 2025, KKR invested $600 million in debt into the Manipal Group to support its accelerated expansion and corporate growth plans.The IPO-bound Manipal Hospitals, the second-largest hospital chain in India, has been on an aggressive acquisition spree. In 2023, it acquired an 84% stake in Kolkata-based AMRI Hospitals in a deal valued at Rs 2,400 crore. Two years earlier, it bought Columbia Asia's Indian operations for Rs 2,100 crore.",
    "Date&Time": "2025-06-30T00:30:00Z",
    "By Whom": "Mohit Bhalla and Reghu Balakrishnan",
    "Bussiness Impact": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nIPO-bound Manipal Health Enterprises is leading the race to acquire Sahyadri Hospitals with a Rs 6,838 crore ($800 million) bid, people familiar with the matter said. It is trailed closely ...",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/manipal-health-enterprises-leads-race-to-buy-sahyadri-hospitals-with-rs-6838-crore-bid/articleshow/122147217.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122147216,width-1200,height-630,imgsize-103202,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Mohit Bhalla and Reghu Balakrishnan, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Sarasota Medical Products, Inc. Celebrates 15 Years of Innovation, Partnership, and Purpose in Medical Adhesives",
    "Description Story": "Sarasota, Florida, June 13, 2025 (GLOBE NEWSWIRE) --\nSarasota Medical Products, Inc.\nSarasota Medical Products, Inc. (SMP), a veteran-owned innovator in the field of medical device adhesives, is proudly celebrating its 15th anniversary. It is a milestone that reflects its unwavering commitment to innovation, trusted partnership, and elevating the standard of care for patients worldwide.\nFounded in 2010 by Dr. Walter Francis Leise III, SMP began as an ambitious idea on paper, an MBA business plan, and a leap of faith away from corporate life. Today, the company stands as a recognized innovator in custom hydrocolloid development and wound, ostomy, and incontinence care, with a legacy of breakthroughs, partnerships, and purpose-driven growth.\nThe turning point in SMP’s early days came unexpectedly on Christmas Eve in 2011. Dr. Leise was in the lab, frustrated by an adhesive formulation that didn’t meet expectations. But inspiration struck the next morning.\n“I realized the formulation could actually serve a completely different need,” he said. “It turned out to be perfect as a moldable gasket for ostomy patients. That moment really encapsulated what we now do: adapt, innovate, and listen to what patients need.” That adaptability became the cornerstone of SMP’s success.\nSMP closely works with partners to develop customized, premium adhesive solutions. Each formulation is created with patients in mind. “We’re not a ‘take it or leave it’ company,” said Dr. Leise. SMP dwells on the philosophy that good products come from great partnerships. It only works with vendors who want to be partners, not just buyers. And the SMP team speaks to the patients constantly to hear them out, especially if something’s not working, and constantly works on innovation. This commitment has led them to key acquisitions and brand expansions that reinforce SMP’s standing in the market.\nCymed Micro Skin\nIn 2019, SMP acquired Cymed, a premium brand tailored for active patients. Employing micro skin, a breathable, ultra-thin, water-resistant adhesive dressing, Cymed empowers users to move freely, exercise, swim, and live without limits. “Cymed is for people who don’t want to slow down,” said Dr. Leise. “It’s one of the oldest names in ostomy care, and we’re proud to carry it forward with next-gen improvements.”\nEntrust Ostomy Care\nIn 2020, SMP acquired Entrust, now housed under its Fortis Medical Products division. Known for high-quality ostomy, ileostomy, and urostomy devices, Entrust was brought under the SMP umbrella during the COVID-19 crisis, preserving a trusted brand and giving it the operational strength to grow.\n“With Entrust, the mission is trust,” said Dr. Leise. “Patients deserve to forget they’ve had a life-changing surgery. Our job is to make products so dependable and comfortable, their dignity and quality of life are never in question.”\nBased in Florida, SMP maintains its U.S.-made advantage, allowing it to maintain cost-competitive pricing against Asian manufacturers, all while offering unmatched customization and quality. Innovations in process efficiency have further strengthened SMP’s position. The company has developed proprietary methods that dramatically reduce labor requirements and production costs, without compromising product performance. These efficiencies enable SMP to keep prices low, expand globally, and reinvest in research and development, including groundbreaking ventures into antibacterial adhesives.\nLooking ahead, SMP is launching a new brand, Ndur Healthcare, featuring a skincare line powered by natural ingredients like tallow, alongside anti-aging and acne care innovations. A major highlight is Magic Shields, a patented, FDA-approved, silver-free antibacterial hydrocolloid that kills MRSA and E. coli, reduces fungal infections, and supports wound healing. Magic Shields is designed to serve both skincare and wound care needs, showcasing SMP’s expanding footprint in preventive health.\nOver the past decade and a half, SMP has gone from a single formulation to hundreds of private-label products, serving more than 20 companies. “I’m proud we’re still here,” said Dr. Leise. “It’s easy to underestimate the grit it takes to survive and grow in this industry. But I believe in working hard every day so that when luck comes, we’re ready for it.”\nAs Sarasota Medical Products celebrates this 15-year milestone, the company remains anchored in its mission: to empower patients to live confidently, comfortably, and with dignity, one innovative adhesive at a time.\nMedia Contact\nName: Rachel Crumbley\nEmail: info@sarasotamedical.com\nThe content provided herein does not constitute medical advice. Any references to treatments, products, or services are not intended as endorsements. The company and its affiliates are not responsible for the accuracy, reliability, effectiveness, or correct use of information contained in this press release.",
    "Date&Time": "2025-06-13T17:22:00Z",
    "By Whom": "Sarasota Medical Products",
    "Bussiness Impact": "Sarasota, Florida, June 13, 2025 (GLOBE NEWSWIRE) --\nSarasota Medical Products, Inc.\nSarasota Medical Products, Inc. (SMP), a veteran-owned innovator in the field of medical device adhesives, is proudly celebrating its 15th anniversary. It is a milestone that reflects its unwavering co...",
    "URL reference": "https://www.globenewswire.com/news-release/2025/06/13/3099225/0/en/Sarasota-Medical-Products-Inc-Celebrates-15-Years-of-Innovation-Partnership-and-Purpose-in-Medical-Adhesives.html",
    "Image URL": "",
    "Type Of News": "Competitor News",
    "Tags": "Sarasota Medical Products, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "How taking Vitamin A, B12, D or Biotin without doctor’s advice may harm your liver, kidneys, cause birth defects, and more health issues",
    "Description Story": "Synopsis\nExperts caution against unsupervised intake of Vitamin D, B12, magnesium, and biotin supplements, highlighting potential harm despite their popularity. Consulting a doctor is crucial to determine appropriate dosage based on individual health needs and blood reports. Excessive intake can lead to toxicity, causing issues like liver problems, kidney damage, or inaccurate lab results, emphasizing the importance of medical guidance.",
    "Date&Time": "2025-06-15T16:10:54Z",
    "By Whom": "ET Online",
    "Bussiness Impact": "Synopsis\nExperts caution against unsupervised intake of Vitamin D, B12, magnesium, and biotin supplements, highlighting potential harm despite their popularity. Consulting a doctor is crucial to determine appropriate dosage based on individual health needs and blood reports. Excessive intake can le...",
    "URL reference": "https://economictimes.indiatimes.com/news/new-updates/how-taking-vitamin-a-b12-d-or-biotin-without-doctors-advice-may-harm-your-liver-kidneys-cause-birth-defects-and-more-health-issues/articleshow/121865142.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-121865144,width-1200,height-630,imgsize-1363895,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ET Online, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "India’s probiotics market doubles in 5 years, hits Rs 2,070 cr in 2025",
    "Description Story": "ET Bureau\nLive Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nAs Indians seek ways to improve gut health, boost immunity, and enhance digestive function, probiotics are becoming a significant ingredient in their diet. Data suggest that probiotics market clocked strong double-digit growth of 22% on a Moving Annual Total (MAT) for May, as per market research firm PharmaTrac.\"\"The probiotics market has almost doubled in the last five years,\"\" said Sheetal Sapale, vice president, commercial, PharmaTrac. The probiotics market has grown from ₹1,016 crore MAT value in 2021 to ₹2,070 crore in 2025, show data.Several pharmaceutical companies including Sun Pharma , USV, Zydus , Torrent, Mankind and Dr Reddy's are leading the market, which is mostly driven by the older brands as new launches in the last two years have garnered a revenue of approximately ₹49 crore only, data showed.\"\"The probiotics market has become a very important market as far as restoration of gut health is concerned. Ailments affecting the normal gut microbe density, especially diarrhoea, dysentery and other intestinal/stomach infections, need consumption of probiotics along with anti-infectives. In some cases, consumption of some medications also involves nausea and vomiting as side effects, wherein probiotics play an important role. The overall market has shown a 5-year value CAGR of 19% and a very strong growth of 22% in MAT May 2025,\"\" Sapale said.While probiotic drugs account for over 90% of the market in India, it is followed by milk and milk products. Companies such as Amul and Mother Dairy are aggressively pushing probiotics, while start-ups such as The Good Bug and WellBeing Nutrition have been also attracting significant investor interest.Jayen Mehta, MD of the Gujarat Co-operative Milk Marketing Federation which makes and sells a range of Amul dairy products, said they sell 3 million litres of probiotic buttermilk every day across India. Amul is the largest probiotic brand in the country, claimed the company.\"\"The category is growing in high double digits and has high momentum but remains very under-penetrated. India being a very large and growing market for processed foods also translates to a large addressable market for gut-related issues,\"\" said Kannan Sitaram, cofounder and partner of Fireside Ventures, an early-stage investment fund which has invested in The Good Bug and Wellbeing Nutrition.\"\"Our probiotic portfolio currently contributes around 45% to our overall fresh dairy products portfolio. The category is seeing strong growth...,\"\" said Manish Bandlish, MD, Mother Dairy.Last month, The Good Bug raised '100 crore in a fresh funding round led by Susquehanna Asia Venture Capital, with existing investor Fireside Ventures also participating in the round.In May, probiotics delivered a standout performance with exponential double-digit growth, signalling rising consumer preference for gut-health solutions.Dr Rakesh Patel, consultant gastroenterology, Fortis Hospital, Kalyan, said consumption is growing rapidly in India, especially among younger people, thanks to increasing health awareness and the influence of social media and healthcare experts.Adding a word of caution on its rampant usage, Dr Kaushal Madan, principal director & head-gastroenterology, hepatology & endoscopy, liver transplant and biliary sciences, at Max Hospital in Saket, New Delhi, said there are several conditions and indications where probiotics have been shown to be very effective in controlling certain conditions, but \"\"in many other illnesses, their rampant use is possibly unwarranted.\"\"",
    "Date&Time": "2025-06-11T18:44:43Z",
    "By Whom": "Teena Thacker and Ratna Bhushan",
    "Bussiness Impact": "ET Bureau\nLive Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nAs Indians seek ways to improve gut health, boost immunity, and enhance digestive function, probiotics are becoming a significant ingredient in their diet. Data suggest that prob...",
    "URL reference": "https://economictimes.indiatimes.com/industry/cons-products/food/indias-probiotics-market-doubles-in-5-years-hits-rs-2070-cr-in-2025/articleshow/121786508.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-121786530,width-1200,height-630,imgsize-79760,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Teena Thacker and Ratna Bhushan, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Stock Picks & Market Outlook: Neeraj Dewan on where to look for opportunities now",
    "Description Story": "Apollo Hospitals has announced plans to list its digital and pharmacy business within the next 18 to 21 months. This move comes after a series of internal restructurings over the past couple of years aimed at simplifying the overall corporate structure. Neeraj Dewan in an interview to ET Now said that this delisting and subsequent platform listing is a long-anticipated value unlocking event that could significantly benefit long-term shareholders.",
    "Date&Time": "2025-07-01T09:01:01Z",
    "By Whom": "ETMarkets.com",
    "Bussiness Impact": "Apollo Hospitals has announced plans to list its digital and pharmacy business within the next 18 to 21 months. This move comes after a series of internal restructurings over the past couple of years aimed at simplifying the overall corporate structure. Neeraj Dewan in an interview to ET Now said th...",
    "URL reference": "https://m.economictimes.com/markets/stocks/news/stock-picks-amp-market-outlook-neeraj-dewan-on-where-to-look-for-opportunities-now/apollo-hospitals-restructuring-for-value-unlock/slideshow/122179398.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122179398,width-1070,height-580,overlay-etmarkets/slideshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ETMarkets.com, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "Neeraj Dewan bullish on NBFCs and PSU banks, sees continued momentum ahead",
    "Description Story": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\n\"\"There is a possibility that you can get some improvement in the valuation, in the way the stock has been performing and next one to two years you stay invested in Apollo , you should get a decent return from these levels and of course, this value unlocking will also help, which has been long pending and people have been expecting this,\"\" says Neeraj Dewan , Market Expert.Actually, I have been positive on this hospital and healthcare segment and Apollo Hospitals has not given that kind of return which other hospital chain like a Fortis has given over the last few years. So, there is a possibility that you can get some improvement in the valuation, in the way the stock has been performing and next one to two years you stay invested in Apollo, you should get a decent return from these levels and of course, this value unlocking will also help, which has been long pending and people have been expecting this.It will take some more time definitely to get the whole thing into place, this goes through a process so that will take some time, but for long-term investor definitely this should be a good bet to stay invested in.With the recent measures by RBI for project financing and with the liquidity infusion that RB has done and interest rate cut, over the next two to three quarters you will get the impact of all this coming into power financers, companies like IREDA, they should benefit and there should be increase in credit flow which should happen, so credit demand should also pick up because of this. So, I am positive on this space. Next two to three quarters you should see the impact and the stock prices should also reflect that in the next one year.Yes, actually still it is a wait and watch as far as IT is concerned. One should see how things pan out as far as US is concerned. So, once you get little more clarity what is happening because still there is a fear of some slowdown happening, tariff situation still not that clear, you are reaching a stage where again the tariff talks started. So, if there is a slowdown which is happening because of that in US later, it is still not so clear. So, still wait and watch for it. Let us see what the IT majors have to say, what they have to say post results and then we will take a call from there.I think this quarter should again be muted because there is not too much expectation from this quarter, June quarter, because first quarter is normally that great a quarter, normally a lot of the booking and everything is done in the last quarter or the last couple of quarters.So, first and second quarter normally a little muted. But let us see if we are able to beat this expectation which is low right now.I am positive on PSU banks and NBFCs, some specific housing finance companies. These are the ones where you have seen some momentum also picking up. NBFCs should continue doing well, this quarter should also be decent for them. Even specific housing finance companies should do well.And then I am positive on infrastructure. I am positive on autos, but specifically something like two wheelers or companies which are into tractor and farm equipment, there some improvement should be visible. And beside that, FMCG is one space where because inflation is low, expectation of good monsoon would have also created some improvement in demand there.So, it is early to say whether the demand improvement has happened or not, but we will get some view post the results from the companies also. Capital good is one space where you have seen improvement happening. You see that order flow improvement, some execution pickup has also happened in project. So, capital good is another sector I will be watching for in this result.Yes, definitely government expenditure had come to a standstill earlier in the year, but during March there was a view that they had picked up and order flows have also improved, execution is improving because liquidity improving. So, I think that there should be some visible improvement which we could see in these results though the full impact would not have come but you will get some improvement, plus post result conference calls will also give a better view of what is there ahead of us. There should be improvement that should be there.See, it is more again stock specific. I am not looking at only largecaps. It is more of a mid and smallcap which should also do well. So, I feel that if you look at companies like, for example, company like a Bajaj Auto , it is a largecap company, it is trading at below what long-term average valuation because of obvious reason the management commentary and the results have not been that great.But some visible pickup happening there can have a good impact on the share price of Bajaj Auto if you see some improvement happening there. And other stock that I am looking in the largecap basket would be something like Divi’s which I have been positive on. They are showing improvement and now the stock price is also reflecting that.So, for a long-term investor Divi’s Lab would still be a good pick as far as pharma is concerned. And beside that like I mentioned capital good space is one space where I am looking at the largecap names in capital good that should do well and then I mentioned PSU banks, there also I am positive on, though initially there is a NIM which may contract because of the interest rate cut, but then overall credit demand should pick up. So, next two-three quarters we can see that improvement happening in the credit demand.",
    "Date&Time": "2025-07-01T07:33:25Z",
    "By Whom": "ET Now",
    "Bussiness Impact": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our ETMarkets WhatsApp channel\n\"\"There is a possibility that you can get some improvement in the valuation, in the way the stock has been performing and next one to two years you stay invested in Apollo , you should get a dece...",
    "URL reference": "https://economictimes.indiatimes.com/markets/expert-view/neeraj-dewan-bullish-on-nbfcs-and-psu-banks-sees-continued-momentum-ahead/articleshow/122177160.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122177192,width-1200,height-630,imgsize-28404,overlay-etmarkets/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ET Now, NewsAPI.org"
  },
  {
    "Company": "Fortis Healthcare",
    "Headline Title": "A big fat fight has just broken out in India",
    "Description Story": "Wegovy versus Mounjaro: The big fat fight\nLive Events\nA generic weight-loss tide is coming\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nWith the launch of Wegovy by Novo Nordisk in India , the country’s obesity drugs sector is all set to witness intense competition. The drug's arrival sets the stage for a high-stakes battle against Eli Lilly’s Mounjaro , which debuted earlier in March 2025 and quickly captured market interest. With obesity and Type 2 diabetes rising at alarming rates across India, these powerful weight-loss drugs are ushering in a new era of competition and long-term market disruption.Eli Lilly’s Mounjaro, based on the molecule tirzepatide, entered the Indian market several months ahead of Wegovy. Its early presence helped it gain momentum rapidly, with over 81,000 units sold within weeks of launch and revenues approaching Rs 24 crore, according to data from prescription audit firm PharmaTrac . Its dual-action mechanism, targeting both GIP and GLP-1 receptors, has proven superior in global clinical trials, showing weight loss effects of up to 23%. Novo Nordisk’s Wegovy, which contains semaglutide, comes with a slightly lower average weight-loss efficacy but boasts a strong global track record, particularly with its well-documented cardiovascular benefits. Wegovy, a once-a-week injection, will be in pharmacies by the end of the month, Novo said, as the drug looked poised to erode some of Lilly's market share. Mounjaro's sales jumped 60% between April and May, industry experts told Reuters.Novo Nordisk’s ambition to race ahead of Mounjaro will be supported by robust clinical data on its benefits in heart patients, in addition to weight loss. Novo Nordisk has demonstrated the cardiovascular benefits of Wegovy in Indian patients, according to regulatory filings seen by ET. The company is taking the drug “beyond obesity,” by illustrating clear benefits of cardiovascular risk reduction, according to Novo Nordisk India Managing Director Vikrant Shrotriya. “We call it the 20-20 strategy — 20% weight loss and 20% cardiovascular risk reduction.”To close the launch gap, Novo Nordisk has adopted an aggressive pricing and accessibility strategy. Wegovy is available in 0.25 mg, 0.5 mg, 1 mg, 1.7 mg and 2.4 mg doses. The first three will be priced at Rs 4,336, the company said, with the monthly cost being Rs 17,345, in similar range to Lilly's Mounjaro. Wegovy's 1.7 mg dose will be priced at Rs 24,280, and 2.4 mg at Rs 26,015. Its rival Mounjaro, a once-weekly injection, is priced at Rs 3,500 for a 2.5 mg vial and Rs 4,375 for a 5 mg vial, its lowest doses, the company said in March. Its highest dose is 15 mg.Novo’s ambition is bold. It expects Wegovy to generate Rs 8,600 crore (roughly $1 billion) in sales in India within five to seven years. But in this rapidly evolving marketplace, strategy alone may not be enough.The core driver of market differentiation will lie in efficacy and patient experience. While Mounjaro is better placed in terms of absolute weight loss, both drugs deliver transformational outcomes for people with obesity or metabolic disorders. Semaglutide, meanwhile, benefits from longer-standing clinical trust. It has been prescribed globally for both diabetes and obesity under brands Ozempic and Wegovy, and is increasingly supported by cardiovascular outcome data. Physicians in India may favour semaglutide for its broader evidence base. In practice, many patients may switch between the two based on cost, availability, efficacy response and physician guidance, making brand loyalty fluid and competitive positioning crucial.For Eli Lilly, the immediate goal is to consolidate its first-mover advantage. It will focus on scaling supply, enhancing prescriber engagement and cementing Mounjaro’s reputation as a gold-standard therapy. Novo Nordisk, on the other hand, will look to rapidly close the gap by leveraging pricing strategy and its global brand equity, before its patent expires next year.Cost is a critical factor point in the Indian market. Both Wegovy and Mounjaro currently sit in a price range that makes them accessible mainly to upper-income groups or those with compelling medical need. Annual therapy can cost lakhs of rupees per patient, depending on dose and duration, a figure far beyond the average Indian household healthcare budget. \"\"Novo Nordisk is strategising the timely introduction of Wegovy in India. However, unless these firms bring down the cost of these designer medicines, they will not be popular among masses. They will be restricted to a very few patients,\"\" Nishith Chandra, director, Interventional Cardiology, Fortis Escorts Heart Institute in Delhi, told ET recently.However, a tectonic shift is looming. The patent for semaglutide expires in India in 2026, unlocking the door for local pharmaceutical giants such as Dr. Reddy’s, Sun Pharma, Cipla, Lupin and Biocon to manufacture and launch generic versions. These versions could drive prices down substantially. Indian drugmakers are now racing to develop cheaper versions of these weight-loss drugs to grab a share of the vast Indian market.Reuters reported in December last year that cheaper copies of patented drugs of both the companies are winning approval from some regulators overseas, posing a threat to the pharma giants' prices and market share. Since Novo's blockbuster Ozempic diabetes treatment was approved in the US in 2017, regulators have greenlighted 22 medicines containing its main ingredient in Bangladesh, Laos, Russia and Paraguay as well as seven copies of Lilly's rival drugs in Bangladesh, according to a Reuters review. Last month, Novo Nordisk sued Dr Reddy’s Laboratories and OneSource in the Delhi High Court over allegations of patent infringement.The generic versions will transform the current high-cost niche market into a volume-driven market, enabling middle-class and even lower-income segments to access life-changing obesity treatments. Mounjaro, which enjoys patent protection beyond 2026, will remain in the premium bracket, potentially defending its position through strong branding.India’s anti-obesity drug market has grown more than fourfold in the last five years fuelled by rising instances of lifestyle diseases along with greater affordability and willingness among a section of the population to pay for weight-loss treatment, showed data from industry tracker and market researcher PharmaTrac. The anti-obesity drug market soared to Rs 576 crore as of March 2025 from Rs 133 crore in March 2021. With obesity and Type 2 diabetes rates skyrocketing, India is at a tipping point. According to the International Diabetes Federation, the number of Indian adults with diabetes is expected to surge from 74.2 million in 2021 to over 124 million by 2045. Against this backdrop, demand for weight-loss drugs is surging. Mounjaro’s launch had triggered a wave of public interest, with doctors receiving a lot of queries from curious patients. .Over the next few years, India’s weight-loss drug market is likely to evolve in three phases. Through 2025 and mid-2026, the competition between Wegovy and Mounjaro will dominate, with branded drugs holding center stage. By late 2026, the entry of generic semaglutide will disrupt the market, expanding access but also challenging branded revenue models. Finally, from 2027 onward, the market will likely bifurcate. Premium treatments like Mounjaro will serve patients with critical needs who would want an established brand, while low-cost generics will democratise obesity treatment across income segments.(With agency inputs)",
    "Date&Time": "2025-06-24T13:12:50Z",
    "By Whom": "ET Online",
    "Bussiness Impact": "Wegovy versus Mounjaro: The big fat fight\nLive Events\nA generic weight-loss tide is coming\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nWith the launch of Wegovy by Novo Nordisk in India , the country’s obesity drugs sector is all set to witnes...",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/a-big-fat-fight-has-just-broken-out-in-india/articleshow/122049705.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122050071,width-1200,height-630,imgsize-3146951,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ET Online, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Manipal and Fortis to raise funds to bid for Sahyadri Hospitals",
    "Description Story": "",
    "Date&Time": "2025-06-17T14:35:05Z",
    "By Whom": "Not Mentioned",
    "Bussiness Impact": "",
    "URL reference": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_077272bb-35cb-4eaa-8ee9-ad4abcda777d",
    "Image URL": "",
    "Type Of News": "Competitor News",
    "Tags": "Not Mentioned, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Manipal and Fortis to raise funds to bid for Sahyadri Hospitals",
    "Description Story": "Linda Yaccarino resigns as CEO of Elon Musk's X after two turbulent years marked by internal conflicts and a merger with Musk’s AI company, leaving the platform’s future uncertain.\nMarket Summary Markets face mixed signals as Trump’s tariff threats unsettle equities, though tech stocks like Nvidia surge to record highs. Aviation gains on Delta's strong outlook, while cautious investors monitor inflation and trade policy uncertainties.\nLinda Yaccarino Leaves X CEO Role... Power Struggles Cited X CEO Linda Yaccarino Steps Down After Two Turbulent Years Linda Yaccarino's challenging tenure as CEO of Elon Musk's social media platform X ends amid internal power struggles and a merger with Musk's AI company. The abrupt resignation raises questions about control and the platform's future direction.\nFigure of the Day 50% - Trump’s new tariff rate imposed on Brazilian imports escalating trade tensions.\nTrump Hits Brazil With 50% Tariff... Cites Bolsonaro 'Witch Hunt' Trump Tariffs Brazil, Demands End to Bolsonaro Trial President Trump escalates trade tensions by imposing a sweeping 50% tariff on imports from Brazil, citing retaliation over the legal treatment of former President Bolsonaro. The move intensifies geopolitical risks and rattles markets.\nNvidia Becomes First $4 Trillion Company... AI Boom Booster Chipmaker Nvidia Hits Historic $4T Market Cap Record Nvidia shatters market records by becoming the first company to hit a $4 trillion valuation, driven by its dominance in AI chip technology amid surging demand. This milestone highlights the tech sector's outsized role in current market rallies.\nBullish Nvidia Becomes First $4 Trillion Public Company Amid AI Boom Nvidia hits an unprecedented $4 trillion valuation, marking a historic milestone fueled by its leadership in AI technology and investor enthusiasm. More on 247wallst.com\nDelta Air Lines Surges on Record Revenue... Demand Stabilizing Delta Sparks Airline Rally After Raising Guidance... Dividend Hike Delta Air Lines posts record revenue and revises its financial outlook higher as flight demand stabilizes amid economic uncertainties. The airline’s bullish forecast sparks gains across the aviation sector.\nFerrero Nears $3.1B Deal to Acquire WK Kellogg Co. WK Kellogg Stock Soars on Reports of $3B Ferrero Takeover Ferrero, the Italian confectionery giant behind Nutella, agrees to acquire WK Kellogg for $3.1 billion, merging iconic cereal brands like Froot Loops under its portfolio, in a deal reflecting growing consolidation in the food sector.\nBearish Conagra Stock Tumbles on Tariff-Driven Profit Guidance Cut Conagra shares fall sharply after the food giant cites tariff-related cost pressures leading to a negative profit outlook, signaling broader inflation challenges.\nCopper Prices Jump 50% Tariffs Loom... Market Jitters Mount Trump Tariffs Roil Markets... Copper and Steel Surge US tariffs announced by President Trump are fueling market volatility, with copper prices surging amid tight supply and trade policy uncertainty. These measures are weighing on earnings forecasts and global trade dynamics.\nMicrosoft AI Saves $500M... Job Cuts Continue Microsoft Stock Hits Record High on AI Earnings Boost Microsoft leverages AI savings of over $500 million internally while trimming thousands of jobs, reflecting a productivity drive fueled by automation despite headcount cuts.\nRegulatory Impact The European Union unveiled a Code of Practice on AI outlining transparency, copyright, and safety guidelines to assist businesses in complying with the EU AI Act.\nOpenAI Readies AI Browser to Take On Google Chrome OpenAI to Release AI-Powered Web Browser Shortly OpenAI prepares to launch an AI-powered web browser aiming to challenge Google Chrome’s dominance, marking a major shift in online search and browsing.\nPentagon Becomes Largest Shareholder in MP Materials... Shares Surge MP Materials Stock Soars on Defense Dept Rare Earth Deal The US Department of Defense increases its stake in rare earth magnet producer MP Materials, driving shares up 40% amid efforts to secure critical supply chains away from China.\nQuote The abrupt resignation shakes the foundation of X’s vision—control was never hers to command.\n— Industry Insider on Linda Yaccarino’s departure\nStocks Falter As Trump Tariffs Rattle Nvidia-Led Rally Market Rally Stalls... Amid Tariff Fears and Trade Uncertainty Stock markets remain cautious amid new tariff threats and geopolitical tensions. Major indices show mixed performance as investors await clarity on trade policies and economic forecasts.\nXRP Options Surge Near $100M... Crypto Bulls Rally XRP Price Tests $2.46 Barrier Following Burst Rally XRP and other cryptocurrencies attract investor interest, with XRP options reaching near $100 million amid high volatility and bullish momentum.\nTesla Promises Robotaxi Expansion With Grok AI Rollout Grok AI Arrives in Tesla Cars Next Week — Elon Musk Tesla intensifies plans for robotaxi expansion, integrating xAI's Grok AI chatbot into its vehicles next week despite recent stock volatility and leadership concerns.\nBiden's Doctor Pleads Fifth in GOP Probe Former Biden Physician Refuses to Answer Health Investigation The Biden administration faces scrutiny as former White House doctor invokes the Fifth Amendment amid GOP probes, highlighting ongoing political tensions.\nAmazon Unveils AI Servers to Power Nvidia Chips Amazon intensifies AI infrastructure with new powerful servers designed to support Nvidia chips amidst an accelerating AI boom, strengthening its cloud services.\nJane Birkin’s Original Hermès Bag Hits Paris Auction UK auctions historic Jane Birkin Hermès bag, spotlighting luxury collectibles as investment assets amid growing global demand.\nTexas Flood Death Toll Rises... Search Expands for Missing Massive Texas floods leave over 120 dead and more than 170 missing, raising questions on disaster preparedness and response as recovery efforts continue.\nFDA Pushes Transparency With Release of Drug Rejection Letters FDA begins publishing drug rejection letters in a transparency initiative aiming to shed light on regulatory decisions and improve public trust.",
    "Date&Time": "2025-06-17T14:47:15Z",
    "By Whom": "finance.yahoo.com",
    "Bussiness Impact": "Linda Yaccarino resigns as CEO of Elon Musk's X after two turbulent years marked by internal conflicts and a merger with Musk’s AI company, leaving the platform’s future uncertain.\nMarket Summary Markets face mixed signals as Trump’s tariff threats unsettle equities, though tech stocks like Nvidia ...",
    "URL reference": "https://biztoc.com/x/5e7be4ae45d8d41b",
    "Image URL": "https://biztoc.com/cdn/950/og.png",
    "Type Of News": "Competitor News",
    "Tags": "finance.yahoo.com, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "CCI clears Manipal Group's stake purchase in Aakash Educational Services",
    "Description Story": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nCompetition watchdog CCI on Tuesday said it has approved Ranjan Pai-led Manipal Group 's proposal to acquire a stake in Aakash Educational Services from its founder JC Chaudhry Manipal Group through its affiliates -- Manipal Health Systems and Manipal Education and Medical Group India (MEMG) -- will acquire stakes in New Delhi-based Aakash Educational Services.\"\"The transaction relates to the acquisition of equity shares in the target (Aakash Educational Services Ltd) by the acquirers (Manipal Health Systems and Manipal Education and Medical Group India) from JC Chaudhry, an individual shareholder in the target,\"\" the Competition Commission of India (CCI) said in a release.Pai is the largest shareholder having a 40 per cent stake in Aakash Educational Services.Manipal Health Systems operates hospitals, while Pai Family Group-owned MEMG offers consultancy services.\"\"CCI approves combination involving acquisition in Aakash Educational Services Ltd by Manipal Health Systems Pvt Ltd and Manipal Education and Medical Group India Pvt Ltd,\"\" the regulator said in a post on X.Aakash Educational Services provides comprehensive test preparatory services for students preparing for medical (NEET) and engineering entrance examinations (JEE) and competitive exams.",
    "Date&Time": "2025-06-24T14:09:20Z",
    "By Whom": "PTI",
    "Bussiness Impact": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nCompetition watchdog CCI on Tuesday said it has approved Ranjan Pai-led Manipal Group 's proposal to acquire a stake in Aakash Educational Services from its founder JC Chaudhry Manipal Grou...",
    "URL reference": "https://economictimes.indiatimes.com/industry/services/education/cci-clears-manipal-groups-stake-purchase-in-aakash-educational-services/articleshow/122050913.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122050928,width-1200,height-630,imgsize-32806,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "PTI, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Big money is making a beeline for Indian hospitals",
    "Description Story": "It seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
    "Date&Time": "2025-06-30T08:34:24Z",
    "By Whom": "ET Online",
    "Bussiness Impact": "It seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/big-money-is-making-a-beeline-for-indian-hospitals/articleshow/122156400.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122156606,width-1200,height-630,imgsize-107099,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "ET Online, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Manipal, Fortis in talks to raise Rs 5,000 cr for Sahyadri Hospitals bid",
    "Description Story": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nWith the bidding deadline for Sahyadri Hospitals approaching on June 22, interested bidders including Manipal Health Enterprises and Fortis Healthcare are engaging with foreign lenders to raise financing of up to Rs 5,000 crore, people familiar with the matter said. The funds will be used to back their respective bids for the multispecialty hospital chain.The two hospital operators are in discussions with banks including DBS Group Holdings , Deutsche Bank AG, Mizuho Bank, HSBC Holdings and Barclays, the people said, asking not to be named. Aster DM Healthcare , another potential bidder, is yet to firm up financing discussions, the people said.\"\"Fortis and Manipal are in talks with global banks to raise anywhere between Rs 3,000 crore and Rs 5,000 crore to fund the acquisition of Sahyadri Hospitals,\"\" one of the people quoted above said.Spokespersons of Manipal, Fortis, DBS, HSBC, Barclays, DB and Mizuho did not immediately respond to requests for comment.Ontario Teachers' Pension Plan (OTPP), which owns a 98.9% stake in Sahyadri Hospitals, is selling the asset less than three years after acquiring control. Sahyadri was Ontario Teachers' first control private equity buyout in India. The Canadian pension fund, which has more than $3 billion invested in India, hired Jefferies earlier this year to run the sale process.ET had reported on December 6, 2024 that OTPP will launch a process to sell Sahyadri Hospitals. OTPP had acquired the company from Everstone Capital at a Rs 2,500 crore valuation, which had earlier bought the chain from founder Dr Charudutt Apte in 2019 for Rs 1,000 crore. OTPP is a global investor with net assets of $266.3 billion as on December 31, 2024.Sahyadri operates 11 hospitals with 1,300 operational beds across Pune, Nashik and Karad in Maharashtra. Its facilities cover specialties, including cardiology, transplants, neurology and critical care. It has over 2,500 clinicians and 3,500 supporting staff. The company is empanelled under several government health schemes, including Ayushman Bharat and CGHS. It was founded in 1996 by Dr Apte, a neurosurgeon.The bidding for Sahyadri comes amid consolidation in India's hospital sector. Late last year, Blackstone and TPG-backed Quality Care India announced a merger with listed Aster DM to form India's third-largest hospital chain with over 10,000 beds.\"\"Post the Covid pandemic, the Indian hospital segment has been in investors' limelight due to a surge in primary market transactions with six hospitals concluding their IPOs, rising interest from new investors, predominantly private equity, for ownership, record FDI inflow into hospitals in FY24 at $1.53 billion, which is 50% of the overall investment in healthcare vs the 27% cumulative share since FY12 and aggressive bed expansion plans of listed hospitals,\"\" Tausif Shaikh, India analyst-pharma and healthcare at BNP Paribas India, said in a report released last year.",
    "Date&Time": "2025-06-15T19:04:31Z",
    "By Whom": "Shilpy Sinha",
    "Bussiness Impact": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nWith the bidding deadline for Sahyadri Hospitals approaching on June 22, interested bidders including Manipal Health Enterprises and Fortis Healthcare are engaging with foreign lenders to r...",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/manipal-fortis-in-talks-to-raise-rs-5000-cr-for-sahyadri-hospitals-bid/articleshow/121868272.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-121868280,width-1200,height-630,imgsize-121490,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Shilpy Sinha, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Aster DM sets sights on pan-India expansion after merger with Quality Care",
    "Description Story": "Aster DM Healthcare’s merger with Blackstone-backed Quality Care India Ltd (QCIL) was an inflection point for the hospital chain as it embarks on an ambitious expansion plan, deputy managing director Alisha Moopen told Mint in an interview.\nThe Bengaluru-based hospital group aims to expand its footprint across the country and become a pan-India healthcare leader in the next ten years, said Moopen. However, even as the company explores further inorganic opportunities, it is treading cautiously.\n“It has to make business sense…transactions are hard to execute because Indian markets have become so hot,\"\" said Moopen.\n“But if there's a great asset at the right price…of course, we'll look at it,\"\" she added.\nRead more: Apollo Hospitals: Simplifying corporate structure could lead to rerating\nThe merged entity Aster DM Quality Care Ltd, jointly controlled by Aster’s promoters and Blackstone, is in the fray for the acquisition of Canada's Ontario Teachers Pension Plan (OTPP)-owned Sahyadri Hospitals, according to media reports citing sources.\nThe Pune-based hospital has also reportedly received bids from Manipal Hospitals, Sweden-based investment firm EQT, and Malaysia-based IHH Healthcare.\nWhile Moopen declined to comment on the Sahyadri bid, she said that Aster would focus on the brand, reputation, trust and valuation of an asset when evaluating an acquisition. “…for us, we are all about sustainable growth,\"\" she said.\nAster DM announced in late November 2024 that it was merging with QCIL in a deal that will value the combined entity at $5.08 billion ( ₹43,000 crore). The merger is expected to conclude in the next six months.\nThe deal catapulted the merged entity among the top three hospital chains in India by bed size. The combined entity will have 10,301 beds, doubling from Aster DM’s current bed capacity of 5,159.\nIt also opens up new markets for Aster, which already has a strong footprint in Kerala and Karnataka, in new states like Madhya Pradesh, Odisha, Chhattisgarh and Tamil Nadu.\n“The transaction is an inflection point for the organization, and it's something which we believe will really set us up to become the gold standard for healthcare here,\"\" said Moopen, adding that the hospital chain, which has its roots in Dubai, is “probably one of the youngest [healthcare] brands in this country\"\".\n“We were spending a lot of time just setting up the core and setting the foundation. But now hopefully with this merger, we can really sort of have that exponential growth,\"\" said Moopen.\nExpansion plans\nThe merged entity has plans to grow organically through greenfield and brownfield projects in south and central India where Aster DM and Quality Care have strongholds. The total planned bed addition is over 3,300 beds over the next three years.\nHowever, growing pan-India and entering new markets is more challenging, said Moopen.\n“It takes a good five to ten years to understand a new market,\"\" she said, adding that it’s all about understanding regional nuances. However, making inroads through an already established player, via an acquisition or a merger, offers up an opportunity to meaningfully scale up in new markets, she added.\n“When the merger was happening, that was one of the biggest advantages we saw. Because it opens up three, four new states for us,\"\" said Moopen. “...we said, this is great. We don't have to go in from scratch.\"",
    "Date&Time": "",
    "By Whom": "",
    "Bussiness Impact": "",
    "URL reference": "",
    "Image URL": "",
    "Type Of News": "",
    "Tags": ""
  },
  {
    "Company": "Read more: Inside Cipla’s battle with ‘superbugs’ as antibiotic resistance rises in India",
    "Headline Title": "",
    "Description Story": "",
    "Date&Time": "",
    "By Whom": "",
    "Bussiness Impact": "",
    "URL reference": "",
    "Image URL": "",
    "Type Of News": "",
    "Tags": ""
  },
  {
    "Company": "The company plans to grow organically for the next three to four years in its core markets through strategic bed capacity addition, with a total capex outlay of ₹1,900 crore.",
    "Headline Title": "",
    "Description Story": "",
    "Date&Time": "",
    "By Whom": "",
    "Bussiness Impact": "",
    "URL reference": "",
    "Image URL": "",
    "Type Of News": "",
    "Tags": ""
  },
  {
    "Company": "However, the company is already eyeing the North India market and hopes to start making inroads in the next two to three years.",
    "Headline Title": "",
    "Description Story": "",
    "Date&Time": "",
    "By Whom": "",
    "Bussiness Impact": "",
    "URL reference": "",
    "Image URL": "",
    "Type Of News": "",
    "Tags": ""
  },
  {
    "Company": "“Whether we plan that organically or inorganically will depend on what happens in the next couple of years in terms of the opportunities that come up…we are evaluating all aspects,\"\" said Moopen.",
    "Headline Title": "",
    "Description Story": "",
    "Date&Time": "",
    "By Whom": "",
    "Bussiness Impact": "",
    "URL reference": "",
    "Image URL": "",
    "Type Of News": "",
    "Tags": ""
  },
  {
    "Company": "The company plans to fund its organic growth through internal accruals, and will explore raising debt for its inorganic plans, said Moopen.",
    "Headline Title": "",
    "Description Story": "",
    "Date&Time": "",
    "By Whom": "",
    "Bussiness Impact": "",
    "URL reference": "",
    "Image URL": "",
    "Type Of News": "",
    "Tags": ""
  },
  {
    "Company": "India’s private healthcare space is seeing a spree of expansions and consolidation, with major competitors like Apollo Hospitals, Max Healthcare and Narayana Health announcing large expansion plans for the next four to five years. According to a 2024 report by HSBC Global Research, seven listed hospitals will add 14,000 beds over the course of 3-5 years.",
    "Headline Title": "",
    "Description Story": "",
    "Date&Time": "",
    "By Whom": "",
    "Bussiness Impact": "",
    "URL reference": "",
    "Image URL": "",
    "Type Of News": "",
    "Tags": ""
  },
  {
    "Company": "Read more: Will Torrent Pharma’s big bet on JB Chemicals pay off?\"",
    "Headline Title": "2025-07-04T15:39:14Z",
    "Description Story": "Jessica Jani",
    "Date&Time": "Aster DM Healthcare’s merger with Blackstone-backed Quality Care India Ltd (QCIL) was an inflection point for the hospital chain as it embarks on an ambitious expansion plan, deputy managing director Alisha Moopen told Mint in an interview.\nThe Bengaluru-based hospital group aims to expand its foot...",
    "By Whom": "https://www.livemint.com/companies/aster-dm-healthcare-merger-quality-care-ltd-blackstone-expansion-plans-hospital-chain-apollo-max-manipal-alisha-moopen-11751635935782.html",
    "Bussiness Impact": "https://www.livemint.com/lm-img/img/2025/07/04/1600x900/alisha_1751642042905_1751642043359.jpg",
    "URL reference": "Competitor News",
    "Image URL": "Jessica Jani, NewsAPI.org",
    "Type Of News": "",
    "Tags": ""
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "AI, the doctor’s new stethoscope",
    "Description Story": "ETtech\nETtech\nETtech\nArtificial intelligence (AI) is emerging as an unlikely ally for India’s healthcare sector grappling with rising hospital patient loads and limited medical staff.With AI tackling routine tasks such as insurance claims and structuring clinical data, doctors say they now have more time to focus on what matters most - ‘the patient.’Hospital chains like Apollo, Manipal, and Narayana Health are adopting AI tools for diagnosis , early detection, and even drug discovery, either by building the technology in-house or through partnerships with new-age startups. Most of these solutions are helping streamline post-surgery care and improve patient engagement, according to experts.India’s AI healthcare market is growing at 40.6% compounded annually, with a current market size of $1.6 billion, Nasscom and Kantar said in a recent report, highlighting growing AI adoption among healthcare service providers.Experts say AI adoption is mainly aimed at driving operational efficiency in hospitals, boosting revenues. For instance, in the radiology department, AI tools can cut workloads by more than half, saving about 2-3 hours of documentation, doctors told ET.Industry watchers pointed out that only large hospital chains or academic institutions are currently deploying AI for clinical trials, with targeted partnerships. Government hospitals are dependent on private hospitals and technology companies for experimenting with AI.“One of the big opportunities for AI in India is making healthcare more accessible in vernacular languages, given the nuance in how symptoms are described across regions,” said Apollo CEO Dr Madhu Sasidhar.Apollo is using its Clinical Intelligence Engine, combined with ambient listening tools, saving more than 2–3 hours of documentation work every day for its medical staff.Big tech firms such as Google, Microsoft, and IBM have also partnered with Indian hospital chains to co-develop AI-driven medical tools. Google is collaborating with Aravind Eye Hospital for AI-based diabetic retinopathy detection, while IBM Watson is supporting Manipal Hospitals in cancer treatment planning.At Narayana Health, which specialises in cardiac care, large language models (LLMs) are being deployed to improve operational efficiency and predict clinical outcomes. One of its key projects is a machine learning model to predict sudden cardiac arrests in ICUs.“Since ICUs monitor 60-70 parameters at once, interactions between them can become complex. Our model provides a continuous cardiac arrest risk score and explains why the patient’s condition may be deteriorating, giving doctors a several-hour advance warning,” said Vivek Rajagopal, group chief analytics and AI officer at Narayana Health. The tool is currently in early-stage deployment in select ICUs.Not just hospitals, startups are also rapidly developing AI-driven solutions anticipating partnerships with hospitals and clinics. In 2024, the healthcare sector raised $1.13 billion in funding, according to market intelligence platform Kredible, with diagnostics, telemedicine, and digital health seeing significant traction.4baseCare, a Bengaluru-based precision oncology startup, is working with more than 250 hospitals to carry out precision diagnostic cancer treatment for people belonging to South Asia using a series of DNA and next generation sequencing tests, which were so far based on Caucasian or White people.AIIMS Jammu has partnered with the startup to establish a Centre for Advanced Genomics and Precision Medicine, for cancer diagnosis and treatment.Spovum Technologies, Bengaluru, is using AI to improve outcomes in assisted reproductive technologies (ART), especially in IVF procedures.“Globally, around 5% of oocytes get damaged during manual handling. With RoboICSI, we’ve demonstrated zero per cent degeneration by helping embryologists recognise patterns across more than 200 variables during the procedure,” said Ramnath Babu, co-founder.The startup has already supported more than 2,000 procedures and it currently works with 41 IVF clinics across India.Similarly, Garbhini-GA2, an AI model developed by IIT Madras and the Translational Health Science and Technology Institute, aims to precisely estimate gestational age (GA) in the second and third trimesters of pregnancy for the Indian population, which was previously measured using Caucasian models.While AI adoption is on the rise, experts cautioned that healthcare organisations will need to develop governance frameworks to monitor its performance and outcomes over time. Patient data security is also a major concern as India's existing healthcare system lacks data protection measures.Experts expect special provisions for healthcare data in the impending Personal Data Protection Bill to provide some direction.Hitesh Goswami, cofounder, 4baseCare highlighted systemic challenges in greater adoption of AI in the healthcare sector. “AI and healthcare are like star-crossed lovers,” he said, and explained that data that is being fed into AI needs to be structured to generate insight and context that is clinically meaningful.With genomics testing still expensive, 4baseCare is collaborating with state governments like Rajasthan through LuNGS Alliance to offer free next-generation genome sequencing (NGS) tests for lung cancer patients across India. The cost for the treatment is borne by the states.“More states should adopt such policies, so more patients can benefit,” he said.image.pngSimilar pain points were noted by hospital chains. “Healthcare always moves slower because of the stakes involved. We are dealing with real people, so we must validate systems rigorously before scaling. The technology exists, but it takes time for adoption to spread widely,” said a doctor helping startups develop AI tools.",
    "Date&Time": "2025-06-24T00:30:00Z",
    "By Whom": "Puran Choudhary and Swathi Moorthy",
    "Bussiness Impact": "ETtech\nETtech\nETtech\nArtificial intelligence (AI) is emerging as an unlikely ally for India’s healthcare sector grappling with rising hospital patient loads and limited medical staff.With AI tackling routine tasks such as insurance claims and structuring clinical data, doctors say they now have m...",
    "URL reference": "https://economictimes.indiatimes.com/tech/artificial-intelligence/ai-the-doctors-new-stethoscope/articleshow/122031698.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122031705,width-1200,height-630,imgsize-57192,overlay-ettech/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Puran Choudhary and Swathi Moorthy, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Manipal Health Enterprises leads race to buy Sahyadri Hospitals with Rs 6,838 crore bid",
    "Description Story": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nIPO-bound Manipal Health Enterprises is leading the race to acquire Sahyadri Hospitals with a Rs 6,838 crore ($800 million) bid, people familiar with the matter said. It is trailed closely by Blackstone , they said.While the sources did not reveal the financial terms of the global investment firm’s offer, the strong interest in the Pune-headquartered hospital chain owned by Canada’s pension fund Ontario Teachers’ Pension Plan (OTPP) is symptomatic of the high-intensity consolidation ongoing in India’s hospital space. IHH Healthcare-backed Fortis Healthcare and EQT Partners also submitted bids on June 23, which was the last day to submit binding financial bids.Their offers were termed “uncompetitive” by people ET spoke with. Manipal, Blackstone, Fortis and OTPP declined to comment. EQT did not responded to ET’s queries until press time Sunday.OTPP acquired Sahyadri from Everstone Capital in August 2022 at a valuation of around Rs 2,500 crore, outbidding Max Healthcare. Everstone had bought the hospital chain three years earlier in 2019 from its founder, neurosurgeon Charudutt Apte, for about Rs 1,000 crore. ET first reported on December 6 last year that OTPP was planning to put Sahyadri Hospitals on the block. In May, ET reported that Manipal Health, Singapore’s IHH Healthcare, Blackstone and TPG-backed platform Aster DM Quality Care Limited, KKR & Co and EQT Partners were among those that had submitted initial bids for it.Sahyadri Hospitals operates 11 facilities across Pune, Nashik, Ahilya Nagar and Karad, comprising 1,300 beds, 2,500 clinicians and 3,500 support staff, according to information available on its website. Sahyadri Hospitals is estimated to have posted Rs 210 crore in earnings before interest, tax, depreciation and amortisation on revenue of Rs 1,200 crore in FY25, said a fund manager at one of the bidding private equity funds.For Manipal Health, commonly known as Manipal Hospitals, the deal could provide a muchneeded strategic foothold in western India, where it currently lacks a significant presence. In June 2025, KKR invested $600 million in debt into the Manipal Group to support its accelerated expansion and corporate growth plans.The IPO-bound Manipal Hospitals, the second-largest hospital chain in India, has been on an aggressive acquisition spree. In 2023, it acquired an 84% stake in Kolkata-based AMRI Hospitals in a deal valued at Rs 2,400 crore. Two years earlier, it bought Columbia Asia's Indian operations for Rs 2,100 crore.",
    "Date&Time": "2025-06-30T00:30:00Z",
    "By Whom": "Mohit Bhalla and Reghu Balakrishnan",
    "Bussiness Impact": "Live Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nIPO-bound Manipal Health Enterprises is leading the race to acquire Sahyadri Hospitals with a Rs 6,838 crore ($800 million) bid, people familiar with the matter said. It is trailed closely ...",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/manipal-health-enterprises-leads-race-to-buy-sahyadri-hospitals-with-rs-6838-crore-bid/articleshow/122147217.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-122147216,width-1200,height-630,imgsize-103202,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Mohit Bhalla and Reghu Balakrishnan, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Stress at work? Doctors see rise in heart diseases among young executives",
    "Description Story": "Live Events\nRising sales of cardiac products\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nBengaluru | New Delhi: For 31-year-old techie Kumar, long hours at work carrying well into the night often led to stress eating, coupled with an occasional drink (or two) to “take off the edge”.The excesses magnified over the weekend, till one day when what he suspected was an episode of indigestion turned out to be a heart attack. Kumar, who doesn’t want to reveal his full name, has now been put on a strict diet by his doctor. He has been asked to cut out all unhealthy food, stop eating out and exercise.Kumar’s is not an isolated case. Leading cardiologists are sounding the alarm bells as they see an increase in people in their 20s and 30s being hospitalised for cardiac issues.Stress, lack of sleep, pollution and working at odd hours have all contributed to the increase in heart disease among young people, said noted cardiologist Naresh Trehan.“The numbers are worrisome; out of 34 beds in my ICU, nine are occupied by patients under 40,” said Naveen Bhamri, vice-chairman of cardiology at Max Super Speciality Hospital in New Delhi’s Shalimar Bagh, who performed an angioplasty on a 39-year-old this week. “A majority of my patients are in their 20s and 30s, who see long periods of inactivity due to being stuck at their desks, stressed out by the constant urban hustle and pressure to hit corporate targets.”Nishith Chandra, director, interventional cardiology at Fortis Escorts Heart Institute in the national capital, said he is seeing 10-20 patients in the age group of 20-30 years every month with heart-related issues.The key drivers behind this trend are sedentary lifestyle, lack of exercise, high stress, poor sleep and mental health issues, Chandra said. \"\"Undiagnosed hypertension, post-Covid heart inflammation, use of steroids and unsafe gym supplements, smoking, alcohol and recreational drug use are some other factors,\"\" he said.Hospitals across the country are reporting increased cases of young professionals having cardiovascular diseases, sudden cardiac arrests and heart attacks.“Not all of them have the typical triggers like diabetes, hypertension, obesity and family history. Recent data shows that one in four individuals having heart attacks are aged 40 and under,” said M Sudhakar Rao, consultant - cardiology at Manipal Hospital, Sarjapur, Bengaluru.A 26-year-old who Rao recently treated for a clot removal and stenting of artery was sleeping only four hours daily due to work pressure and deadlines.Tight deadlines and work pressure, constant hustle culture and impending burnout are causing Indian professionals to remain in sedentary positions for most of the day, get less sleep, and turn to unhealthy, processed foods — all of which can contribute significantly to the risk of heart attacks, say medical professionals.India is the diabetes and hypertension capital of the world, and people are genetically more predisposed to getting heart diseases, often earlier than their counterparts in the West, said Mukesh Goel, senior consultant - cardiothoracic and heart and lung transplant surgery at Delhi’s Indraprastha Apollo Hospitals. “There’s a difference of 10-15 years with the West.”Telehealth consultation data from Plum shows two-thirds of cardiac consultations come from the 25-40 age group, showing a premature cardiovascular ageing in India's prime working demographic.“We’ve observed that 71% of Indian working professionals are at moderate risk of chronic disease, showing warning signs across blood pressure, diabetes, cholesterol and obesity,” Saurabh Arora, cofounder of the insurtech startup, told ET.Covid has increased the risk further, said Trehan. “People who got serious Covid actually have much higher chance of developing heart disease because there is inflammation of the arteries, and the heart muscle became weak. So, if those who got serious Covid were not checked out then they should get it now”.Sales of drugs in the cardiac category have risen almost 50% in five years to Rs 30,723 crore in the 12 months through May 2025, according to data from market research firm PharmaTrac.The rising rate of cardiac diseases is driving the growth of cardiac therapy, propelled by strong uptake in lipid-lowering agents, anti- anginal therapies and heart failure treatments.\"\"Consumption of lipid-lowering agents, antianginal therapies and heart failure therapies have almost doubled in the last five years with Indians experiencing heart disease 5-10 years earlier than the global average. The age group has now come down to 30-40 years from earlier 50-60 years, said Sheetal Sapale, vice-president, commercial at PharmaTrac.Sales of cardiac products increased 11.7% in 2024 compared with the year before.Some companies are stepping up to drive better awareness on heart health and risk factors and running regular check-ups on cardiac health.Manipal Hospitals has ongoing partnerships with companies like Samsung and Goldman Sachs to drive awareness sessions and organise heart check-ups. Companies like CoinDCX and Meesho have included an ECG check-up for their teams, in addition to checks for risk factors like cholesterol, BP and glucose, said Plum’s Arora. As part of its annual well-being calendar, Manhattan Associates conducts a heart health webinar each year, featuring expert cardiologists to encourage employees to take proactive steps towards maintaining a healthy heart.More and more forward-thinking employers — especially in sectors like IT/ITeS, BFSI, pharma, and consulting — are beginning to shift their focus from insurance to prevention, said Nimitha Menon, health risk management consulting leader at Mercer Marsh Benefits.“Key initiatives being adopted include early preventive screenings and targeted lifestyle intervention programmes, advanced cardiac screenings, including ECG, lipid profiling, and calcium scoring from age 30 onward, as well as onsite diagnostic kiosks and partnerships with health check-up providers,” she said.",
    "Date&Time": "2025-06-20T16:41:09Z",
    "By Whom": "Brinda Sarkar, Sreeradha Basu, Teena Thacker",
    "Bussiness Impact": "Live Events\nRising sales of cardiac products\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nBengaluru | New Delhi: For 31-year-old techie Kumar, long hours at work carrying well into the night often led to stress eating, coupled with an occasion...",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/stress-at-work-doctors-see-rise-in-heart-diseases-among-young-executives/articleshow/121979583.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-121979631,width-1200,height-630,imgsize-43032,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Brinda Sarkar, Sreeradha Basu, Teena Thacker, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Deadline diet India's young workforce faces cardiac scare",
    "Description Story": "Agencies\nLive Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nFor 31-year-old techie Kumar, long hours at work carrying well into the night often led to stress eating, coupled with an occasional drink (or two) to \"\"take off the edge\"\".The excesses magnified over the weekend, till one day when what he suspected was an episode of indigestion turned out to be a heart attack. Kumar, who doesn't want to reveal his full name, has now been put on a strict diet by his doctor. He has been asked to cut out all unhealthy food, stop eating out and exercise.Kumar's is not an isolated case. Leading cardiologists are sounding the alarm bells as they see an increase in people in their 20s and 30s being hospitalised for cardiac issues. Stress, lack of sleep, pollution and working at odd hours have all contributed to the increase in heart disease among young people, said noted cardiologist Naresh Trehan.\"\"The numbers are worrisome; out of 34 beds in my ICU, nine are occupied by patients under 40,\"\" said Naveen Bhamri, vice-chairman of cardiology at Max Super Speciality Hospital in New Delhi's Shalimar Bagh, who performed an angioplasty on a 39-year-old this week. \"\"A majority of my patients are in their 20s and 30s, who see long periods of inactivity due to being stuck at their desks, stressed out by the constant urban hustle and pressure to hit corporate targets.\"\"Nishith Chandra, director, interventional cardiology at Fortis Escorts Heart Institute in the national capital, said he is seeing 10-20 patients in the age group of 20-30 years every month with heart-related issues.The key drivers behind this trend are sedentary lifestyle, lack of exercise, high stress, poor sleep and mental health issues, Chandra said. \"\"Undiagnosed hypertension, post-Covid heart inflammation, use of steroids and unsafe gym supplements, smoking, alcohol and recreational drug use are some other factors,\"\" he said.Hospitals across the country are reporting increased cases of young professionals having cardiovascular diseases, sudden cardiac arrests and heart attacks.\"\"Not all of them have the typical triggers like diabetes, hypertension, obesity and family history. Recent data shows that one in four individuals having heart attacks are aged 40 and under,\"\" said M Sudhakar Rao, consultant - cardiology at Manipal Hospital, Sarjapur, Bengaluru Tight deadlines and work pressure, constant hustle culture and impending burnout are causing Indian professionals to remain in sedentary positions for most of the day, get less sleep, and turn to unhealthy, processed foods - all of which can contribute significantly to the risk of heart attacks, say medical professionals.India is the diabetes and hypertension capital of the world, and people are genetically more predisposed to getting heart diseases, often earlier than their counterparts in the West, said Mukesh Goel, senior consultant - cardiothoracic and heart and lung transplant surgery at Delhi's Indraprastha Apollo Hospitals. \"\"There's a difference of 10-15 years with the West.\"\"Telehealth consultation data from Plum shows two-thirds of cardiac consultations come from the 25-40 age group, showing a premature cardiovascular ageing in India's prime working demographic.\"\"We've observed that 71% of Indian working professionals are at moderate risk of chronic disease, showing warning signs across blood pressure, diabetes, cholesterol and obesity,\"\" Saurabh Arora, cofounder of the insurtech startup, told ET.Covid has increased the risk further, said Trehan. \"\"People who got serious Covid actually have much higher chance of developing heart disease because there is inflammation of the arteries, and the heart muscle became weak. So, if those who got serious Covid were not checked out then they should get it now\"\".Sales of drugs in the cardiac category have risen almost 50% in five years to ₹30,723 crore in the 12 months through May 2025, according to data from market research firm PharmaTrac.\"\"Consumption of lipid-lowering agents, antianginal therapies and heart failure therapies have almost doubled in the last five years with Indians experiencing heart disease 5-10 years earlier than the global average. The age group has now come down to 30-40 years from earlier 50-60 years, said Sheetal Sapale, vice-president, commercial at PharmaTrac.Sales of cardiac products increased 11.7% in 2024 compared with the year before.Some companies are stepping up to drive better awareness on heart health and risk factors and running regular check-ups on cardiac health.Manipal Hospitals has ongoing partnerships with companies like Samsung and Goldman Sachs to drive awareness sessions and organise heart check-ups. Companies like CoinDCX and Meesho have included an ECG check-up for their teams, in addition to checks for risk factors like cholesterol, BP and glucose, said Plum’s Arora. As part of its annual well-being calendar, Manhattan Associates conducts a heart health webinar each year, featuring expert cardiologists to encourage employees to take proactive steps towards maintaining a healthy heart.More and more forward-thinking employers — especially in sectors like IT/ITeS, BFSI, pharma, and consulting — are beginning to shift their focus from insurance to prevention, said Nimitha Menon, health risk management consulting leader at Mercer Marsh Benefits.“Key initiatives being adopted include early preventive screenings and targeted lifestyle intervention programmes, advanced cardiac screenings, including ECG, lipid profiling, and calcium scoring from age 30 onward, as well as onsite diagnostic kiosks and partnerships with health check-up providers,” she said.",
    "Date&Time": "2025-06-21T17:32:35Z",
    "By Whom": "Brinda Sarkar, Sreeradha Basu, Teena Thacker",
    "Bussiness Impact": "Agencies\nLive Events\n(You can now subscribe to our\n(You can now subscribe to our Economic Times WhatsApp channel\nFor 31-year-old techie Kumar, long hours at work carrying well into the night often led to stress eating, coupled with an occasional drink (or two) to \"\"take off the edge\"\".The exce...",
    "URL reference": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/deadline-diet-indias-young-workforce-faces-cardiac-scare/articleshow/121996635.cms",
    "Image URL": "https://img.etimg.com/thumb/msid-121996688,width-1200,height-630,imgsize-88090,overlay-economictimes/articleshow.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Brinda Sarkar, Sreeradha Basu, Teena Thacker, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Heart related deaths among young in India not linked to COVID 19 vaccines: Health ministry",
    "Description Story": "A day after Karnataka Chief Minister Siddaramaiah attributed the increased number of deaths in Hassan district to heart attacks caused by COVID 19 vaccinations, the Indian council of medical research (ICMR) and the national centre for disease control (NCD) shunned speculations linking coronavirus vaccines to sudden premature deaths among adults post Covid-19.\nIn a press release on Wednesday, the Union ministry of health and family Welfare said that the national agencies investigated the issue and concluded that the covid-19 vaccines used during the pandemic were safe and effective and had no relation to the sudden deaths of young people in the country.\nLifestyle and pre-existing conditions were attributed as key factors behind the deaths by the Union ministry of health and family Welfare.\nIn order to understand the causes of sudden deaths in people aged between 18 to 45 years, the ICMR and the National Centre for Disease Control (NCDC) undertook two studies using different research methods.\nThe study by the name \"\"Factors associated with unexplained sudden deaths among adults aged 18-45 years in India - A multicentric matched case - control study\"\", was carried out from May to August 2023 across 47 tertiary care hospitals in 19 states and Union Territories, the ministry said in its statement.\nWhile the second study, \"\"Establishing the cause of sudden unexplained deaths in young\"\", was conducted by the All India Institute of Medical Sciences (AIIMS), New Delhi, with funding and in collaboration with ICMR.\nThe study was concentrated on people who died suddenly between October 2021 and March 2023 despite appearing to be healthy.\nWhat is heart attack and cardiac arrest?\nIn recent years, there has been a noticeable rise in cases of people succumbing to heart attack and cardiac arrest.\nA heart attack happens when a portion of the heart muscle is damaged due to blockage of coronary arteries that disrupts blood flow. While cardiac arrest is the sudden stoppage of heart function, leading to a cessation of blood circulation.\nDr Brajesh Kumar Mishra, Consultant - Cardiology, Manipal Hospital Gurugram, while speaking to WION said, \"\"Cardiac arrest in younger individuals often stems from structural abnormalities of the heart, such as Dilated cardiomyopathy, hypertrophic or channelopathy. These conditions are common causes of premature sudden cardiac death, particularly in teenagers and young adults.\"\"",
    "Date&Time": "2025-07-03T10:14:17Z",
    "By Whom": "Aditya Shukla",
    "Bussiness Impact": "A day after Karnataka Chief Minister Siddaramaiah attributed the increased number of deaths in Hassan district to heart attacks caused by COVID 19 vaccinations, the Indian council of medical research (ICMR) and the national centre for disease control (NCD) shunned speculations linking coronavirus va...",
    "URL reference": "https://www.wionews.com/india-news/heart-related-deaths-among-young-in-india-not-linked-to-covid-19-vaccines-health-ministry-1751537068647",
    "Image URL": "https://cdn1.wionews.com/prod/wion/images/2025/20250703/image-1751537427577.jpg?im=FitAndFill=(600,315)",
    "Type Of News": "Competitor News",
    "Tags": "Aditya Shukla, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Harsh Mander: The plunder and loot by private healthcare in India",
    "Description Story": "Paul Farmer in Pathologies of Power speaks evocatively of the crossroads at which humankind today finds itself. Healthcare, he observes, can be considered either a “commodity to be sold” or “a basic social right”. It cannot be both at the same time. Which of these pathways we will choose, he declares, is the highly consequential choice that people of goodwill must make “in these dangerous times”. He terms this as “the great drama” of our times.\nAs this “great drama” plays out in the world today, what choice are policymakers making?\nThe majority are opting for a significant, even paramount, role for for-profit private health providers in universal healthcare and the statutory right to health care. Their assumption is that the private sector will bring in efficiency, choice, high-quality healthcare and by bridging the resource gaps in public health systems, it will enhance the access of excluded groups. The result of these policy choices is a retreat of the state from direct healthcare provisioning, the crumbling of even the aspiration of a welfare state and the largescale transfer of scarce public funds to the private medical sector.\nIn this essay, I interrogate the legitimacy of these assumptions. The question I ask is whether there is not inherent in this choice of largescale public health provisioning by large corporate hospitals the potential for grave conflicts of interest? Is there not an intrinsic clash between, on one side, profit-seeking and, on the other, equitable quality healthcare that is based on need and not the capacity to pay?\nA challenge literally of life and death for policymakers is to find ways to best bridge the massive chasms between health needs and health access, especially of the poor.\nThinktank Oxfam, in its briefing paper Sick Development , explains that a “poorly evidenced, but largely unchallenged, narrative has emerged that says extending healthcare to those most denied it can be done by funding for-profit, fee-charging healthcare providers and encouraging more private finance, including private equity firms, to do the same”.\nThe stark and unconscionable reality of our world remains one in which half the world’s population are still excluded from access to even the most essential healthcare. Sixty people every second suffer catastrophic and impoverishing costs paying for healthcare out-of-pocket.\nThese approaches of placing the life and health of impoverished people in the hands of profit-driven large corporations would be “deeply unpopular in European nations but are being exported to the Global South, with little democratic oversight and with significant taxpayer-backed budgets”, says the briefing paper.\nWhat advocates of private health provisioning wilfully ignore is extensive evidence that for-profit private hospitals frequently block, bankrupt or even detain patients who cannot pay. Commercial and market-based approaches in healthcare can entrench and exacerbate the gap between rich and poor, and between women and men.\nA relative waits with a patient at a government hospital in Varanasi in August 2024 during a nationwide doctors strike. Credit: AFP\nThey also skew resources away from already under-funded government services while further excluding those who are excluded because they cannot pay or are socially oppressed. For-profit health providers lack incentives to prevent ill-health. Instead, the system hatches perverse incentives to misdiagnose or over-treat.\nPolicymakers and scholars do admit to the potential for conflicts of interests between profit and care. But the solution that we repeatedly encounter – as we did in our last chapter – is for robust and reliable regulatory systems for holding private health care providers accountable to high professional, ethical and equity standards. The argument is that if a coherent and legally enforceable robust ecosystem of state regulation, legal mandates, legal accountability, transparency and accountability is in place, these – with the active participation of patients and communities – can ensure that private health care providers are kept aligned with right to health goals.\nThis may sound convincing on paper. However, the reality is that accountability mechanisms on the ground are frequently found to be ineffective due to many reasons, such as weak implementation, fragmentation, and power asymmetries.\nEven where formal mechanisms for transparency and accountability are in place, they often fail in practice due to institutional weakness, regulatory capture, legal ambiguity, and the concentration of power among private healthcare actors. State regulators may be underfunded or politically constrained. Courts may defer to legislative silence or interpret contracts narrowly. Local governments often lack autonomy and resources. Patients and families face barriers such as legal illiteracy, fear of reprisal, and inaccessible complaint systems. This is even more the case in low- and middle- income countries where the juggernaut of private corporate healthcare provisioning is most triumphal.\nIn a salutary way, Oxfam draws attention to the impacts of enormous inequality in power, status and information between provider and patient inherent in healthcare provision. What makes for-profit healthcare different from public healthcare is the perverse incentive for profit-seekers to exploit this inequality for commercial gain. “All of Oxfam’s interviews with patients and their relatives for this research laid bare the brutal reality that exploitation and extortion of patients and carers by for- profit healthcare providers are frighteningly easy, due to the universal willingness of human beings to make infinite sacrifices to save the life of a loved one”.\nBesides this rare sense of empowerment of impoverished patients to hold doctors to account, effective regulation of the private health sector requires both resources and robust state capacity. Studies establish that these are scant in low- and even middle-income countries, therefore it is unsurprising that regulation in these countries is often found to be wanting. But the only reasons for weak regulation of the private health sector may not just be that they lack in budgets and capacity.\nThe even more fundamental constraints may be that there is little political will to hold powerful big business in check. And this may apply not just to low- and middle-income countries, but equally to rich countries. The reality of governments worldwide is of the formidable and ever-growing power of big business in policy making – of what Oxfam describes aptly as “elite capture” of the contemporary neo-liberal state; and, indeed, growing cronyism.\nSuch elite capture of policy making is pervasive and increasingly normalised. When Donald Trump was sworn in as President of the United States in January 2025, prominent among those in attendance were the world’s three wealthiest people – Tesla CEO and the world’s richest person Elon Musk (worth $433.9 billion), Amazon founder Jeff Bezos (worth $239.4 billion) and Meta’s Mark Zuckerberg ($211.8 billion). Their combined wealth was greater than the entire wealth of half the American population. The early months of Trump’s presidency – at the time I write this – is tarnished by the massive influence that Musk is visibly exercising on public decision-making in the world’s most powerful executive office.\nThe estimated value of the healthcare industry, including pharmaceutical and medical equipment companies, insurance and corporate hospital chains is a staggering $7 trillion. Health entrepreneurs are entering in growing numbers and power in billionaire lists of the richest people in many countries.\nThe president of leading health corporations in Brazil – Proparco and Rede D’or – is Brazil’s 10th richest billionaire. Ranjan Pai, controller of British International Investment-backed Manipal Group, saw his real-terms wealth grow by US$1.48bn in just one year alone. The cumulative impact of decades of neo-liberal policies is the effective transfer of power from public institutions to private enterprises.\nPublic health analyst Amit Sengupta regards that the state’s active role in facilitating the dominance of the private sector in healthcare not just a techno-managerial choice, but the wilful and wanton abdication by the state of its primary duties, by transferring responsibility for universal health care to the for-profit private health sector. Sengupta identifies what he calls “regulatory capture”, in which designated “experts” are drawn in by the state to assist and advise the state on the regulation of the very industries from which the “experts” are drawn.\nAgainst the sobering reality of this landscape of the political economy of much of our world, I am troubled by the assumption that is still widely purveyed by policymakers globally, that states have the power, the capacity and the will to regulate the private health sector, to ensure that they promote the public good rather than private profits. I wonder how effective can we expect regulations and remedies in law to be to actually prevent the conflict between the duty of equitable health provisioning and the corporate pursuit of profit?\nOxfam, in its briefing paper, documents how in Kenya and India patients are imprisoned by private hospitals for not paying their bills. The statutorily mandated right to emergency care is denied. Treatment is impossibly expensive. Patients entitled to free care are instead pushed deep into poverty, being forced to pay high fees to access health services.\nDuring the Covid-19 pandemic, some hospitals acted appallingly, profiteering even more than in normal times from people’s suffering and their fear of this new disease. Oxfam concludes that global and domestic taxpayers’ money is being ploughed into back expensive, for-profit private hospitals that block, bankrupt or even detain patients who cannot pay.\nThe report tells macabre stories of how a leading private hospital chain in Nairobi, Kenya, did not even release the corpses of patients who died for up to two years if the families could not pay the bills.\nA newborn baby was held for three months for the same reason, and her mother would come each day to the hospital to breast-feed her. A schoolboy was held hostage for 11 months until his parents paid the bills.\nIn Nigeria, a normal child delivery costs as much as nine months’ income for the poorest 50% of Nigerians. A caesarean birth was even more expensive, costing as much as 24 years’ income for the poorest 10%. The bill for one patient who died from the Covid-19 virus in a private hospital in Nigeria cost an incredible US$116,000.\nThe bottom line is this: Consider a most powerless, excluded woman or girl child – suffering savage discrimination because of her race, caste, religion, sexuality or her undocumented status – who seeks life-saving healthcare from a highly privatised healthcare system dominated by giant and politically powerful corporate hospitals. Can she realistically rely on state regulation of giant private health providers to ensure stoutly her right to high quality health care so her life is saved?\nFor clues to this question, I will in this essay focus my microscope on the experience of one of the most privatised health care systems in the world, India. Some observers rate this to be the most privatised healthcare systems in the world, surpassing even the United States.\nWhy is it instructive to look closely at the functioning of India’s private and corporatised health system? The hospital industry accounts for 80% of India’s total healthcare market. India has one of the highest out-of-pocket spending levels on health in the world. Out-of-pocket spending as a proportion of total health spending is a leading cause of impoverishment in India. Thirty-seven per cent of Indians experience catastrophic health expenditures in private hospitals.\nThe abdication of the state in provisioning healthcare is spectacular. The Economist in 2017 observed that India’s extreme reliance on private healthcare is not ideological as much as the outcome of the reality that “government has done such a lousy job” of providing healthcare.\nOver many years, India’s budgetary investment in public health has hovered from 0.8% to 1.1% of the country’s gross domestic product, among the lowest in the world. India stands fifth from the bottom in its public spending on health globally. And too little of even this paltry resource has gone into strengthening public health delivery and particularly into building primary healthcare. China invests three times this abysmal level.\nIn India’s mixed healthcare system, out-of-pocket spending and the market provision of services predominate. Only a little over a quarter of total health expenditure in India is borne by the state; the rest is out-of-pocket private spending and capital investments by the private sector. As much as 87% of private health spending is by individuals who lack insurance cover. Official data reveals that anything between 55 to 68 million people are pushed into poverty because of private health spending.\nPrivate health care accounts for 80% of all health transactions in India. Eighty out of 100 trained doctors in India work in the private health sector (and this is after a significant number have migrated to countries of the Global North, earning high salaries that spiral further up the benchmark of aspirations of doctors who continue to live and work in India). India ranks 155th out of 167 countries on hospital bed availability. Seventy-two per cent of hospitals and 60% of hospital beds are in the private sector. Eighty per cent of all out-patient health services and 60% of in-patient health services are supplied by the private sector.\nA quarter of a total of one million private health enterprises in India are middle to large medical establishments. In 2016, investments in private hospitals and diagnostic centres crossed 4000 million US dollars, including significant foreign capital transfers. Of 425 medical colleges in India, more than half are private medical colleges, accounting for 48% of all MBBS seats, with dizzyingly steep fees. They make large investments in land, buildings and equipment which they recover through sky-high fees. Naturally, the education they offer does little to prepare students for public service.\nA common defence of private sector investments in health, often with international aid and financial institutions significantly contributing the capital for these, is that these fill gaps in public health systems resulting from low available public funds.\nThe Oxfam briefing paper First, Do No Harm, nails the disingenuity, indeed the complete falsehood of these claims. It looks at where large corporate hospitals funded by World Bank’s private sector arm, the International Finance Corporation are located. It finds that these private corporate hospitals have done nothing to bridge the access gaps suffered by impoverished rural populations.\nFor most private hospitals are concentrated in highly populated urban areas, and that too in the more economically developed states, because this is where more income and therefore profit can be generated. Seventy-eight per cent of the International Finance Corporation direct investee chain hospitals are in Million Plus population cities. Sixty per cent of hospitals are in Tier 1 cities, 35% are in Tier 2 cities and only 4% are in smaller habitations.\nOf the 144 hospitals listed on the corporate websites of these chains, only one is in a rural area. Only 14% of the hospitals are in the 10 states ranked lowest in terms of the overall performance of the health system based on the Annual Health Index 2021; and not a single hospital operates in four of these 10 states.\nInsurance helps create the mirage that unaffordable healthcare is actually affordable, although studies reveal that not more than 25% Indians can actually afford private insurance. And the net outcome of the state bearing the costs of private insurance of impoverished households is the transfer of scarce public resources to the private sector which arguably could have been better spent on strengthening primary healthcare in the public sector.\nThe near-complete absence of mechanisms to prevent the conflict of interest in public health policy decision-making (including privatisation and purchase of medical equipment) creates fertile ground for kickbacks and profiteering by health administrators and government doctors. This conflict of interest often veers decision-makers away from choosing optimal, rational and low-cost options.\nTo map, in some granular detail, how the private health sector actually operates in an environment of low regulation like in India, I will draw partly on inside accounts by seasoned health practitioners, teachers and scholars.\nSeventy-eight such ethical doctors came together – many of them working in corporate hospitals choosing to be whistle-blowers – to reflect on the rot that has set into the vocation of health care. Their voices come together in a book titled Dissenting Diagnoses: Voices of Conscience from the Medical Profession, that should be compulsory reading for everyone seeking policy pathways to equitable and ethical healthcare.\nA similar sombre account emerges from Healers or Predators? Healthcare Corruption in India. In this book, policy makers, practitioners and public health scholars examine the deep-rooted crisis of the consistent denial of basic healthcare to the overwhelming majority of Indian citizens.\nI also draw from reports by Oxfam, a leading global voice for equity in health provisioning, particularly two that closely examine the functioning of private corporate hospitals established by global development aid and international funding institutions, in its briefing papers Sick Development and First, Do No Harm.\nThe picture that emerges from these searching and brave accounts by health insiders is sordid, terrifying and utterly unconscionable. We see how since the 1990s, in the “whirlwind” of privatisation, public health is consistently starved of funds and investments, and a relatively well-intentioned service-oriented vocation with the public health sector in the commanding heights is transformed first into a market-led commodity, and then into a corporate-led profiteering industry.\nPharmaceutical companies, medical equipment manufacturers, insurance companies, private medical colleges, international vaccine manufacturers, corporate hospitals and diagnostic centres, all join hands to convert health care into a high-premium commodity that becomes intractably inaccessible to the working and destitute poor.\nIt is not as though corruption was not rampant within public systems and does not continue to be so. But, as Kaveri Gill argues, in the public health sector, redress and reform are conceivably feasible if there is political will. Private sector corruption, on the other hand, appears beyond redress and redemption because corporate power is formidable, the spoils tremendous, corrupt practices pervasive and regulatory mechanisms feeble.\nSenior health practitioner Mani also affirms that corruption also characterised public healthcare when it dominated the Indian health scene in the first decades after freedom. There were surgeons who would not operate on patients unless they first met then in their private chambers and paid them a hefty fee. Doctors employed touts in bus stands and railway stations to waylay patients and lure them to their door, for a commission. But he said these were in the past exceptions, condemned by the majority of the medical community.\nHowever today such practices have become the norm. “We advertise ourselves”, he laments. “We employ touts to bring patients to us, we pay commissions to the doctors who send patients to us, we perform unnecessary and expensive tests and accept and even demand cutbacks from the diagnostic laboratories, we prescribe the most expensive of drugs and are rewarded for this by the pharmaceutical industry, and we even abet our patients’ efforts to defraud insurance companies. What will we not stoop to?”\nDr George Mathai, a physician from Alibag similarly grieves that “the very objectives and motivations for joining the medical profession have changed. Nowadays the only reason for joining the medical profession is to make as much money as one can, with as little work as one can get away with”. The personal conduct and ethical practice of doctors have hit new lows, as they prioritise profits over the welfare of patients. The social logic of “patients first” has given way almost fully to “profits first”.\nSpurred and bribed by the pharmaceutical industry and owners of corporate hospitals, doctors prescribe unnecessary tests, expensive medicines and redundant, even harmful procedures, all at soaring costs with inflated bills. The result is that patients have to bear unnecessary, sometimes catastrophic expenditures because private hospitals have invidious links with drug manufacturers, pharmacies and middlemen of many kinds, including even autorickshaw drivers.\nA senior and highly respected physician Dr Vijay Ajgaonkar bewails the many ethical distortions of the private health sector. Terminally ill 70- and 80-year-olds are kept in ICU and put on ventilators, even when there is no chance of their recovery, only to inflate hospital bills. In the process, they ruin the family and stretch the suffering of the patient. They don’t let him die in peace surrounded by his family members. In the ICU, there are tubes in his nose and mouth: he cannot speak even if he wants to. Even dead patients are sometimes retained on ventilators to further inflate hospital bills. Hospital agents converge like hawks at road accident sites to grab as many patients as they can. Doctors boast later about the numbers of “lambs” they have caught.\nAjgaonkar speaks bitterly of the bribes distributed by pharmaceutical companies, that include holidays abroad, expensive liquor, clothes, even expensive jewellery. The result, for instance, is that insulin that sold for Rs 30 rupees is now priced at Rs 150. Ethically the cost of research had long been recovered so the costs should instead have been reduced. Instead, the price is raised five times!\nMany other doctors also report that medicines with no greater benefits than cheaper versions are widely prescribed to benefit the pharmaceutical companies. The companies make small changes in the formula of medicines that carry no additional benefit, then raise the price greatly while withdrawing the cheaper medicine from the market and encouraging doctors to prescribe the expensive version. There is no reason for ethical doctors to not prescribe only generic medicines which would cost them much less. Instead, doctors prescribe expensive antibiotics when cheaper ones would be no less effective.\nThe plunder of patients does not end here. Hospitals further mark up the costs of medicines in their bills to sometimes five or 10 times the maximum retail price. Even more egregiously, sometimes patients are administered much higher doses of medicines than are required, even risking the health of the patient. Likewise, patients are charged two to five times the price of coronary stents, and experts estimate that nearly a third of all stenting procedures in India are inappropriate.\n“Doctors have now become servants of the pharmaceutical companies”, a physician observes dryly. Medical representatives take young doctors under their wings, benefit them materially and “retrain” them to adapt their practices in ways that maximise the company’s profits. They also draw doctors into bogus medical trials.\n“One of the tricks played by the corporate hospitals is that they rarely give you a full prescription listing all the medicines”, a patient reported to Oxfam. “The nurse just gives you a slip. That way it is difficult to know the prices they are charging.” Oxfam finds that this problem is widespread in India. Its report refers to recent studies that found that profit margins for medicines , consumables and diagnostics ranged from 100%-1,737% in four of the largest private hospitals in Delhi, and that these items made up almost half the cost of patient bills.\nIt is noteworthy that the scandalously inflated costs of the doctor-pharmaceutical company nexus are borne entirely by the patient. The patient pays for the medicine, but has no control over the choice of the medicine. It is this monopoly over decision-making that a doctor possesses that is exploited by pharmaceutical companies to maximise their profits at the expense of the powerless patient.\nThe massive growth of multi-speciality corporate hospitals has metamorphosised health care into a highly lucrative industry. Hospitals have been reinvented from havens of healing and care to oases of luxury and privilege.\nGadre and Shukla observe that with its massive growth with liberalisation and expansion of the IT industry, an Indian city like Pune should have at least 50 public hospitals. It has only one. On the other hand, new, shining, multi-speciality private corporate hospitals are rising everywhere. They compare these aptly with shopping malls, which they resemble not just architecturally but in their business model. Just as malls have edged out small retailers that sold groceries and consumables, corporate hospitals have edged out the single-doctor practices and small nursing homes of the past.\n“Hospital malls” have aggressively shifted the medical sector to the exclusive mercy of markets. Many of these private corporate hospitals claim to be charitable hospitals, which entitles them to concessional or free land and significant tax breaks. But in practice they rarely admit free patients, or if they are admitted, they are not respectfully treated.\nOxfam, too, records instances of refusal by private hospitals to extend free healthcare to patients living in poverty – although this was the conditions under which free or subsidised land was allotted to these hospitals. Poor patients also report to Oxfam instances of disrespectful behaviour by the staff of private corporate hospitals. “They don’t behave well to us when they know we are from the slum. When they learn that we are from the slum the hospital staff make us leave… We don’t take people there now… It is not for us. It is not for the poor families. It is for the rich people.”\nOxfam’s research also shows many cases of private hospitals unlawfully denying people emergency care, even though in India patients have a right to emergency care from all hospitals. For instance, a child was badly wounded and left unconscious by a traffic accident, but the private hospital denied treatment unless the family paid $1,200.\nUnethical practices begin right from the stage of writing the prescriptions. The initial diagnosis that the doctor makes is wantonly graver than warranted by the patient’s condition, only to justify unnecessary diagnostics, drugs and procedures. Often there are no findings listed in the prescription, only the tests and medicines.\nIn corporate hospitals, patients are typically seen by multiple doctors and each bill the patient separately. There are no regulations or oversight about qualifications, or standard treatment protocols. Patients are also admitted to hospitals when all they need is OPD care. All a child with diarrhoea may need is the administration of ORH in their homes. Instead, they are admitted to hospital and given saline drips and a hefty bill at the end of this.\nOxfam also encountered shocking instances of medical malpractice and exploitation. For instance, a patient testified that the hospital staff said he had an 80% blockage to his heart and needed emergency surgery if his life was to be saved. He was sceptical, took a discharge, and consulted with a government doctor who repeated the tests and showed the diagnosis to be entirely false.\nIn another such instance, a man got admitted into a private hospital to have a problematic gallstone removed. The hospital ran several tests on him, including an ECG and echocardiogram to check the health of his heart. After the surgery the same tests were done, and doctors said he had an 80% blockage in his heart and that they would need to operate to save him. They even began treatment for this without his consent. It took the intervention of an influential local figure to secure his release. He then consulted a government doctor, who repeated the tests and then said to him: “Whoever is telling you that your heart is blocked is not telling you the truth.”\nOxfam also found grave cases of medical negligence confirmed by regulators even in the high-end World Bank financed corporate hospitals.\nIn one a patient is dropped on the floor leading to multiple fractures and death. Another dies because the patient is left unattended in an ambulance. In yet another death results because cotton wool is left in a patient’s brain after brain surgery. For one patient, the wrong leg is operated on, and for another a child is left permanently disabled. One baby is declared dead by doctors only to be discovered to be breathing as the last rites are performed. This on top of the widespread problems of overcharging, price rigging, and financial conflict of interest.\nIn corporate hospitals, investigations are not based on what the patient’s illness is, or whether the patient actually needs particular investigations. Doctors employed in large corporate hospitals are given targets of prescribing diagnostic tests even when these are not necessary.\nHealthy pregnant women – to cite just one example – are pointlessly prescribed repeated hemograms, liver function tests and kidney function tests. Patients with confirmed diagnoses of depression are pointlessly prescribed expensive MRI and CT Scan tests. A gastroenterologist performs a series of endoscopies when only one is sufficient. Patients, influenced by marketing of corporate hospitals and diagnostic centres, themselves opt for “master check-ups”, most of which are unnecessary.\nAjgaonkar speaks of large public hospitals in Mumbai that have outsourced their radiology and lab departments to the private sector, only to benefit the private corporations. Pathologists also share that many pathological labs resort to what are informally called “sink tests”, in which the samples are just poured into the sink and a normal report sent. This can be dangerous for patients whose real maladies are missed.\nEven more shocking than a superfluous test is when procedures and surgeries are prescribed that are not needed. A doctor confided that he was contemplating giving up his lucrative position in a corporate hospital. This was because of the pressure from the hospital management to deliver a target of 40% “conversions” of OPD visits to hospital surgery. His ratio was 15%. But he was caught in a dilemma. After studying so hard, he needed a job. And the only jobs he could find were in corporate hospitals. How long would he heed the voice of his conscience?\nAnother senior cardiologist also spoke of the pulls of his conscience that led him to leave his well-paid position in a corporate hospital where he was pressured by the management to recommend and perform unnecessary procedures like angioplasties. Another surgeon testified that often “totally unnecessary surgeries are done in corporate hospitals. For instance, a small gall bladder stone is causing no discomfort to the patient. But the patient is scared into surgery.\nThere are even shocking “pretend surgeries” in which small cuts and sutures are made with no actual surgery, but hefty bills presented. Gynaecologists report peers who are impatient with monitoring 14 to sixteen hours of labour and instead opt for a caesarean operation with a high bill.\nA doctor explains it pithily, that first the hospital pays you a handsome salary, but then expects you to earn back that salary, even with – for instance – unnecessary kidney biopsies. Appendicitis and cataract operations and hysterectomies are performed when there is no need for these.\nA surgeon speaks of his helpless regret when he sees how the bills for surgeries were inflated. The costs of surgery are routinely fixed in corporate hospitals at rates far higher than justified, but the patient has little choice, especially if beds and this surgery are unavailable in public hospitals. There is no regulation of what a doctor or hospital can charge.\nFor small procedures and surgeries, it is not uncommon to raise bills many times higher than what is warranted. The doctor cites the case of a very minor inguinal hernia procedure for which the p",
    "Date&Time": "2025-06-25T02:08:22Z",
    "By Whom": "Harsh Mander",
    "Bussiness Impact": "Paul Farmer in Pathologies of Power speaks evocatively of the crossroads at which humankind today finds itself. Healthcare, he observes, can be considered either a “commodity to be sold” or “a basic social right”. It cannot be both at the same time. Which of these pathways we will choose, he declare...",
    "URL reference": "https://scroll.in/article/1083665/harsh-mander-the-plunder-and-loot-by-private-healthcare-in-india",
    "Image URL": "https://sc0.blr1.cdn.digitaloceanspaces.com/book/168944-caxyhbsopr-1644990291.jpg",
    "Type Of News": "Competitor News",
    "Tags": "Harsh Mander, NewsAPI.org"
  },
  {
    "Company": "Manipal Hospitals",
    "Headline Title": "Novo Holdings Reports Strong Momentum in Asia Across Healthcare and Planetary Health in 2024",
    "Description Story": "Novo Holdings Reports Strong Momentum in Asia Across Healthcare and Planetary Health in 2024\nLargest-ever Asia investment in India's Manipal Hospitals, a leading provider of high-quality, affordable healthcare\nFirst Planetary Health investment in Asia, backing AgNext Technologies in India to enhance food quality and safety using AI\nEnhanced presence in China with the opening of an expanded office in Shanghai, reaffirming long-term regional commitment\nContinued support for digital health innovators, including follow-on investments in Qure.ai and MedGenome\nSingapore (ANTARA/PRNewswire)- Novo Holdings today released its Asia Investments Year in Review 2024, highlighting a year of strategic growth and purpose-driven investing across healthcare, life sciences, and planetary health in key Asian markets. The report underscores Novo Holdings' commitment to building long-term partnerships that deliver both financial returns and societal impact.Now in its fifth year, the Novo Holdings Asia platform continues to strengthen its footprint across the region, with teams based in Singapore, Shanghai, and an upcoming office in Mumbai.Highlights from 2024 include:The Year in Review also reflects positive progress across Novo Holdings' Asia portfolio, with key portfolio milestones including FDA clearance for Qure.ai's lung nodule detection tool, strategic acquisitions by Manipal Hospitals and Medi Assist, and the launch of Doctor Anywhere's integrated MedSuites facility in Singapore.Read the full review at: https://novoholdings.dk/news/novo-holdings-reports-strong-momentum-in-asia-across-healthcare-and-planetary-health-in-2024 Novo Holdings is a holding and investment company responsible for managing the assets and wealth of the Novo Nordisk Foundation. The purpose of Novo Holdings is to improve people's health and the sustainability of society and the planet by generating attractive long-term returns on the assets of the Novo Nordisk Foundation. Wholly owned by the Foundation, Novo Holdings is the controlling shareholder of Novo Nordisk A/S and Novonesis A/S (formerly Novozymes A/S) and manages an investment portfolio with a long-term return perspective. In addition to managing a broad portfolio of equities, bonds, real estate, infrastructure, and private equity assets, Novo Holdings is a world-leading life sciences investor. Through its Seed, Venture, Growth, Asia, Planetary Health, and Principal Investments teams, Novo Holdings invests in life sciences companies at all stages of development. As of year-end 2024, Novo Holdings had total assets of EUR 142 billion.Source: Novo Holdings\nReporter: PR Wire\nEditor: PR Wire\nCopyright © ANTARA 2025",
    "Date&Time": "2025-06-24T03:44:41Z",
    "By Whom": "PR Wire",
    "Bussiness Impact": "Novo Holdings Reports Strong Momentum in Asia Across Healthcare and Planetary Health in 2024\nLargest-ever Asia investment in India's Manipal Hospitals, a leading provider of high-quality, affordable healthcare\nFirst Planetary Health investment in Asia, backing AgNext Technologies in India to enhan...",
    "URL reference": "https://en.antaranews.com/news/361429/novo-holdings-reports-strong-momentum-in-asia-across-healthcare-and-planetary-health-in-2024",
    "Image URL": "https://cdn.antaranews.com/cache/1200x800/2025/06/24/novo.jpg",
    "Type Of News": "Competitor News",
    "Tags": "PR Wire, NewsAPI.org"
  }
]